#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccoladeImageWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AccoladeImageWidget.AccoladeImageWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AccoladeImageWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AccoladeImageWidget_C_PreConstruct) == 0x000001, "Wrong alignment on AccoladeImageWidget_C_PreConstruct");
static_assert(sizeof(AccoladeImageWidget_C_PreConstruct) == 0x000001, "Wrong size on AccoladeImageWidget_C_PreConstruct");
static_assert(offsetof(AccoladeImageWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AccoladeImageWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AccoladeImageWidget.AccoladeImageWidget_C.EventSocket
// 0x0001 (0x0001 - 0x0000)
struct AccoladeImageWidget_C_EventSocket final
{
public:
	bool                                          bAlreadySocketed;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AccoladeImageWidget_C_EventSocket) == 0x000001, "Wrong alignment on AccoladeImageWidget_C_EventSocket");
static_assert(sizeof(AccoladeImageWidget_C_EventSocket) == 0x000001, "Wrong size on AccoladeImageWidget_C_EventSocket");
static_assert(offsetof(AccoladeImageWidget_C_EventSocket, bAlreadySocketed) == 0x000000, "Member 'AccoladeImageWidget_C_EventSocket::bAlreadySocketed' has a wrong offset!");

// Function AccoladeImageWidget.AccoladeImageWidget_C.ExecuteUbergraph_AccoladeImageWidget
// 0x0080 (0x0080 - 0x0000)
struct AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bAlreadySocketed;               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_4;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget) == 0x000008, "Wrong alignment on AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget");
static_assert(sizeof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget) == 0x000080, "Wrong size on AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, EntryPoint) == 0x000000, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_struct_Variable) == 0x000004, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_struct_Variable_1) == 0x00000C, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_bool_Variable) == 0x000014, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_float_Variable) == 0x000018, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_float_Variable_1) == 0x00001C, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_bool_Variable_1) == 0x000020, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_bool_Variable_2) == 0x000021, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, K2Node_Event_IsDesignTime) == 0x000022, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000023, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000024, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_bool_Variable_3) == 0x000038, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, K2Node_Select_Default) == 0x00003C, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_BooleanAND_ReturnValue) == 0x000044, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, K2Node_CustomEvent_bAlreadySocketed) == 0x000045, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::K2Node_CustomEvent_bAlreadySocketed' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, K2Node_Select_Default_1) == 0x000048, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_byte_Variable) == 0x00004C, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_byte_Variable_1) == 0x00004E, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, K2Node_Select_Default_2) == 0x000050, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_PlayAnimation_ReturnValue_2) == 0x000058, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_bool_Variable_4) == 0x000060, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_GetEndTime_ReturnValue) == 0x000064, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_PlayAnimation_ReturnValue_3) == 0x000068, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, K2Node_Select_Default_3) == 0x000070, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_Less_IntInt_ReturnValue_1) == 0x000071, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, K2Node_Select_Default_4) == 0x000078, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::K2Node_Select_Default_4' has a wrong offset!");

}

