#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityDetailsView

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActivityDetailsView.ActivityDetailsView_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActivityDetailsView_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityDetailsView_C_PreConstruct) == 0x000001, "Wrong alignment on ActivityDetailsView_C_PreConstruct");
static_assert(sizeof(ActivityDetailsView_C_PreConstruct) == 0x000001, "Wrong size on ActivityDetailsView_C_PreConstruct");
static_assert(offsetof(ActivityDetailsView_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ActivityDetailsView_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ActivityDetailsView.ActivityDetailsView_C.ExecuteUbergraph_ActivityDetailsView
// 0x0008 (0x0008 - 0x0000)
struct ActivityDetailsView_C_ExecuteUbergraph_ActivityDetailsView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityDetailsView_C_ExecuteUbergraph_ActivityDetailsView) == 0x000004, "Wrong alignment on ActivityDetailsView_C_ExecuteUbergraph_ActivityDetailsView");
static_assert(sizeof(ActivityDetailsView_C_ExecuteUbergraph_ActivityDetailsView) == 0x000008, "Wrong size on ActivityDetailsView_C_ExecuteUbergraph_ActivityDetailsView");
static_assert(offsetof(ActivityDetailsView_C_ExecuteUbergraph_ActivityDetailsView, EntryPoint) == 0x000000, "Member 'ActivityDetailsView_C_ExecuteUbergraph_ActivityDetailsView::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityDetailsView_C_ExecuteUbergraph_ActivityDetailsView, K2Node_Event_IsDesignTime) == 0x000004, "Member 'ActivityDetailsView_C_ExecuteUbergraph_ActivityDetailsView::K2Node_Event_IsDesignTime' has a wrong offset!");

}

