#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityDetailsSetting

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityDetailsSetting.ActivityDetailsSetting_C
// 0x0028 (0x0298 - 0x0270)
class UActivityDetailsSetting_C final : public UFortActivityDetailsSettingsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          Border_Background;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Checked;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Unchecked;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_CheckBox;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnSettingChanged(bool NewValue);
	void BndEvt__Button_ToggleSetting_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_ToggleSetting_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_ActivityDetailsSetting(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityDetailsSetting_C">();
	}
	static class UActivityDetailsSetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityDetailsSetting_C>();
	}
};
static_assert(alignof(UActivityDetailsSetting_C) == 0x000008, "Wrong alignment on UActivityDetailsSetting_C");
static_assert(sizeof(UActivityDetailsSetting_C) == 0x000298, "Wrong size on UActivityDetailsSetting_C");
static_assert(offsetof(UActivityDetailsSetting_C, UberGraphFrame) == 0x000270, "Member 'UActivityDetailsSetting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityDetailsSetting_C, Border_Background) == 0x000278, "Member 'UActivityDetailsSetting_C::Border_Background' has a wrong offset!");
static_assert(offsetof(UActivityDetailsSetting_C, Image_Checked) == 0x000280, "Member 'UActivityDetailsSetting_C::Image_Checked' has a wrong offset!");
static_assert(offsetof(UActivityDetailsSetting_C, Image_Unchecked) == 0x000288, "Member 'UActivityDetailsSetting_C::Image_Unchecked' has a wrong offset!");
static_assert(offsetof(UActivityDetailsSetting_C, Switcher_CheckBox) == 0x000290, "Member 'UActivityDetailsSetting_C::Switcher_CheckBox' has a wrong offset!");

}

