#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserView

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserView.ActivityBrowserView_C
// 0x0058 (0x0540 - 0x04E8)
class UActivityBrowserView_C final : public UFortActivityBrowserView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Update_Out;                                        // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Update_In;                                         // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_SupportCreator;                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_ViewDetails_1;                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       EntryBox_ActivityTags;                             // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         LazyImage_HeaderBackplate;                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_HeaderControl;                             // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoloButton_C*                          SoloButton_Viewdetails;                            // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_ActivityBrowserView(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserView_C">();
	}
	static class UActivityBrowserView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserView_C>();
	}
};
static_assert(alignof(UActivityBrowserView_C) == 0x000008, "Wrong alignment on UActivityBrowserView_C");
static_assert(sizeof(UActivityBrowserView_C) == 0x000540, "Wrong size on UActivityBrowserView_C");
static_assert(offsetof(UActivityBrowserView_C, UberGraphFrame) == 0x0004E8, "Member 'UActivityBrowserView_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserView_C, Update_Out) == 0x0004F0, "Member 'UActivityBrowserView_C::Update_Out' has a wrong offset!");
static_assert(offsetof(UActivityBrowserView_C, Update_In) == 0x0004F8, "Member 'UActivityBrowserView_C::Update_In' has a wrong offset!");
static_assert(offsetof(UActivityBrowserView_C, Intro) == 0x000500, "Member 'UActivityBrowserView_C::Intro' has a wrong offset!");
static_assert(offsetof(UActivityBrowserView_C, Button_SupportCreator) == 0x000508, "Member 'UActivityBrowserView_C::Button_SupportCreator' has a wrong offset!");
static_assert(offsetof(UActivityBrowserView_C, Button_ViewDetails_1) == 0x000510, "Member 'UActivityBrowserView_C::Button_ViewDetails_1' has a wrong offset!");
static_assert(offsetof(UActivityBrowserView_C, EntryBox_ActivityTags) == 0x000518, "Member 'UActivityBrowserView_C::EntryBox_ActivityTags' has a wrong offset!");
static_assert(offsetof(UActivityBrowserView_C, Image_Background) == 0x000520, "Member 'UActivityBrowserView_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UActivityBrowserView_C, LazyImage_HeaderBackplate) == 0x000528, "Member 'UActivityBrowserView_C::LazyImage_HeaderBackplate' has a wrong offset!");
static_assert(offsetof(UActivityBrowserView_C, SizeBox_HeaderControl) == 0x000530, "Member 'UActivityBrowserView_C::SizeBox_HeaderControl' has a wrong offset!");
static_assert(offsetof(UActivityBrowserView_C, SoloButton_Viewdetails) == 0x000538, "Member 'UActivityBrowserView_C::SoloButton_Viewdetails' has a wrong offset!");

}

