#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserTile

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserTile.ActivityBrowserTile_C
// 0x0030 (0x0C20 - 0x0BF0)
class UActivityBrowserTile_C final : public UFortActivityBrowserTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0BF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SetDisabled;                                       // 0x0C00(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SetEnabled;                                        // 0x0C08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0C10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0C18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void Set_Enabled();
	void Set_Disabled();
	void Construct();
	void BP_OnUnhovered();
	void BP_OnSelected();
	void BP_OnHovered();
	void BP_OnDeselected();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_ActivityBrowserTile(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserTile_C">();
	}
	static class UActivityBrowserTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserTile_C>();
	}
};
static_assert(alignof(UActivityBrowserTile_C) == 0x000008, "Wrong alignment on UActivityBrowserTile_C");
static_assert(sizeof(UActivityBrowserTile_C) == 0x000C20, "Wrong size on UActivityBrowserTile_C");
static_assert(offsetof(UActivityBrowserTile_C, UberGraphFrame) == 0x000BF0, "Member 'UActivityBrowserTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTile_C, Intro) == 0x000BF8, "Member 'UActivityBrowserTile_C::Intro' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTile_C, SetDisabled) == 0x000C00, "Member 'UActivityBrowserTile_C::SetDisabled' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTile_C, SetEnabled) == 0x000C08, "Member 'UActivityBrowserTile_C::SetEnabled' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTile_C, OnHover) == 0x000C10, "Member 'UActivityBrowserTile_C::OnHover' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTile_C, NewVar_0) == 0x000C18, "Member 'UActivityBrowserTile_C::NewVar_0' has a wrong offset!");

}

