#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityDetailsPlayPanel

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityDetailsPlayPanel.ActivityDetailsPlayPanel_C
// 0x0020 (0x0478 - 0x0458)
class UActivityDetailsPlayPanel_C final : public UFortActivityDetailsPlayPanel
{
public:
	class UImage*                                 Image;                                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_61;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoloButton_C*                          SoloButton;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoloButton_C*                          SoloButton_1;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityDetailsPlayPanel_C">();
	}
	static class UActivityDetailsPlayPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityDetailsPlayPanel_C>();
	}
};
static_assert(alignof(UActivityDetailsPlayPanel_C) == 0x000008, "Wrong alignment on UActivityDetailsPlayPanel_C");
static_assert(sizeof(UActivityDetailsPlayPanel_C) == 0x000478, "Wrong size on UActivityDetailsPlayPanel_C");
static_assert(offsetof(UActivityDetailsPlayPanel_C, Image) == 0x000458, "Member 'UActivityDetailsPlayPanel_C::Image' has a wrong offset!");
static_assert(offsetof(UActivityDetailsPlayPanel_C, Image_61) == 0x000460, "Member 'UActivityDetailsPlayPanel_C::Image_61' has a wrong offset!");
static_assert(offsetof(UActivityDetailsPlayPanel_C, SoloButton) == 0x000468, "Member 'UActivityDetailsPlayPanel_C::SoloButton' has a wrong offset!");
static_assert(offsetof(UActivityDetailsPlayPanel_C, SoloButton_1) == 0x000470, "Member 'UActivityDetailsPlayPanel_C::SoloButton_1' has a wrong offset!");

}

