#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityDetailsView

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityDetailsView.ActivityDetailsView_C
// 0x0038 (0x0530 - 0x04F8)
class UActivityDetailsView_C final : public UFortActivityDetailsView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         LazyImage_HeaderBackplate_1;                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_ActivityDetails;                           // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsActivityBrowser;                                 // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void ExecuteUbergraph_ActivityDetailsView(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityDetailsView_C">();
	}
	static class UActivityDetailsView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityDetailsView_C>();
	}
};
static_assert(alignof(UActivityDetailsView_C) == 0x000008, "Wrong alignment on UActivityDetailsView_C");
static_assert(sizeof(UActivityDetailsView_C) == 0x000530, "Wrong size on UActivityDetailsView_C");
static_assert(offsetof(UActivityDetailsView_C, UberGraphFrame) == 0x0004F8, "Member 'UActivityDetailsView_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityDetailsView_C, FadeOut) == 0x000500, "Member 'UActivityDetailsView_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UActivityDetailsView_C, Intro) == 0x000508, "Member 'UActivityDetailsView_C::Intro' has a wrong offset!");
static_assert(offsetof(UActivityDetailsView_C, Image_Background) == 0x000510, "Member 'UActivityDetailsView_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UActivityDetailsView_C, LazyImage_HeaderBackplate_1) == 0x000518, "Member 'UActivityDetailsView_C::LazyImage_HeaderBackplate_1' has a wrong offset!");
static_assert(offsetof(UActivityDetailsView_C, Overlay_ActivityDetails) == 0x000520, "Member 'UActivityDetailsView_C::Overlay_ActivityDetails' has a wrong offset!");
static_assert(offsetof(UActivityDetailsView_C, IsActivityBrowser) == 0x000528, "Member 'UActivityDetailsView_C::IsActivityBrowser' has a wrong offset!");

}

