#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AshtonIndigoLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AshtonIndigoLayerAnimBP.AshtonIndigoLayerAnimBP_C
// 0x1CF0 (0x1F90 - 0x02A0)
class UAshtonIndigoLayerAnimBP_C final : public UFortItemLayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3FA53408464CD4342EEED38DC84FC0D1; // 0x02A8(0x0030)()
	float                                         Pitch;                                             // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AimOffsetAlpha;                                    // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_62D6F5B5461D7A8A982558834642F66E; // 0x02E8(0x0070)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8F7F5C4C42F62F933E99E6A2EFA80CD6; // 0x0358(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_C2620E3D4F60648E03E1258A5C5EA570; // 0x03C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_FE8BD06B4FFEB62B01AA05B59F459169; // 0x03F8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_643186774BBAF9624F9BAD90CF30EF7D; // 0x0468(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4ADEF6B74842B46EEAFBB193A96C95A5; // 0x0498(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_F5CCA32D4E4FBD0BDCDA21995EBC7C7E; // 0x04C8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_D3C6AD184E2F1195524968BB0CEFE179; // 0x04F8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2038AE324E802E7620BA798F02DB79A9; // 0x0528(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4532A62840342537CA3AC3B6BF2749E9; // 0x0558(0x0030)()
	struct FFortAnimInput_AdjustedAim             InputParam;                                        // 0x0588(0x0240)(NoDestructor)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_017B08AB449EF1BE685F50A9904669BC; // 0x07C8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_05BAA30348A3BF5141F2BD9C29153D0D; // 0x0838(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3C78569D47B0B0730E1C09862B384C8A; // 0x0868(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_74F8CDED4E1078ED62A0E2A76324FDF7; // 0x08D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8CD174E24EAA4E188BAA8A8C820709B6; // 0x0908(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_C594313746E5CFD154B290B287BA969A; // 0x0978(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DF30F00B4CCDB5D3EB4EFD8F825C2F46; // 0x09A8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_794252AA4CA6738691B2FDBCDBBEA621; // 0x0A20(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_937692284A16EA6B908D0F97918CFCBF; // 0x0A50(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_86D8056C48F8BD5DD3CD42AD92BE878F; // 0x0A80(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E4C4B5D54F785591F9C8BFB29C90A0C6; // 0x0B20(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_89F6279E4FE87ABC71033A9C43DA4CCF; // 0x0B98(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7B948D6E4E2804B57A97F695747A3C22; // 0x0C10(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_C3F6E61A4B631F57C49FE18CDF27CCB2; // 0x0C40(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_257A7A1744EAE6C043D890811F041B2B; // 0x0CE0(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_C5126D9F4174591B0BBB98AB06BF1736; // 0x0D80(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A8C42FF1409DA93842CC5D88B87F9F18; // 0x0E20(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0553FBA540A0E8DBA13D0F9DC8753F01; // 0x0E98(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_ADFDC5854DF77E66AA23C5BC5A2775F7; // 0x0F10(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36C27FBE45D276F7356370808973A0F6; // 0x0F88(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_B9FAB583407924964C3851B81E972B11; // 0x1000(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_E58BA52F415AD3491B3EAE971C441338; // 0x1030(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_BC920C2343FD526C77A8199E2063892B; // 0x10D0(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_D6012FF640D034BFBCB892969E50E890; // 0x1170(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35DD23AB4BB987E2E7897DA86E0E11FA; // 0x1210(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_97F45A7D45546C22372ECEA0EED544A1; // 0x1288(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1663B2524994AD69B410F49EE4A0429B; // 0x1300(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_126B439B408FDAD57A3D00B07AC003C9; // 0x1378(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1465F8484987F1559E93118ECEC8649D; // 0x13F0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_EFFEE47A4F16A09346DA83A0C5EC4A4D; // 0x1420(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_B96BCFDB4113E653C5E2AFBAC8C2E735; // 0x1490(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7180D18F4D2E4294D47B4C963854C00E; // 0x14C0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_E3FC678942205D0511E42F9AC6ED5CEA; // 0x1538(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_270CC44D4A473779EBFDCBBDA5490E8F; // 0x1568(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_716818614844F6C232EE5AAE8AEC4448; // 0x15E0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1CFFF5C34985DDDA9FF121912A30FA89; // 0x1610(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5457FFEB41F106B886DEC3A407534C4C; // 0x1688(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_C370B06E4EC7D360D926C390267252EE; // 0x16B8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_E7CAF2CC4CF69BA33BF93F9EFE76CDC2; // 0x16E8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4303FAF84F7984F676863E8A7798C555; // 0x1718(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5A835647492CD213B4027BA826916BB1; // 0x1788(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_DEC6A7274F97500F4246F6A20924F2EB; // 0x17B8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_64C2872C4DF8C084F9A83792734111A4; // 0x1828(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1EEEE0B8453E61DA832D07A6859C68AF; // 0x1858(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_B6686E6441A873CFADC9A0B2852055D0; // 0x18C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_611CDB53435F5F594D487F874AA05385; // 0x18F8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_F9244EED4CC06113ED0D0CA897592F70; // 0x1968(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_A33B3A1541ADEFEBC873E9A5C8CBCD4C; // 0x1998(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_96D707104FD915EC2E44188A6360D14B; // 0x1A08(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_C15C4D784E90720086BF78ADD3943175; // 0x1A38(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2BFAFF4740BAA3C96A134899A2516A31; // 0x1AA8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_E7DD4A7B4521B8DF2B3A7C9B9CA53B90; // 0x1AD8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_478AFE3B4D7537BB3BF6C4BBD84A6953; // 0x1B48(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_840FB74645B05FB51F0CFCBEA2699634; // 0x1B78(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_05E7447242B7B0859D38C2A0B6A457C7; // 0x1BE8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_C73F918B4C7659CD3B05F29A03370B48; // 0x1C18(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8CCC66304A29185F842A86BAF2B0C1CA; // 0x1C88(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8CC676C34EDA9A6406AC3AA47AD06636; // 0x1CB8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7D68DAB04E9E9D2648B175948E5EA3E9; // 0x1D28(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput_B17415CA445509F6B9A420B78F8DAF76; // 0x1D58(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F9235C99493589D2043DCE99354C0F09; // 0x1DC8(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_70F5156142FC72CCBB401F98908829F5; // 0x1E40(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_89AB5B224B8ACE1EA1E4A0A1A53987BC; // 0x1EE0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_599BC96E4ACC5396971FF3A00462BD9B; // 0x1F58(0x0030)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_AshtonIndigoLayerAnimBP(int32 EntryPoint);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive_0);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive_0);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive_0);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive_0);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive_0);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint_0);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive_0);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive_0);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive_0);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive_0);
