#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMOTDTile

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMOTDTile.AthenaMOTDTile_C
// 0x0088 (0x0320 - 0x0298)
class UAthenaMOTDTile_C final : public UFortAthenaMOTDTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHovered;                                         // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Details;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_PipDisplay;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLoadGuard*                       CommonLoadGuard_0;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fill;                                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_196;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ClickCatcher;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadingImage;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LoadingImageOvr;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  LoadSwitcher;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              NewsItemScale;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Tile;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bShowImageOnly;                                    // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PreviewPipCount;                                   // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool NewIsHovered)> OnHoveredChanged;                                  // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UpdateDisplay();
	void ShowImageOnly();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_AthenaMOTDTile(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMOTDTile_C">();
	}
	static class UAthenaMOTDTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMOTDTile_C>();
	}
};
static_assert(alignof(UAthenaMOTDTile_C) == 0x000008, "Wrong alignment on UAthenaMOTDTile_C");
static_assert(sizeof(UAthenaMOTDTile_C) == 0x000320, "Wrong size on UAthenaMOTDTile_C");
static_assert(offsetof(UAthenaMOTDTile_C, UberGraphFrame) == 0x000298, "Member 'UAthenaMOTDTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, OnHovered) == 0x0002A0, "Member 'UAthenaMOTDTile_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Intro) == 0x0002A8, "Member 'UAthenaMOTDTile_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Border_Details) == 0x0002B0, "Member 'UAthenaMOTDTile_C::Border_Details' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Border_PipDisplay) == 0x0002B8, "Member 'UAthenaMOTDTile_C::Border_PipDisplay' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, CommonLoadGuard_0) == 0x0002C0, "Member 'UAthenaMOTDTile_C::CommonLoadGuard_0' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Fill) == 0x0002C8, "Member 'UAthenaMOTDTile_C::Fill' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Image_196) == 0x0002D0, "Member 'UAthenaMOTDTile_C::Image_196' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Image_ClickCatcher) == 0x0002D8, "Member 'UAthenaMOTDTile_C::Image_ClickCatcher' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, LoadingImage) == 0x0002E0, "Member 'UAthenaMOTDTile_C::LoadingImage' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, LoadingImageOvr) == 0x0002E8, "Member 'UAthenaMOTDTile_C::LoadingImageOvr' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, LoadSwitcher) == 0x0002F0, "Member 'UAthenaMOTDTile_C::LoadSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, NewsItemScale) == 0x0002F8, "Member 'UAthenaMOTDTile_C::NewsItemScale' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, SizeBox_Tile) == 0x000300, "Member 'UAthenaMOTDTile_C::SizeBox_Tile' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, bShowImageOnly) == 0x000308, "Member 'UAthenaMOTDTile_C::bShowImageOnly' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, PreviewPipCount) == 0x00030C, "Member 'UAthenaMOTDTile_C::PreviewPipCount' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, OnHoveredChanged) == 0x000310, "Member 'UAthenaMOTDTile_C::OnHoveredChanged' has a wrong offset!");

}

