#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLockerTab

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLockerTab.AthenaLockerTab_C
// 0x0180 (0x0B38 - 0x09B8)
class UAthenaLockerTab_C final : public UAthenaCustomizationScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ItemInfoIntroOutro;                                // 0x09C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               AccountOvr;                                        // 0x09C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* BackpackSlot;                                      // 0x09D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationBannerButton_C*     BannerSlot;                                        // 0x09D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* BattleBusSlot;                                     // 0x09E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* CallingCardSlot;                                   // 0x09E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               CameraFramingWidget;                               // 0x09F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* CharacterSlot;                                     // 0x09F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ContrailSlot;                                      // 0x0A00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot1;                                        // 0x0A08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot2;                                        // 0x0A10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot3;                                        // 0x0A18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot4;                                        // 0x0A20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot5;                                        // 0x0A28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot6;                                        // 0x0A30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EmotesOvr;                                         // 0x0A38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               GearOvr;                                           // 0x0A40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* GliderSlot;                                        // 0x0A48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* HarvestToolSlot;                                   // 0x0A50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* HatSlot;                                           // 0x0A58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInfoHeaderWidget_C*                ItemInfoHeaderWidget;                              // 0x0A60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot1;                                     // 0x0A68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot2;                                     // 0x0A70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot3;                                     // 0x0A78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot4;                                     // 0x0A80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot5;                                     // 0x0A88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot6;                                     // 0x0A90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot7;                                     // 0x0A98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ItemWrapsOvr;                                      // 0x0AA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* LoadScreenSlot;                                    // 0x0AA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* MapMarkerSlot;                                     // 0x0AB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* MusicPackSlot;                                     // 0x0AB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShortDescriptionText;                              // 0x0AC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StatsHeader;                                       // 0x0AC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* TauntSlot;                                         // 0x0AD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* VehicleSkinSlot;                                   // 0x0AD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* VictoryPoseSlot;                                   // 0x0AE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressModalWidget_C*                 ProgressModal;                                     // 0x0AE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAthenaCustomizationSlotButtonWrapper_C*> AllSlots;                                          // 0x0AF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference)
	EAthenaCustomizationCategory                  CurrentCustomizationType;                          // 0x0B00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B01[0x3];                                      // 0x0B01(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentSubslotIndex;                               // 0x0B04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaItemCustomizationSelector_C*     ItemCustomizationSelector;                         // 0x0B08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       CustomizationSlotButtonToPlayConfirmationOn;       // 0x0B10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           AutoHideDetailsForDances;                          // 0x0B18(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* FirstSlotInMenu;                                   // 0x0B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstSlotBannerSlot;                            // 0x0B28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B29[0x7];                                      // 0x0B29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                LastHoveredSlot;                                   // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckOverrideCampaignHeroItemDetails(class UAthenaCustomizationSlotButtonWrapper_C* SlotButtonWrapper);
	void PlaySlotAnimationAndCenterSlot();
	void SetupWarningForSlot(class UAthenaCustomizationSlotButtonWrapper_C* InSlot);
	void SetupNavigation();
	void PlayEquippedLockerMusic_STW();
	void EnableSlotsForSTW();
	void OkToReshowOnHover(EAthenaCustomizationCategory Type, int32 Index_0, bool* Ok);
	void PlaySlotClickedAnimation(class UAthenaCustomizationSlotButton_C* SlotToPlayAnimOn);
	void CanShowEmptyForType(EAthenaCustomizationCategory CustomizationType, bool* bCanShowEmpty);
	void SelectWidget(class UAthenaCustomizationSlotButtonWrapper_C* InSelection);
	void SetHeaderToBanner();
	void BeginPickingCustomization(class UCommonButton* WidgetToReturnFocusTo, const struct FAthenaCustomizationParams& CustomizationParams_0);
	class UWidget* GetWidgetForFramingViewedItem();
	void SetItemDetailsToDisplay(class UFortItem* InputPin);
	void ShowVaultItemByCategory(EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex, bool CanShowEmpty);
	void HandleSlotHovered(class UAthenaCustomizationSlotButtonWrapper_C* HoveredSlot, EAthenaCustomizationCategory Type, const class FText& HeaderText, const class FText& DescriptionText, int32 SubslotIndex);
	void SelectFirstWidget();
	void ShowSavingModal();
	void SelectInitialWidgetForGamepad();
	void RegisterInputActions();
	void OnInputModeChanged(bool bUsingGamepad);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void Destruct();
	void BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void HideDetailsForDances();
	void SetSlotToBannerSlot();
	void OnTransitionedBySwitcher();
	void BannerModalDeactivated();
	void ExecuteUbergraph_AthenaLockerTab(int32 EntryPoint);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLockerTab_C">();
	}
	static class UAthenaLockerTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLockerTab_C>();
	}
};
static_assert(alignof(UAthenaLockerTab_C) == 0x000008, "Wrong alignment on UAthenaLockerTab_C");
static_assert(sizeof(UAthenaLockerTab_C) == 0x000B38, "Wrong size on UAthenaLockerTab_C");
static_assert(offsetof(UAthenaLockerTab_C, UberGraphFrame) == 0x0009B8, "Member 'UAthenaLockerTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemInfoIntroOutro) == 0x0009C0, "Member 'UAthenaLockerTab_C::ItemInfoIntroOutro' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, AccountOvr) == 0x0009C8, "Member 'UAthenaLockerTab_C::AccountOvr' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, BackpackSlot) == 0x0009D0, "Member 'UAthenaLockerTab_C::BackpackSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, BannerSlot) == 0x0009D8, "Member 'UAthenaLockerTab_C::BannerSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, BattleBusSlot) == 0x0009E0, "Member 'UAthenaLockerTab_C::BattleBusSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CallingCardSlot) == 0x0009E8, "Member 'UAthenaLockerTab_C::CallingCardSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CameraFramingWidget) == 0x0009F0, "Member 'UAthenaLockerTab_C::CameraFramingWidget' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CharacterSlot) == 0x0009F8, "Member 'UAthenaLockerTab_C::CharacterSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ContrailSlot) == 0x000A00, "Member 'UAthenaLockerTab_C::ContrailSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot1) == 0x000A08, "Member 'UAthenaLockerTab_C::DanceSlot1' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot2) == 0x000A10, "Member 'UAthenaLockerTab_C::DanceSlot2' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot3) == 0x000A18, "Member 'UAthenaLockerTab_C::DanceSlot3' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot4) == 0x000A20, "Member 'UAthenaLockerTab_C::DanceSlot4' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot5) == 0x000A28, "Member 'UAthenaLockerTab_C::DanceSlot5' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot6) == 0x000A30, "Member 'UAthenaLockerTab_C::DanceSlot6' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, EmotesOvr) == 0x000A38, "Member 'UAthenaLockerTab_C::EmotesOvr' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, GearOvr) == 0x000A40, "Member 'UAthenaLockerTab_C::GearOvr' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, GliderSlot) == 0x000A48, "Member 'UAthenaLockerTab_C::GliderSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, HarvestToolSlot) == 0x000A50, "Member 'UAthenaLockerTab_C::HarvestToolSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, HatSlot) == 0x000A58, "Member 'UAthenaLockerTab_C::HatSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemInfoHeaderWidget) == 0x000A60, "Member 'UAthenaLockerTab_C::ItemInfoHeaderWidget' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot1) == 0x000A68, "Member 'UAthenaLockerTab_C::ItemWrapSlot1' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot2) == 0x000A70, "Member 'UAthenaLockerTab_C::ItemWrapSlot2' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot3) == 0x000A78, "Member 'UAthenaLockerTab_C::ItemWrapSlot3' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot4) == 0x000A80, "Member 'UAthenaLockerTab_C::ItemWrapSlot4' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot5) == 0x000A88, "Member 'UAthenaLockerTab_C::ItemWrapSlot5' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot6) == 0x000A90, "Member 'UAthenaLockerTab_C::ItemWrapSlot6' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot7) == 0x000A98, "Member 'UAthenaLockerTab_C::ItemWrapSlot7' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapsOvr) == 0x000AA0, "Member 'UAthenaLockerTab_C::ItemWrapsOvr' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, LoadScreenSlot) == 0x000AA8, "Member 'UAthenaLockerTab_C::LoadScreenSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, MapMarkerSlot) == 0x000AB0, "Member 'UAthenaLockerTab_C::MapMarkerSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, MusicPackSlot) == 0x000AB8, "Member 'UAthenaLockerTab_C::MusicPackSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ShortDescriptionText) == 0x000AC0, "Member 'UAthenaLockerTab_C::ShortDescriptionText' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, StatsHeader) == 0x000AC8, "Member 'UAthenaLockerTab_C::StatsHeader' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, TauntSlot) == 0x000AD0, "Member 'UAthenaLockerTab_C::TauntSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, VehicleSkinSlot) == 0x000AD8, "Member 'UAthenaLockerTab_C::VehicleSkinSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, VictoryPoseSlot) == 0x000AE0, "Member 'UAthenaLockerTab_C::VictoryPoseSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ProgressModal) == 0x000AE8, "Member 'UAthenaLockerTab_C::ProgressModal' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, AllSlots) == 0x000AF0, "Member 'UAthenaLockerTab_C::AllSlots' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CurrentCustomizationType) == 0x000B00, "Member 'UAthenaLockerTab_C::CurrentCustomizationType' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CurrentSubslotIndex) == 0x000B04, "Member 'UAthenaLockerTab_C::CurrentSubslotIndex' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemCustomizationSelector) == 0x000B08, "Member 'UAthenaLockerTab_C::ItemCustomizationSelector' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CustomizationSlotButtonToPlayConfirmationOn) == 0x000B10, "Member 'UAthenaLockerTab_C::CustomizationSlotButtonToPlayConfirmationOn' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, AutoHideDetailsForDances) == 0x000B18, "Member 'UAthenaLockerTab_C::AutoHideDetailsForDances' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, FirstSlotInMenu) == 0x000B20, "Member 'UAthenaLockerTab_C::FirstSlotInMenu' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, bIsFirstSlotBannerSlot) == 0x000B28, "Member 'UAthenaLockerTab_C::bIsFirstSlotBannerSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, LastHoveredSlot) == 0x000B30, "Member 'UAthenaLockerTab_C::LastHoveredSlot' has a wrong offset!");

}

