#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMOTDWatchVideoWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMOTDWatchVideoWidget.AthenaMOTDWatchVideoWidget_C
// 0x0020 (0x0328 - 0x0308)
class UAthenaMOTDWatchVideoWidget_C final : public UFortAthenaMOTDWatchVideoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USafeZone*                              SafeZone_0;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UActivatableMovieWidget_Monolithic_C*   MonolithicVideoWidget;                             // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStreamMediaSource*                 MediaSource;                                       // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindVideoEvents();
	void CloseWidgetNoURL();
	void CloseWidget(const class FString& URL);
	void OnPopulateNews(const struct FAthenaNewsEntry& NewsEntry);
	void ExecuteUbergraph_AthenaMOTDWatchVideoWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMOTDWatchVideoWidget_C">();
	}
	static class UAthenaMOTDWatchVideoWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMOTDWatchVideoWidget_C>();
	}
};
static_assert(alignof(UAthenaMOTDWatchVideoWidget_C) == 0x000008, "Wrong alignment on UAthenaMOTDWatchVideoWidget_C");
static_assert(sizeof(UAthenaMOTDWatchVideoWidget_C) == 0x000328, "Wrong size on UAthenaMOTDWatchVideoWidget_C");
static_assert(offsetof(UAthenaMOTDWatchVideoWidget_C, UberGraphFrame) == 0x000308, "Member 'UAthenaMOTDWatchVideoWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWatchVideoWidget_C, SafeZone_0) == 0x000310, "Member 'UAthenaMOTDWatchVideoWidget_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWatchVideoWidget_C, MonolithicVideoWidget) == 0x000318, "Member 'UAthenaMOTDWatchVideoWidget_C::MonolithicVideoWidget' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWatchVideoWidget_C, MediaSource) == 0x000320, "Member 'UAthenaMOTDWatchVideoWidget_C::MediaSource' has a wrong offset!");

}

