#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCustomizationSlotButtonWrapper

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaCustomizationSlotButtonWrapper.AthenaCustomizationSlotButtonWrapper_C
// 0x0150 (0x03A8 - 0x0258)
class UAthenaCustomizationSlotButtonWrapper_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaCustomizationSlotButton_C*       SlotButton;                                        // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   BannerDisplayName;                                 // 0x0268(0x0018)(Edit, BlueprintVisible)
	EAthenaCustomizationCategory                  CustomizationType;                                 // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UCommonButton* Button, const struct FAthenaCustomizationParams& CustomizationParams)> OnSlotClicked;                                     // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UAthenaCustomizationSlotButtonWrapper_C* ButtonWrapper, EAthenaCustomizationCategory CustomizationType, class FText BannerLabel, class FText CustomizationDescription, int32 SubslotIndex)> OnSlotHovered;                                     // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   CategoryDescription;                               // 0x02A8(0x0018)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void()>              OnSlotUnhovered;                                   // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         SubslotIndex;                                      // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBangType                                 BangType;                                          // 0x02D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemCardSize                             SlottedItemCardSize;                               // 0x02D5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D6[0x2];                                      // 0x02D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SlotImage;                                         // 0x02D8(0x0088)(Edit, BlueprintVisible)
	bool                                          bAllowUnownedItems;                                // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOneItemPerSlot;                                   // 0x0361(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_362[0x6];                                      // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      OverrideSlotImage;                                 // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RequiredSlotTag;                                   // 0x0370(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FText                                   NoCosmeticWarning;                                 // 0x0378(0x0018)(Edit, BlueprintVisible)
	class FText                                   SlotInactiveWarning;                               // 0x0390(0x0018)(Edit, BlueprintVisible)

public:
	void GetCustomizationSlotActiveState(bool* bCosmeticAvaialble, bool* bActive);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__SlotButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void BndEvt__SlotButton_K2Node_ComponentBoundEvent_13_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__SlotButton_K2Node_ComponentBoundEvent_47_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_AthenaCustomizationSlotButtonWrapper(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaCustomizationSlotButtonWrapper_C">();
	}
	static class UAthenaCustomizationSlotButtonWrapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationSlotButtonWrapper_C>();
	}
};
static_assert(alignof(UAthenaCustomizationSlotButtonWrapper_C) == 0x000008, "Wrong alignment on UAthenaCustomizationSlotButtonWrapper_C");
static_assert(sizeof(UAthenaCustomizationSlotButtonWrapper_C) == 0x0003A8, "Wrong size on UAthenaCustomizationSlotButtonWrapper_C");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, UberGraphFrame) == 0x000258, "Member 'UAthenaCustomizationSlotButtonWrapper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, SlotButton) == 0x000260, "Member 'UAthenaCustomizationSlotButtonWrapper_C::SlotButton' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, BannerDisplayName) == 0x000268, "Member 'UAthenaCustomizationSlotButtonWrapper_C::BannerDisplayName' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, CustomizationType) == 0x000280, "Member 'UAthenaCustomizationSlotButtonWrapper_C::CustomizationType' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, OnSlotClicked) == 0x000288, "Member 'UAthenaCustomizationSlotButtonWrapper_C::OnSlotClicked' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, OnSlotHovered) == 0x000298, "Member 'UAthenaCustomizationSlotButtonWrapper_C::OnSlotHovered' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, CategoryDescription) == 0x0002A8, "Member 'UAthenaCustomizationSlotButtonWrapper_C::CategoryDescription' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, OnSlotUnhovered) == 0x0002C0, "Member 'UAthenaCustomizationSlotButtonWrapper_C::OnSlotUnhovered' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, SubslotIndex) == 0x0002D0, "Member 'UAthenaCustomizationSlotButtonWrapper_C::SubslotIndex' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, BangType) == 0x0002D4, "Member 'UAthenaCustomizationSlotButtonWrapper_C::BangType' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, SlottedItemCardSize) == 0x0002D5, "Member 'UAthenaCustomizationSlotButtonWrapper_C::SlottedItemCardSize' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, SlotImage) == 0x0002D8, "Member 'UAthenaCustomizationSlotButtonWrapper_C::SlotImage' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, bAllowUnownedItems) == 0x000360, "Member 'UAthenaCustomizationSlotButtonWrapper_C::bAllowUnownedItems' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, bOneItemPerSlot) == 0x000361, "Member 'UAthenaCustomizationSlotButtonWrapper_C::bOneItemPerSlot' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, OverrideSlotImage) == 0x000368, "Member 'UAthenaCustomizationSlotButtonWrapper_C::OverrideSlotImage' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, RequiredSlotTag) == 0x000370, "Member 'UAthenaCustomizationSlotButtonWrapper_C::RequiredSlotTag' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, NoCosmeticWarning) == 0x000378, "Member 'UAthenaCustomizationSlotButtonWrapper_C::NoCosmeticWarning' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, SlotInactiveWarning) == 0x000390, "Member 'UAthenaCustomizationSlotButtonWrapper_C::SlotInactiveWarning' has a wrong offset!");

}

