#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMOTDLandingWidget

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaMOTDLandingWidget.AthenaMOTDLandingWidget_C.SetTextIfValidOrDefault
// 0x0078 (0x0078 - 0x0000)
struct AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 String;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   DefaultText;                                       // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0060(0x0018)()
};
static_assert(alignof(AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault) == 0x000008, "Wrong alignment on AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault");
static_assert(sizeof(AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault) == 0x000078, "Wrong size on AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault");
static_assert(offsetof(AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault, Button) == 0x000000, "Member 'AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault::Button' has a wrong offset!");
static_assert(offsetof(AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault, String) == 0x000008, "Member 'AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault::String' has a wrong offset!");
static_assert(offsetof(AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault, DefaultText) == 0x000018, "Member 'AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault::DefaultText' has a wrong offset!");
static_assert(offsetof(AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault, Temp_bool_Variable) == 0x000030, "Member 'AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000050, "Member 'AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault, CallFunc_TextIsEmpty_ReturnValue) == 0x000059, "Member 'AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault, K2Node_Select_Default) == 0x000060, "Member 'AthenaMOTDLandingWidget_C_SetTextIfValidOrDefault::K2Node_Select_Default' has a wrong offset!");

// Function AthenaMOTDLandingWidget.AthenaMOTDLandingWidget_C.OnPopulateNews
// 0x0180 (0x0180 - 0x0000)
struct AthenaMOTDLandingWidget_C_OnPopulateNews final
{
public:
	struct FAthenaNewsEntry                       NewsEntry;                                         // 0x0000(0x0180)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMOTDLandingWidget_C_OnPopulateNews) == 0x000008, "Wrong alignment on AthenaMOTDLandingWidget_C_OnPopulateNews");
static_assert(sizeof(AthenaMOTDLandingWidget_C_OnPopulateNews) == 0x000180, "Wrong size on AthenaMOTDLandingWidget_C_OnPopulateNews");
static_assert(offsetof(AthenaMOTDLandingWidget_C_OnPopulateNews, NewsEntry) == 0x000000, "Member 'AthenaMOTDLandingWidget_C_OnPopulateNews::NewsEntry' has a wrong offset!");

// Function AthenaMOTDLandingWidget.AthenaMOTDLandingWidget_C.ExecuteUbergraph_AthenaMOTDLandingWidget
// 0x01C0 (0x01C0 - 0x0000)
struct AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaNewsEntry                       K2Node_Event_NewsEntry;                            // 0x0008(0x0180)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button_1;           // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button_2;           // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget) == 0x000008, "Wrong alignment on AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget");
static_assert(sizeof(AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget) == 0x0001C0, "Wrong size on AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget");
static_assert(offsetof(AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget, EntryPoint) == 0x000000, "Member 'AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget, K2Node_Event_NewsEntry) == 0x000008, "Member 'AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget::K2Node_Event_NewsEntry' has a wrong offset!");
static_assert(offsetof(AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000188, "Member 'AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000190, "Member 'AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget, K2Node_DynamicCast_bSuccess) == 0x000198, "Member 'AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget, K2Node_DynamicCast_AsIcon_Text_Button_1) == 0x0001A0, "Member 'AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget::K2Node_DynamicCast_AsIcon_Text_Button_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget, K2Node_DynamicCast_bSuccess_1) == 0x0001A8, "Member 'AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget, K2Node_DynamicCast_AsIcon_Text_Button_2) == 0x0001B0, "Member 'AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget::K2Node_DynamicCast_AsIcon_Text_Button_2' has a wrong offset!");
static_assert(offsetof(AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget, K2Node_DynamicCast_bSuccess_2) == 0x0001B8, "Member 'AthenaMOTDLandingWidget_C_ExecuteUbergraph_AthenaMOTDLandingWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

}

