#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMOTDPanel

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMOTDPanel.AthenaMOTDPanel_C
// 0x0050 (0x0360 - 0x0310)
class UAthenaMOTDPanel_C final : public UFortAthenaMOTDPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewPopUpIntro;                                     // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           BottomBorderBox;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MainOverlay;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpeedLines;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 BS_Default;                                        // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BS_SpecialEvent;                                   // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BS_SpecialEvent_Secondary;                         // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnShowBackground();
	void OnHideBackground();
	void ExecuteUbergraph_AthenaMOTDPanel(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMOTDPanel_C">();
	}
	static class UAthenaMOTDPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMOTDPanel_C>();
	}
};
static_assert(alignof(UAthenaMOTDPanel_C) == 0x000008, "Wrong alignment on UAthenaMOTDPanel_C");
static_assert(sizeof(UAthenaMOTDPanel_C) == 0x000360, "Wrong size on UAthenaMOTDPanel_C");
static_assert(offsetof(UAthenaMOTDPanel_C, UberGraphFrame) == 0x000310, "Member 'UAthenaMOTDPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDPanel_C, NewPopUpIntro) == 0x000318, "Member 'UAthenaMOTDPanel_C::NewPopUpIntro' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDPanel_C, BottomBorderBox) == 0x000320, "Member 'UAthenaMOTDPanel_C::BottomBorderBox' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDPanel_C, Lightbox) == 0x000328, "Member 'UAthenaMOTDPanel_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDPanel_C, MainOverlay) == 0x000330, "Member 'UAthenaMOTDPanel_C::MainOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDPanel_C, SafeZone_0) == 0x000338, "Member 'UAthenaMOTDPanel_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDPanel_C, SpeedLines) == 0x000340, "Member 'UAthenaMOTDPanel_C::SpeedLines' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDPanel_C, BS_Default) == 0x000348, "Member 'UAthenaMOTDPanel_C::BS_Default' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDPanel_C, BS_SpecialEvent) == 0x000350, "Member 'UAthenaMOTDPanel_C::BS_SpecialEvent' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDPanel_C, BS_SpecialEvent_Secondary) == 0x000358, "Member 'UAthenaMOTDPanel_C::BS_SpecialEvent_Secondary' has a wrong offset!");

}

