#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLobby

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLobby.AthenaLobby_C
// 0x0058 (0x0690 - 0x0638)
class UAthenaLobby_C final : public UAthenaLobbyBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFeaturedCreativeContent_C*             FeaturedCreativeContent;                           // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMatchmakingRegionAndPool_C*            MatchmakingRegion;                                 // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMinimalTeamDisplay_C*                  MinimalTeamDisplay;                                // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Main;                                      // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPunchCard_C*                           PunchCard;                                         // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFancyToastWidget_C*                    StoreToastWidget;                                  // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreToastRequest*                     StoreToastRequest;                                 // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TryShowToast;                                      // 0x0678(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    InputAction_InspectChallenges;                     // 0x0680(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void HandleLobbyColorSchemeChange(const struct FLinearColor& NewColorScheme, bool UseDefaultScheme);
	void ConfigureGenericLinkButton();
	void ShowPicker(EFortPickerMode Mode, int32 InitialOption, bool IgnoreFirstAccept);
	void StartAthenaLobbyMusic();
	void OnFailure_DA5E62624D068772EA890193344BA4AE();
	void OnSuccess_DA5E62624D068772EA890193344BA4AE();
	void OnComplete_CDEE9407403C60D364D45989D2D2A8CE(class UUserWidget* UserWidget);
	void BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Destruct();
	void Construct();
	void ShowMobileAutoFireScreen();
	void BP_OnDeactivated();
	void DisplayStoreUpdated(class UStoreToastRequest* StoreUpdatedRequest);
	void BP_OnActivated();
	void AttemptToShowToast();
	void TryToastAgainNextFrame();
	void BndEvt__StoreToastWidget_K2Node_ComponentBoundEvent_2_OnFinishedToast__DelegateSignature();
	void OnPlaylistChanged(EFortLobbyType LobbyType, const class UFortPlaylistAthena* PlaylistData);
	void DisplayGlyphQuestUpdated(int32 NewGlyphs);
	void ExecuteUbergraph_AthenaLobby(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLobby_C">();
	}
	static class UAthenaLobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLobby_C>();
	}
};
static_assert(alignof(UAthenaLobby_C) == 0x000008, "Wrong alignment on UAthenaLobby_C");
static_assert(sizeof(UAthenaLobby_C) == 0x000690, "Wrong size on UAthenaLobby_C");
static_assert(offsetof(UAthenaLobby_C, UberGraphFrame) == 0x000638, "Member 'UAthenaLobby_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, FeaturedCreativeContent) == 0x000640, "Member 'UAthenaLobby_C::FeaturedCreativeContent' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, MatchmakingRegion) == 0x000648, "Member 'UAthenaLobby_C::MatchmakingRegion' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, MinimalTeamDisplay) == 0x000650, "Member 'UAthenaLobby_C::MinimalTeamDisplay' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, Overlay_Main) == 0x000658, "Member 'UAthenaLobby_C::Overlay_Main' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, PunchCard) == 0x000660, "Member 'UAthenaLobby_C::PunchCard' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, StoreToastWidget) == 0x000668, "Member 'UAthenaLobby_C::StoreToastWidget' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, StoreToastRequest) == 0x000670, "Member 'UAthenaLobby_C::StoreToastRequest' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, TryShowToast) == 0x000678, "Member 'UAthenaLobby_C::TryShowToast' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, InputAction_InspectChallenges) == 0x000680, "Member 'UAthenaLobby_C::InputAction_InspectChallenges' has a wrong offset!");

}

