#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonBPTrackerWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSeasonBPTrackerWidget.AthenaSeasonBPTrackerWidget_C
// 0x0058 (0x02E8 - 0x0290)
class UAthenaSeasonBPTrackerWidget_C final : public UFortAccountWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonBPTrackerSimpleWidget_C*   AthenaSeasonBPTrackerSimpleWidget;                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BattelTierText;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CompleteMission;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_103;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         NextTierHB;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NextTierText;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PointBar;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TierTitle;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ShowHowToMission();
	void OnAccountInfoChanged(const struct FFortPublicAccountInfo& Result);
	void FadOutHowToMission();
	void ExecuteUbergraph_AthenaSeasonBPTrackerWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSeasonBPTrackerWidget_C">();
	}
	static class UAthenaSeasonBPTrackerWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSeasonBPTrackerWidget_C>();
	}
};
static_assert(alignof(UAthenaSeasonBPTrackerWidget_C) == 0x000008, "Wrong alignment on UAthenaSeasonBPTrackerWidget_C");
static_assert(sizeof(UAthenaSeasonBPTrackerWidget_C) == 0x0002E8, "Wrong size on UAthenaSeasonBPTrackerWidget_C");
static_assert(offsetof(UAthenaSeasonBPTrackerWidget_C, UberGraphFrame) == 0x000290, "Member 'UAthenaSeasonBPTrackerWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerWidget_C, FadeOut) == 0x000298, "Member 'UAthenaSeasonBPTrackerWidget_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerWidget_C, Intro) == 0x0002A0, "Member 'UAthenaSeasonBPTrackerWidget_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerWidget_C, AthenaSeasonBPTrackerSimpleWidget) == 0x0002A8, "Member 'UAthenaSeasonBPTrackerWidget_C::AthenaSeasonBPTrackerSimpleWidget' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerWidget_C, BattelTierText) == 0x0002B0, "Member 'UAthenaSeasonBPTrackerWidget_C::BattelTierText' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerWidget_C, CompleteMission) == 0x0002B8, "Member 'UAthenaSeasonBPTrackerWidget_C::CompleteMission' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerWidget_C, Image_103) == 0x0002C0, "Member 'UAthenaSeasonBPTrackerWidget_C::Image_103' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerWidget_C, NextTierHB) == 0x0002C8, "Member 'UAthenaSeasonBPTrackerWidget_C::NextTierHB' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerWidget_C, NextTierText) == 0x0002D0, "Member 'UAthenaSeasonBPTrackerWidget_C::NextTierText' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerWidget_C, PointBar) == 0x0002D8, "Member 'UAthenaSeasonBPTrackerWidget_C::PointBar' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerWidget_C, TierTitle) == 0x0002E0, "Member 'UAthenaSeasonBPTrackerWidget_C::TierTitle' has a wrong offset!");

}

