#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionOfferWidgetResizable

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaDirectAcquisitionOfferWidgetResizable.AthenaDirectAcquisitionOfferWidgetResizable_C
// 0x01C8 (0x0DD0 - 0x0C08)
class UAthenaDirectAcquisitionOfferWidgetResizable_C final : public UFortDirectAcquisitionOfferWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CarouselTransition;                                // 0x0C10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0C18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USpacer*                                AnimatedBarSpacer;                                 // 0x0C20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          AnimatedTimerBox;                                  // 0x0C28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaDirectAcquisitionOffer_SalesTextBanner_C* AthenaDirectAcquisitionOffer_PercentageOffBanner;  // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaDirectAcquisitionOffer_SpecialBanner_C* AthenaDirectAcquisitionOffer_SpecialBanner;        // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BattlePassGlow;                                    // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderRarityColored;                               // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BottomBorder;                                      // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlockOfferRemainingText;                 // 0x0C60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Currency1ItemImage;                                // 0x0C68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CustomBadge;                                       // 0x0C70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CustomBadgeOverlay;                                // 0x0C78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HighlightGlow;                                     // 0x0C80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 I_StrikeThrough;                                   // 0x0C88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemSeriesOrRarity_C*                  ItemSeriesOrRarity;                                // 0x0C90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockImage;                                         // 0x0C98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MainImage;                                         // 0x0CA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NameText;                                          // 0x0CA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               O_Sale_PreviousPrice;                              // 0x0CB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        OwnedSwitcher;                                     // 0x0CB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OwnedText;                                         // 0x0CC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Sale_PreviousPrice;                                // 0x0CC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SBPriceBox;                                        // 0x0CD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SBScaleDownArt;                                    // 0x0CD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SBTileSize;                                        // 0x0CE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         SeriesOverrideTexture;                             // 0x0CE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShortDescriptionText;                              // 0x0CF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice;                             // 0x0CF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBHeaderAndDescription;                            // 0x0D00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcherVIOLATOR;                            // 0x0D08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          LargeTile;                                         // 0x0D10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_D11[0x7];                                      // 0x0D11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MID_StrikeThrough;                                 // 0x0D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MTXStyle;                                          // 0x0D20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_D21[0x7];                                      // 0x0D21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MID_CarouselTimerProgressBar;                      // 0x0D28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            Carousel_NextItemImage;                            // 0x0D30(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         CarouselLoopTimeRemaining;                         // 0x0DB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CarouselLoopTimer;                                 // 0x0DBC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    BattleStarTemplate;                                // 0x0DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBattlepass;                                      // 0x0DC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void Bundle_Short_Text(class FText* Text);
	void TryToResetCarouselTimer();
	bool HasGroupedOffers();
	void GetOfferIndexAndCountText(int32* OfferIndex, class FText* OfferDisplayCount, int32* NextOfferIndex, class FText* NextOfferDisplayCount);
	void UpdateBadge();
	void UpdateStyle_Sizing();
	void UpdateStyle_Border();
	void UpdateStyle_MainText();
	void SetupSaleInfo(const class FText& SaleText, const class FText& NormalPrice, const class FString& BannerOverrideTag, bool bHasSale, bool bHasBattlePassStars, int32 iNumOfBattlePassStars);
	void UpdateSaleStatus();
	void Setup_Price();
	void UpdateShortDescription();
	void UpdateName();
	void SetupPrice(int32 PriceIndex, class UItemCount_C* PriceWidget);
	void UpdateStyle();
	void UpdateAvailability();
	void OfferSet();
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnOfferSet();
	void HandleOfferPurchaseComplete(bool bSuccess, const TArray<struct FPurchasedItemInfo>& PurchasedItems);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void OnUpdateStatus();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void Construct();
	void OnOfferAdded();
	void AnimEvent_Carousel_ImageSwap();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void PlayAnim_CarouselTransition();
	void BP_OnEntryReleased();
	void OnOfferTileBrushLoaded(const struct FSlateBrush& OfferBrush);
	void SetupThumbnailRenderer(class UFortItemThumbnailRenderer* InThumbnailRenderer);
	void UpdateCarousel(float InDeltaTime);
	void ExecuteUbergraph_AthenaDirectAcquisitionOfferWidgetResizable(int32 EntryPoint);
	void UpdateSeriesBlock();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaDirectAcquisitionOfferWidgetResizable_C">();
	}
	static class UAthenaDirectAcquisitionOfferWidgetResizable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaDirectAcquisitionOfferWidgetResizable_C>();
	}
};
static_assert(alignof(UAthenaDirectAcquisitionOfferWidgetResizable_C) == 0x000008, "Wrong alignment on UAthenaDirectAcquisitionOfferWidgetResizable_C");
static_assert(sizeof(UAthenaDirectAcquisitionOfferWidgetResizable_C) == 0x000DD0, "Wrong size on UAthenaDirectAcquisitionOfferWidgetResizable_C");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, UberGraphFrame) == 0x000C08, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, CarouselTransition) == 0x000C10, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::CarouselTransition' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, Hover) == 0x000C18, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::Hover' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, AnimatedBarSpacer) == 0x000C20, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::AnimatedBarSpacer' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, AnimatedTimerBox) == 0x000C28, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::AnimatedTimerBox' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, AthenaDirectAcquisitionOffer_PercentageOffBanner) == 0x000C30, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::AthenaDirectAcquisitionOffer_PercentageOffBanner' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, AthenaDirectAcquisitionOffer_SpecialBanner) == 0x000C38, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::AthenaDirectAcquisitionOffer_SpecialBanner' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, BattlePassGlow) == 0x000C40, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::BattlePassGlow' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, BorderRarityColored) == 0x000C48, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::BorderRarityColored' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, BottomBorder) == 0x000C50, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::BottomBorder' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, Check) == 0x000C58, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::Check' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, CommonTextBlockOfferRemainingText) == 0x000C60, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::CommonTextBlockOfferRemainingText' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, Currency1ItemImage) == 0x000C68, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::Currency1ItemImage' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, CustomBadge) == 0x000C70, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::CustomBadge' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, CustomBadgeOverlay) == 0x000C78, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::CustomBadgeOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, HighlightGlow) == 0x000C80, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::HighlightGlow' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, I_StrikeThrough) == 0x000C88, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::I_StrikeThrough' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, ItemSeriesOrRarity) == 0x000C90, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::ItemSeriesOrRarity' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, LockImage) == 0x000C98, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::LockImage' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, MainImage) == 0x000CA0, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::MainImage' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, NameText) == 0x000CA8, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::NameText' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, O_Sale_PreviousPrice) == 0x000CB0, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::O_Sale_PreviousPrice' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, OwnedSwitcher) == 0x000CB8, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::OwnedSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, OwnedText) == 0x000CC0, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::OwnedText' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, Sale_PreviousPrice) == 0x000CC8, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::Sale_PreviousPrice' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, SBPriceBox) == 0x000CD0, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::SBPriceBox' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, SBScaleDownArt) == 0x000CD8, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::SBScaleDownArt' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, SBTileSize) == 0x000CE0, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::SBTileSize' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, SeriesOverrideTexture) == 0x000CE8, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::SeriesOverrideTexture' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, ShortDescriptionText) == 0x000CF0, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::ShortDescriptionText' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, TextOfferDisplayPrice) == 0x000CF8, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::TextOfferDisplayPrice' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, VBHeaderAndDescription) == 0x000D00, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::VBHeaderAndDescription' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, WidgetSwitcherVIOLATOR) == 0x000D08, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::WidgetSwitcherVIOLATOR' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, LargeTile) == 0x000D10, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::LargeTile' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, MID_StrikeThrough) == 0x000D18, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::MID_StrikeThrough' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, MTXStyle) == 0x000D20, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::MTXStyle' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, MID_CarouselTimerProgressBar) == 0x000D28, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::MID_CarouselTimerProgressBar' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, Carousel_NextItemImage) == 0x000D30, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::Carousel_NextItemImage' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, CarouselLoopTimeRemaining) == 0x000DB8, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::CarouselLoopTimeRemaining' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, CarouselLoopTimer) == 0x000DBC, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::CarouselLoopTimer' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, BattleStarTemplate) == 0x000DC0, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::BattleStarTemplate' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidgetResizable_C, IsBattlepass) == 0x000DC8, "Member 'UAthenaDirectAcquisitionOfferWidgetResizable_C::IsBattlepass' has a wrong offset!");

}

