#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonLevelHeaderWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSeasonLevelHeaderWidget.AthenaSeasonLevelHeaderWidget_C
// 0x0020 (0x0290 - 0x0270)
class UAthenaSeasonLevelHeaderWidget_C final : public USeasonPassLevelWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 CurrentTierIndicator;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HeaderNumber;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          PaidHeaderBorder;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnSetup();
	void OnLockedStatusChanged(bool FreeUnlocked, bool PaidUnlocked);
	void ExecuteUbergraph_AthenaSeasonLevelHeaderWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSeasonLevelHeaderWidget_C">();
	}
	static class UAthenaSeasonLevelHeaderWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSeasonLevelHeaderWidget_C>();
	}
};
static_assert(alignof(UAthenaSeasonLevelHeaderWidget_C) == 0x000008, "Wrong alignment on UAthenaSeasonLevelHeaderWidget_C");
static_assert(sizeof(UAthenaSeasonLevelHeaderWidget_C) == 0x000290, "Wrong size on UAthenaSeasonLevelHeaderWidget_C");
static_assert(offsetof(UAthenaSeasonLevelHeaderWidget_C, UberGraphFrame) == 0x000270, "Member 'UAthenaSeasonLevelHeaderWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelHeaderWidget_C, CurrentTierIndicator) == 0x000278, "Member 'UAthenaSeasonLevelHeaderWidget_C::CurrentTierIndicator' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelHeaderWidget_C, HeaderNumber) == 0x000280, "Member 'UAthenaSeasonLevelHeaderWidget_C::HeaderNumber' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelHeaderWidget_C, PaidHeaderBorder) == 0x000288, "Member 'UAthenaSeasonLevelHeaderWidget_C::PaidHeaderBorder' has a wrong offset!");

}

