#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionConfirmation

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaDirectAcquisitionConfirmation.AthenaDirectAcquisitionConfirmation_C
// 0x00A8 (0x06D8 - 0x0630)
class UAthenaDirectAcquisitionConfirmation_C final : public UFortStoreFrontOfferDetailsWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaDirectAcquisitonDetails_BattlePassStarDetails_C* AthenaDirectAcquisitonDetails_BattlePassStarDetails; // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CancelButton;                                      // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Currency1ItemImage2;                               // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CurrencyVB;                                        // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ItemRewardsSB;                                     // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMTXButton_C*                           MTXButton;                                         // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaDirectAcquisitonDetails_RefundDisclaimer_C* NonrefundableText;                                 // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               O_Sale_PreviousPrice;                              // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OfferName;                                         // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PurchaseButton;                                    // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice1;                            // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOriginalPrice1;                                // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CanPurchase;                                       // 0x06A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsPurchasing;                                      // 0x06A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6AA[0x2];                                      // 0x06AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumberToPurchase;                                  // 0x06AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanPurchaseLeft;                                   // 0x06B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CanPurchaseRight;                                  // 0x06B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CanChangeQuantity;                                 // 0x06B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B3[0x5];                                      // 0x06B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              Confirm;                                           // 0x06B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Decline;                                           // 0x06C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_AthenaDirectAcquisitionConfirmation(int32 EntryPoint);
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_171_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BP_OnActivated();
	void OnOfferSet();
	void UpdateFromOffer();
	void SetupPrice(class UWidget* PriceContainer, class UTextBlock* NormalPriceText, class UWidget* SalePriceContainer, class UTextBlock* SalePriceText, class UImage* CurrencyImage);
	void UpdateItemList();
	void SetPurchaseNumber(int32 InNumToPurchse);
	void UpdateCatalogOfferName();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaDirectAcquisitionConfirmation_C">();
	}
	static class UAthenaDirectAcquisitionConfirmation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaDirectAcquisitionConfirmation_C>();
	}
};
static_assert(alignof(UAthenaDirectAcquisitionConfirmation_C) == 0x000008, "Wrong alignment on UAthenaDirectAcquisitionConfirmation_C");
static_assert(sizeof(UAthenaDirectAcquisitionConfirmation_C) == 0x0006D8, "Wrong size on UAthenaDirectAcquisitionConfirmation_C");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, UberGraphFrame) == 0x000630, "Member 'UAthenaDirectAcquisitionConfirmation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, AthenaDirectAcquisitonDetails_BattlePassStarDetails) == 0x000638, "Member 'UAthenaDirectAcquisitionConfirmation_C::AthenaDirectAcquisitonDetails_BattlePassStarDetails' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, CancelButton) == 0x000640, "Member 'UAthenaDirectAcquisitionConfirmation_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, CommonTextBlock_0) == 0x000648, "Member 'UAthenaDirectAcquisitionConfirmation_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, Currency1ItemImage2) == 0x000650, "Member 'UAthenaDirectAcquisitionConfirmation_C::Currency1ItemImage2' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, CurrencyVB) == 0x000658, "Member 'UAthenaDirectAcquisitionConfirmation_C::CurrencyVB' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, ItemRewardsSB) == 0x000660, "Member 'UAthenaDirectAcquisitionConfirmation_C::ItemRewardsSB' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, Lightbox) == 0x000668, "Member 'UAthenaDirectAcquisitionConfirmation_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, MTXButton) == 0x000670, "Member 'UAthenaDirectAcquisitionConfirmation_C::MTXButton' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, NonrefundableText) == 0x000678, "Member 'UAthenaDirectAcquisitionConfirmation_C::NonrefundableText' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, O_Sale_PreviousPrice) == 0x000680, "Member 'UAthenaDirectAcquisitionConfirmation_C::O_Sale_PreviousPrice' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, OfferName) == 0x000688, "Member 'UAthenaDirectAcquisitionConfirmation_C::OfferName' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, PurchaseButton) == 0x000690, "Member 'UAthenaDirectAcquisitionConfirmation_C::PurchaseButton' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, TextOfferDisplayPrice1) == 0x000698, "Member 'UAthenaDirectAcquisitionConfirmation_C::TextOfferDisplayPrice1' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, TextOriginalPrice1) == 0x0006A0, "Member 'UAthenaDirectAcquisitionConfirmation_C::TextOriginalPrice1' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, CanPurchase) == 0x0006A8, "Member 'UAthenaDirectAcquisitionConfirmation_C::CanPurchase' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, IsPurchasing) == 0x0006A9, "Member 'UAthenaDirectAcquisitionConfirmation_C::IsPurchasing' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, NumberToPurchase) == 0x0006AC, "Member 'UAthenaDirectAcquisitionConfirmation_C::NumberToPurchase' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, CanPurchaseLeft) == 0x0006B0, "Member 'UAthenaDirectAcquisitionConfirmation_C::CanPurchaseLeft' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, CanPurchaseRight) == 0x0006B1, "Member 'UAthenaDirectAcquisitionConfirmation_C::CanPurchaseRight' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, CanChangeQuantity) == 0x0006B2, "Member 'UAthenaDirectAcquisitionConfirmation_C::CanChangeQuantity' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, Confirm) == 0x0006B8, "Member 'UAthenaDirectAcquisitionConfirmation_C::Confirm' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, Decline) == 0x0006C8, "Member 'UAthenaDirectAcquisitionConfirmation_C::Decline' has a wrong offset!");

}

