#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLockerTab2

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLockerTab2.AthenaLockerTab2_C
// 0x01D8 (0x0AA0 - 0x08C8)
class UAthenaLockerTab2_C final : public UAthenaCustomizationScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ItemInfoIntroOutro;                                // 0x08D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x08D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OutroToPicker;                                     // 0x08E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               AccountOvr;                                        // 0x08E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* BackpackSlot;                                      // 0x08F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationBannerButton_C*     BannerSlot;                                        // 0x08F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* BattleBusSlot;                                     // 0x0900(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* CallingCardSlot;                                   // 0x0908(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* CharacterSlot;                                     // 0x0910(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ContrailSlot;                                      // 0x0918(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot1;                                        // 0x0920(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot2;                                        // 0x0928(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot3;                                        // 0x0930(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot4;                                        // 0x0938(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot5;                                        // 0x0940(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot6;                                        // 0x0948(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EmotesOvr;                                         // 0x0950(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               GearOvr;                                           // 0x0958(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* GliderSlot;                                        // 0x0960(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* HarvestToolSlot;                                   // 0x0968(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* HatSlot;                                           // 0x0970(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInfoHeaderWidget_C*                ItemInfoHeaderWidget;                              // 0x0978(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot1;                                     // 0x0980(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot2;                                     // 0x0988(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot3;                                     // 0x0990(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot4;                                     // 0x0998(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot5;                                     // 0x09A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot6;                                     // 0x09A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot7;                                     // 0x09B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ItemWrapsOvr;                                      // 0x09B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* LoadScreenSlot;                                    // 0x09C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* MapMarkerSlot;                                     // 0x09C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* MusicPackSlot;                                     // 0x09D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShortDescriptionText;                              // 0x09D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StatsHeader;                                       // 0x09E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* TauntSlot;                                         // 0x09E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* VehicleSkinSlot;                                   // 0x09F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* VictoryPoseSlot;                                   // 0x09F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressModalWidget_C*                 ProgressModal;                                     // 0x0A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAthenaCustomizationSlotButtonWrapper_C*> AllSlots;                                          // 0x0A08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference)
	EAthenaCustomizationCategory                  CurrentCustomizationType;                          // 0x0A18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A19[0x3];                                      // 0x0A19(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentSubslotIndex;                               // 0x0A1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaItemCustomizationSelector_C*     ItemCustomizationSelector;                         // 0x0A20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaCustomizationCategory                  CustomizationCategoryLastChanged;                  // 0x0A28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A29[0x3];                                      // 0x0A29(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CustimizationSubSlotLastChanged;                   // 0x0A2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CustomizationSelectionBeingProcessed;              // 0x0A30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A31[0x7];                                      // 0x0A31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCustomizationSlotButton_C*       CustomizationSlotButtonToPlayConfirmationOn;       // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           AutoHideDetailsForDances;                          // 0x0A40(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* FirstSlotInMenu;                                   // 0x0A48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaCustomizationCategory                  FirstCustomizationCategory;                        // 0x0A50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstSlotBannerSlot;                            // 0x0A51(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A52[0x6];                                      // 0x0A52(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaCustomizationParams             CustomizationParams;                               // 0x0A58(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void PlaySlotAnimationAndCenterSlot();
	void SetupWarningForSlot(class UAthenaCustomizationSlotButtonWrapper_C* InSlot);
	void SetupNavigation();
	void PlayEquippedLockerMusic_STW();
	void EnableSlotsForSTW();
	void OkToReshowOnHover(EAthenaCustomizationCategory Type, int32 Index_0, bool* Ok);
	void PlaySlotClickedAnimation(class UAthenaCustomizationSlotButton_C* SlotToPlayAnimOn);
	void CanShowEmptyForType(EAthenaCustomizationCategory CustomizationType, bool* bCanShowEmpty);
	void SelectWidget(class UAthenaCustomizationSlotButtonWrapper_C* InSelection);
	void SetHeaderToBanner();
	void BeginPickingCustomization(class UCommonButton* WidgetToReturnFocusTo, const struct FAthenaCustomizationParams& CustomizationParams_0);
	void SetItemDetailsToDisplay(class UFortItem* InputPin);
	void ShowVaultItemByCategory(EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex, bool CanShowEmpty);
	void HandleSlotHovered(class UAthenaCustomizationSlotButtonWrapper_C* HoveredSlot, EAthenaCustomizationCategory Type, const class FText& HeaderText, const class FText& DescriptionText, int32 SubslotIndex);
	void SelectFirstWidget();
	void ShowSavingModal();
	void SelectInitialWidgetForGamepad();
	void BP_OnActivated();
	void OnInputModeChanged(bool bUsingGamepad);
	void BP_OnDeactivated();
	void Construct();
	void Destruct();
	void BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ProccesTransitionToSelector();
	void HideDetailsForDances();
	void SetSlotToBannerSlot();
	void OnLoadoutChanged();
	void ExecuteUbergraph_AthenaLockerTab2(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLockerTab2_C">();
	}
	static class UAthenaLockerTab2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLockerTab2_C>();
	}
};
static_assert(alignof(UAthenaLockerTab2_C) == 0x000008, "Wrong alignment on UAthenaLockerTab2_C");
static_assert(sizeof(UAthenaLockerTab2_C) == 0x000AA0, "Wrong size on UAthenaLockerTab2_C");
static_assert(offsetof(UAthenaLockerTab2_C, UberGraphFrame) == 0x0008C8, "Member 'UAthenaLockerTab2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, ItemInfoIntroOutro) == 0x0008D0, "Member 'UAthenaLockerTab2_C::ItemInfoIntroOutro' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, Intro) == 0x0008D8, "Member 'UAthenaLockerTab2_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, OutroToPicker) == 0x0008E0, "Member 'UAthenaLockerTab2_C::OutroToPicker' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, AccountOvr) == 0x0008E8, "Member 'UAthenaLockerTab2_C::AccountOvr' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, BackpackSlot) == 0x0008F0, "Member 'UAthenaLockerTab2_C::BackpackSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, BannerSlot) == 0x0008F8, "Member 'UAthenaLockerTab2_C::BannerSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, BattleBusSlot) == 0x000900, "Member 'UAthenaLockerTab2_C::BattleBusSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, CallingCardSlot) == 0x000908, "Member 'UAthenaLockerTab2_C::CallingCardSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, CharacterSlot) == 0x000910, "Member 'UAthenaLockerTab2_C::CharacterSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, ContrailSlot) == 0x000918, "Member 'UAthenaLockerTab2_C::ContrailSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, DanceSlot1) == 0x000920, "Member 'UAthenaLockerTab2_C::DanceSlot1' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, DanceSlot2) == 0x000928, "Member 'UAthenaLockerTab2_C::DanceSlot2' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, DanceSlot3) == 0x000930, "Member 'UAthenaLockerTab2_C::DanceSlot3' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, DanceSlot4) == 0x000938, "Member 'UAthenaLockerTab2_C::DanceSlot4' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, DanceSlot5) == 0x000940, "Member 'UAthenaLockerTab2_C::DanceSlot5' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, DanceSlot6) == 0x000948, "Member 'UAthenaLockerTab2_C::DanceSlot6' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, EmotesOvr) == 0x000950, "Member 'UAthenaLockerTab2_C::EmotesOvr' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, GearOvr) == 0x000958, "Member 'UAthenaLockerTab2_C::GearOvr' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, GliderSlot) == 0x000960, "Member 'UAthenaLockerTab2_C::GliderSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, HarvestToolSlot) == 0x000968, "Member 'UAthenaLockerTab2_C::HarvestToolSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, HatSlot) == 0x000970, "Member 'UAthenaLockerTab2_C::HatSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, ItemInfoHeaderWidget) == 0x000978, "Member 'UAthenaLockerTab2_C::ItemInfoHeaderWidget' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, ItemWrapSlot1) == 0x000980, "Member 'UAthenaLockerTab2_C::ItemWrapSlot1' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, ItemWrapSlot2) == 0x000988, "Member 'UAthenaLockerTab2_C::ItemWrapSlot2' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, ItemWrapSlot3) == 0x000990, "Member 'UAthenaLockerTab2_C::ItemWrapSlot3' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, ItemWrapSlot4) == 0x000998, "Member 'UAthenaLockerTab2_C::ItemWrapSlot4' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, ItemWrapSlot5) == 0x0009A0, "Member 'UAthenaLockerTab2_C::ItemWrapSlot5' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, ItemWrapSlot6) == 0x0009A8, "Member 'UAthenaLockerTab2_C::ItemWrapSlot6' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, ItemWrapSlot7) == 0x0009B0, "Member 'UAthenaLockerTab2_C::ItemWrapSlot7' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, ItemWrapsOvr) == 0x0009B8, "Member 'UAthenaLockerTab2_C::ItemWrapsOvr' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, LoadScreenSlot) == 0x0009C0, "Member 'UAthenaLockerTab2_C::LoadScreenSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, MapMarkerSlot) == 0x0009C8, "Member 'UAthenaLockerTab2_C::MapMarkerSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, MusicPackSlot) == 0x0009D0, "Member 'UAthenaLockerTab2_C::MusicPackSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, ShortDescriptionText) == 0x0009D8, "Member 'UAthenaLockerTab2_C::ShortDescriptionText' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, StatsHeader) == 0x0009E0, "Member 'UAthenaLockerTab2_C::StatsHeader' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, TauntSlot) == 0x0009E8, "Member 'UAthenaLockerTab2_C::TauntSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, VehicleSkinSlot) == 0x0009F0, "Member 'UAthenaLockerTab2_C::VehicleSkinSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, VictoryPoseSlot) == 0x0009F8, "Member 'UAthenaLockerTab2_C::VictoryPoseSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, ProgressModal) == 0x000A00, "Member 'UAthenaLockerTab2_C::ProgressModal' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, AllSlots) == 0x000A08, "Member 'UAthenaLockerTab2_C::AllSlots' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, CurrentCustomizationType) == 0x000A18, "Member 'UAthenaLockerTab2_C::CurrentCustomizationType' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, CurrentSubslotIndex) == 0x000A1C, "Member 'UAthenaLockerTab2_C::CurrentSubslotIndex' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, ItemCustomizationSelector) == 0x000A20, "Member 'UAthenaLockerTab2_C::ItemCustomizationSelector' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, CustomizationCategoryLastChanged) == 0x000A28, "Member 'UAthenaLockerTab2_C::CustomizationCategoryLastChanged' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, CustimizationSubSlotLastChanged) == 0x000A2C, "Member 'UAthenaLockerTab2_C::CustimizationSubSlotLastChanged' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, CustomizationSelectionBeingProcessed) == 0x000A30, "Member 'UAthenaLockerTab2_C::CustomizationSelectionBeingProcessed' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, CustomizationSlotButtonToPlayConfirmationOn) == 0x000A38, "Member 'UAthenaLockerTab2_C::CustomizationSlotButtonToPlayConfirmationOn' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, AutoHideDetailsForDances) == 0x000A40, "Member 'UAthenaLockerTab2_C::AutoHideDetailsForDances' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, FirstSlotInMenu) == 0x000A48, "Member 'UAthenaLockerTab2_C::FirstSlotInMenu' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, FirstCustomizationCategory) == 0x000A50, "Member 'UAthenaLockerTab2_C::FirstCustomizationCategory' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, bIsFirstSlotBannerSlot) == 0x000A51, "Member 'UAthenaLockerTab2_C::bIsFirstSlotBannerSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab2_C, CustomizationParams) == 0x000A58, "Member 'UAthenaLockerTab2_C::CustomizationParams' has a wrong offset!");

}

