#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTabsScreen

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaTabsScreen.AthenaTabsScreen_C
// 0x0048 (0x0338 - 0x02F0)
class UAthenaTabsScreen_C final : public UFortAthenaTabsScreenBase
{
public:
	class UBattlePassScreen_C*                    AthenaBattlePass;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaLockerTab2_C*                    AthenaLockerTab2;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemShopScreen_C*                      ItemShopScreen;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZoneContent;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWinterQuestTitleScreen_C*              WinterQuestTitleScreen;                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<bool>                                  HotfixDisableArray;                                // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UCommonButton*>                  HotfixButtonArray;                                 // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaTabsScreen_C">();
	}
	static class UAthenaTabsScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaTabsScreen_C>();
	}
};
static_assert(alignof(UAthenaTabsScreen_C) == 0x000008, "Wrong alignment on UAthenaTabsScreen_C");
static_assert(sizeof(UAthenaTabsScreen_C) == 0x000338, "Wrong size on UAthenaTabsScreen_C");
static_assert(offsetof(UAthenaTabsScreen_C, AthenaBattlePass) == 0x0002F0, "Member 'UAthenaTabsScreen_C::AthenaBattlePass' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, AthenaLockerTab2) == 0x0002F8, "Member 'UAthenaTabsScreen_C::AthenaLockerTab2' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, ItemShopScreen) == 0x000300, "Member 'UAthenaTabsScreen_C::ItemShopScreen' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, SafeZoneContent) == 0x000308, "Member 'UAthenaTabsScreen_C::SafeZoneContent' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, WinterQuestTitleScreen) == 0x000310, "Member 'UAthenaTabsScreen_C::WinterQuestTitleScreen' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, HotfixDisableArray) == 0x000318, "Member 'UAthenaTabsScreen_C::HotfixDisableArray' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, HotfixButtonArray) == 0x000328, "Member 'UAthenaTabsScreen_C::HotfixButtonArray' has a wrong offset!");

}

