#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaReplayBrowserTab

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaReplayBrowserTab.AthenaReplayBrowserTab_C
// 0x0018 (0x04E0 - 0x04C8)
class UAthenaReplayBrowserTab_C final : public UAthenaReplayBrowserScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULeaderboardThrobber_C*                 LoadingThrobber;                                   // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           LoadingTimerHandle;                                // 0x04D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ShowLoadingThrobber();
	void OnActionStateChanged(bool bHasAction);
	void BP_OnActivated();
	void ExecuteUbergraph_AthenaReplayBrowserTab(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaReplayBrowserTab_C">();
	}
	static class UAthenaReplayBrowserTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaReplayBrowserTab_C>();
	}
};
static_assert(alignof(UAthenaReplayBrowserTab_C) == 0x000008, "Wrong alignment on UAthenaReplayBrowserTab_C");
static_assert(sizeof(UAthenaReplayBrowserTab_C) == 0x0004E0, "Wrong size on UAthenaReplayBrowserTab_C");
static_assert(offsetof(UAthenaReplayBrowserTab_C, UberGraphFrame) == 0x0004C8, "Member 'UAthenaReplayBrowserTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaReplayBrowserTab_C, LoadingThrobber) == 0x0004D0, "Member 'UAthenaReplayBrowserTab_C::LoadingThrobber' has a wrong offset!");
static_assert(offsetof(UAthenaReplayBrowserTab_C, LoadingTimerHandle) == 0x0004D8, "Member 'UAthenaReplayBrowserTab_C::LoadingTimerHandle' has a wrong offset!");

}

