#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_SneakySnowman

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Athena_Prop_SneakySnowman.Athena_Prop_SneakySnowman_C.ExecuteUbergraph_Athena_Prop_SneakySnowman
// 0x0638 (0x0638 - 0x0000)
struct Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x0010(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_CustomEvent_DamagedActor_1;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage_1;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy_1;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser_1;                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation_1;                  // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent_1;                // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName_1;                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum_1;                     // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPickupAthena*                      K2Node_DynamicCast_AsFort_Pickup_Athena;           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllPassengers_ReturnValue;             // 0x0188(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x2];                                      // 0x01BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x01BC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C6[0x2];                                      // 0x01C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x01F0(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x021C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x02B8(0x0018)()
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate;              // 0x02D4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0308(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x039A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39B[0x5];                                      // 0x039B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortVolume*                            K2Node_Event_VolumeSpawnedWithin;                  // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item;                           // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue_1; // 0x03C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x03C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x03DC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x03F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_PlaylistName;                   // 0x040C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0418(0x0020)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0438(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0448(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0450(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0480(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0490(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x04A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4AD[0x3];                                      // 0x04AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_TraceStartAndEnd_Start;                   // 0x04B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TraceStartAndEnd_End;                     // 0x04BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x04C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551[0x3];                                      // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DistanceBetweenTwoVectors_Distance;       // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0559(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55A[0x2];                                      // 0x055A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0564(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0570(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x057C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0588(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x05A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x05C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x05CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor_1;             // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_2;           // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F9[0x3];                                      // 0x05F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0601(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_602[0x2];                                      // 0x0602(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0604(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0610(0x0010)(ZeroConstructor, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue_1; // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName PlaylistName, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0628(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman) == 0x000008, "Wrong alignment on Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman");
static_assert(sizeof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman) == 0x000638, "Wrong size on Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, EntryPoint) == 0x000000, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue) == 0x000008, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_ComponentBoundEvent_ImpactResult) == 0x000010, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_ComponentBoundEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_DamagedActor_1) == 0x000098, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_DamagedActor_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_Damage_1) == 0x0000A0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_Damage_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_InstigatedBy_1) == 0x0000A8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_DamageCauser_1) == 0x0000B0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_HitLocation_1) == 0x0000B8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_HitLocation_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_FHitComponent_1) == 0x0000C8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_FHitComponent_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_BoneName_1) == 0x0000D0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_BoneName_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_Momentum_1) == 0x0000D8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_Momentum_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_bBlockingHit) == 0x0000E4, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000E5, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_Time) == 0x0000E8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_Distance) == 0x0000EC, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_Location) == 0x0000F0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_ImpactPoint) == 0x0000FC, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_Normal) == 0x000108, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_ImpactNormal) == 0x000114, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_PhysMat) == 0x000120, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_HitActor) == 0x000128, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_HitComponent) == 0x000130, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_HitBoneName) == 0x000138, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_HitItem) == 0x000140, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_FaceIndex) == 0x000144, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_TraceStart) == 0x000148, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_TraceEnd) == 0x000154, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000160, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_DynamicCast_AsFort_Pickup_Athena) == 0x000178, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_DynamicCast_AsFort_Pickup_Athena' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_DynamicCast_bSuccess_1) == 0x000180, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_GetAllPassengers_ReturnValue) == 0x000188, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_GetAllPassengers_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_Array_Length_ReturnValue) == 0x000198, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_Array_Length_ReturnValue_1) == 0x00019C, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0001A0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_DynamicCast_bSuccess_2) == 0x0001A8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_Greater_IntInt_ReturnValue) == 0x0001A9, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_DynamicCast_AsBuilding_Actor) == 0x0001B0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_DynamicCast_bSuccess_3) == 0x0001B8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, Temp_bool_IsClosed_Variable) == 0x0001B9, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue) == 0x0001BC, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_HasAuthority_ReturnValue) == 0x0001C4, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_HasAuthority_ReturnValue_1) == 0x0001C5, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_GetValueAtLevel_ReturnValue) == 0x0001C8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001CC, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x0001D0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0001D4, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, Temp_int_Loop_Counter_Variable) == 0x0001D8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_Less_IntInt_ReturnValue) == 0x0001DC, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_Add_IntInt_ReturnValue) == 0x0001E0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x0001E4, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_Event_Damage) == 0x0001E8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_Event_DamageTags) == 0x0001F0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_Event_Momentum) == 0x000210, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_Event_HitInfo) == 0x00021C, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_Event_InstigatedBy) == 0x0002A8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_Event_DamageCauser) == 0x0002B0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_Event_EffectContext) == 0x0002B8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x0002D0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CreateDelegate_OutputDelegate) == 0x0002D4, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0002E8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_ComponentBoundEvent_OtherActor) == 0x0002F0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_ComponentBoundEvent_OtherComp) == 0x0002F8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000300, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_ComponentBoundEvent_bFromSweep) == 0x000304, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_ComponentBoundEvent_SweepResult) == 0x000308, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000390, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_DynamicCast_bSuccess_4) == 0x000398, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000399, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BooleanAND_ReturnValue) == 0x00039A, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_Event_VolumeSpawnedWithin) == 0x0003A0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_Event_VolumeSpawnedWithin' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, Temp_int_Array_Index_Variable) == 0x0003A8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0003AC, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_Array_Get_Item) == 0x0003B8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue_1) == 0x0003C0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0003C8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0003D8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003DC, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_GetGameState_ReturnValue) == 0x0003F0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0003F8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000400, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_DynamicCast_bSuccess_5) == 0x000408, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_PlaylistName) == 0x00040C, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_PlaylistName' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_PlaylistContextTags) == 0x000418, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CreateDelegate_OutputDelegate_2) == 0x000438, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000448, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_MakeArray_Array) == 0x000450, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_DamagedActor) == 0x000460, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_Damage) == 0x000468, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_InstigatedBy) == 0x000470, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_DamageCauser) == 0x000478, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_HitLocation) == 0x000480, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_FHitComponent) == 0x000490, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_BoneName) == 0x000498, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, K2Node_CustomEvent_Momentum) == 0x0004A0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_IsActive_ReturnValue) == 0x0004AC, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_TraceStartAndEnd_Start) == 0x0004B0, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_TraceStartAndEnd_Start' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_TraceStartAndEnd_End) == 0x0004BC, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_TraceStartAndEnd_End' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0004C8, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000550, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_DistanceBetweenTwoVectors_Distance) == 0x000554, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_DistanceBetweenTwoVectors_Distance' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000558, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000559, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_Time_1) == 0x00055C, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_Distance_1) == 0x000560, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_Location_1) == 0x000564, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000570, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman, CallFunc_BreakHitResult_Normal_1) == 0x00057C, "Member 'Athena_Prop_SneakySnowman_C_ExecuteUbergraph_Athena_Prop_SneakySnowman::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
