#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonLevelPaidRewardsWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSeasonLevelPaidRewardsWidget.AthenaSeasonLevelPaidRewardsWidget_C
// 0x0060 (0x02D0 - 0x0270)
class UAthenaSeasonLevelPaidRewardsWidget_C final : public USeasonPassLevelWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Populate;                                          // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Backing;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackingArea;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ContainerSize;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_59;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Left_Backing_Hack;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          PaidRewardsBorder;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             PaidRewardsGrid;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnEarned_OverlayTint;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UAthenaSeasonReward_C*>          RewardWidgets;                                     // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference)

public:
	void OnLockedStatusChanged(bool FreeUnlocked, bool PaidUnlocked);
	void OnNavigateTo();
	void PlayIntro();
	void ExecuteUbergraph_AthenaSeasonLevelPaidRewardsWidget(int32 EntryPoint);
	void PopulateAnim();
	void UpdateStyling();
	void OnSetup();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSeasonLevelPaidRewardsWidget_C">();
	}
	static class UAthenaSeasonLevelPaidRewardsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSeasonLevelPaidRewardsWidget_C>();
	}
};
static_assert(alignof(UAthenaSeasonLevelPaidRewardsWidget_C) == 0x000008, "Wrong alignment on UAthenaSeasonLevelPaidRewardsWidget_C");
static_assert(sizeof(UAthenaSeasonLevelPaidRewardsWidget_C) == 0x0002D0, "Wrong size on UAthenaSeasonLevelPaidRewardsWidget_C");
static_assert(offsetof(UAthenaSeasonLevelPaidRewardsWidget_C, UberGraphFrame) == 0x000270, "Member 'UAthenaSeasonLevelPaidRewardsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelPaidRewardsWidget_C, Populate) == 0x000278, "Member 'UAthenaSeasonLevelPaidRewardsWidget_C::Populate' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelPaidRewardsWidget_C, Backing) == 0x000280, "Member 'UAthenaSeasonLevelPaidRewardsWidget_C::Backing' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelPaidRewardsWidget_C, BackingArea) == 0x000288, "Member 'UAthenaSeasonLevelPaidRewardsWidget_C::BackingArea' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelPaidRewardsWidget_C, ContainerSize) == 0x000290, "Member 'UAthenaSeasonLevelPaidRewardsWidget_C::ContainerSize' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelPaidRewardsWidget_C, Image_59) == 0x000298, "Member 'UAthenaSeasonLevelPaidRewardsWidget_C::Image_59' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelPaidRewardsWidget_C, Left_Backing_Hack) == 0x0002A0, "Member 'UAthenaSeasonLevelPaidRewardsWidget_C::Left_Backing_Hack' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelPaidRewardsWidget_C, PaidRewardsBorder) == 0x0002A8, "Member 'UAthenaSeasonLevelPaidRewardsWidget_C::PaidRewardsBorder' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelPaidRewardsWidget_C, PaidRewardsGrid) == 0x0002B0, "Member 'UAthenaSeasonLevelPaidRewardsWidget_C::PaidRewardsGrid' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelPaidRewardsWidget_C, UnEarned_OverlayTint) == 0x0002B8, "Member 'UAthenaSeasonLevelPaidRewardsWidget_C::UnEarned_OverlayTint' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelPaidRewardsWidget_C, RewardWidgets) == 0x0002C0, "Member 'UAthenaSeasonLevelPaidRewardsWidget_C::RewardWidgets' has a wrong offset!");

}

