#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_Galileo_Lobster_Kayak

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Athena_Galileo_Lobster_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Athena_Galileo_Lobster_Kayak.B_Athena_Galileo_Lobster_Kayak_C
// 0x0020 (0x0CD8 - 0x0CB8)
class AB_Athena_Galileo_Lobster_Kayak_C final : public AB_Athena_Galileo_Lobster_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Athena_Galileo_Lobster_Kayak_C;   // 0x0CB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_2_ActivationSub_B4C83C5E41BD7B2B67CEE4BE7B40F62B; // 0x0CC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_Activation_B4C83C5E41BD7B2B67CEE4BE7B40F62B; // 0x0CC4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_B4C83C5E41BD7B2B67CEE4BE7B40F62B; // 0x0CC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC9[0x7];                                      // 0x0CC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0CD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak(int32 EntryPoint);
	void TurnOnLobster();
	void DoBulletBlockEffect(const struct FVector& ImpactLocation);
	void StartIdleFX();
	void CurrentPoiseChanged(float CurrentPoise_0);
	void BlockBreak();
	void CreateSkeletalAudioComp(class UFortSkeletalAudioComponent** Component);
	void Timeline_2__FinishedFunc();
	void Timeline_2__TurnOnIdleLightningBeam__EventFunc();
	void Timeline_2__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Athena_Galileo_Lobster_Kayak_C">();
	}
	static class AB_Athena_Galileo_Lobster_Kayak_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Athena_Galileo_Lobster_Kayak_C>();
	}
};
static_assert(alignof(AB_Athena_Galileo_Lobster_Kayak_C) == 0x000008, "Wrong alignment on AB_Athena_Galileo_Lobster_Kayak_C");
static_assert(sizeof(AB_Athena_Galileo_Lobster_Kayak_C) == 0x000CD8, "Wrong size on AB_Athena_Galileo_Lobster_Kayak_C");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Kayak_C, UberGraphFrame_B_Athena_Galileo_Lobster_Kayak_C) == 0x000CB8, "Member 'AB_Athena_Galileo_Lobster_Kayak_C::UberGraphFrame_B_Athena_Galileo_Lobster_Kayak_C' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Kayak_C, Timeline_2_ActivationSub_B4C83C5E41BD7B2B67CEE4BE7B40F62B) == 0x000CC0, "Member 'AB_Athena_Galileo_Lobster_Kayak_C::Timeline_2_ActivationSub_B4C83C5E41BD7B2B67CEE4BE7B40F62B' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Kayak_C, Timeline_2_Activation_B4C83C5E41BD7B2B67CEE4BE7B40F62B) == 0x000CC4, "Member 'AB_Athena_Galileo_Lobster_Kayak_C::Timeline_2_Activation_B4C83C5E41BD7B2B67CEE4BE7B40F62B' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Kayak_C, Timeline_2__Direction_B4C83C5E41BD7B2B67CEE4BE7B40F62B) == 0x000CC8, "Member 'AB_Athena_Galileo_Lobster_Kayak_C::Timeline_2__Direction_B4C83C5E41BD7B2B67CEE4BE7B40F62B' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Kayak_C, Timeline_2) == 0x000CD0, "Member 'AB_Athena_Galileo_Lobster_Kayak_C::Timeline_2' has a wrong offset!");

}

