#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_FrenchYedoc

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_FrenchYedoc.B_Athena_FrenchYedoc_C.ExecuteUbergraph_B_Athena_FrenchYedoc
// 0x0070 (0x0070 - 0x0000)
struct B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_GameMode_C*                     K2Node_DynamicCast_AsAthena_Game_Mode;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortServerBotManagerAthena*            CallFunc_GetServerBotManager_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  CallFunc_SpawnBot_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc) == 0x000008, "Wrong alignment on B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc");
static_assert(sizeof(B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc) == 0x000070, "Wrong size on B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc");
static_assert(offsetof(B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc, EntryPoint) == 0x000000, "Member 'B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc, CallFunc_GetController_ReturnValue) == 0x000010, "Member 'B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000018, "Member 'B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc, CallFunc_GetController_ReturnValue_1) == 0x000028, "Member 'B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc, CallFunc_GetGameMode_ReturnValue) == 0x000030, "Member 'B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc, K2Node_DynamicCast_AsAthena_Game_Mode) == 0x000038, "Member 'B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc::K2Node_DynamicCast_AsAthena_Game_Mode' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc, CallFunc_GetServerBotManager_ReturnValue) == 0x000048, "Member 'B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc::CallFunc_GetServerBotManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000050, "Member 'B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00005C, "Member 'B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc, CallFunc_SpawnBot_ReturnValue) == 0x000068, "Member 'B_Athena_FrenchYedoc_C_ExecuteUbergraph_B_Athena_FrenchYedoc::CallFunc_SpawnBot_ReturnValue' has a wrong offset!");

}

