#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_Galileo_Lobster_Kayak

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_Galileo_Lobster_Kayak.B_Athena_Galileo_Lobster_Kayak_C.ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak
// 0x0020 (0x0020 - 0x0000)
struct B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CurrentPoise;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_ImpactLocation;                       // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak) == 0x000004, "Wrong alignment on B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak");
static_assert(sizeof(B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak) == 0x000020, "Wrong size on B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak");
static_assert(offsetof(B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak, EntryPoint) == 0x000000, "Member 'B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak, CallFunc_Lerp_ReturnValue_1) == 0x000008, "Member 'B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak, K2Node_Event_CurrentPoise) == 0x00000C, "Member 'B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak::K2Node_Event_CurrentPoise' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak, K2Node_Event_ImpactLocation) == 0x000010, "Member 'B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak::K2Node_Event_ImpactLocation' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00001C, "Member 'B_Athena_Galileo_Lobster_Kayak_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Kayak::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");

// Function B_Athena_Galileo_Lobster_Kayak.B_Athena_Galileo_Lobster_Kayak_C.DoBulletBlockEffect
// 0x000C (0x000C - 0x0000)
struct B_Athena_Galileo_Lobster_Kayak_C_DoBulletBlockEffect final
{
public:
	struct FVector                                ImpactLocation;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Galileo_Lobster_Kayak_C_DoBulletBlockEffect) == 0x000004, "Wrong alignment on B_Athena_Galileo_Lobster_Kayak_C_DoBulletBlockEffect");
static_assert(sizeof(B_Athena_Galileo_Lobster_Kayak_C_DoBulletBlockEffect) == 0x00000C, "Wrong size on B_Athena_Galileo_Lobster_Kayak_C_DoBulletBlockEffect");
static_assert(offsetof(B_Athena_Galileo_Lobster_Kayak_C_DoBulletBlockEffect, ImpactLocation) == 0x000000, "Member 'B_Athena_Galileo_Lobster_Kayak_C_DoBulletBlockEffect::ImpactLocation' has a wrong offset!");

// Function B_Athena_Galileo_Lobster_Kayak.B_Athena_Galileo_Lobster_Kayak_C.CurrentPoiseChanged
// 0x0004 (0x0004 - 0x0000)
struct B_Athena_Galileo_Lobster_Kayak_C_CurrentPoiseChanged final
{
public:
	float                                         CurrentPoise_0;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Galileo_Lobster_Kayak_C_CurrentPoiseChanged) == 0x000004, "Wrong alignment on B_Athena_Galileo_Lobster_Kayak_C_CurrentPoiseChanged");
static_assert(sizeof(B_Athena_Galileo_Lobster_Kayak_C_CurrentPoiseChanged) == 0x000004, "Wrong size on B_Athena_Galileo_Lobster_Kayak_C_CurrentPoiseChanged");
static_assert(offsetof(B_Athena_Galileo_Lobster_Kayak_C_CurrentPoiseChanged, CurrentPoise_0) == 0x000000, "Member 'B_Athena_Galileo_Lobster_Kayak_C_CurrentPoiseChanged::CurrentPoise_0' has a wrong offset!");

// Function B_Athena_Galileo_Lobster_Kayak.B_Athena_Galileo_Lobster_Kayak_C.CreateSkeletalAudioComp
// 0x0050 (0x0050 - 0x0000)
struct B_Athena_Galileo_Lobster_Kayak_C_CreateSkeletalAudioComp final
{
public:
	class UFortSkeletalAudioComponent*            Component;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UFortSkeletalAudioComponent*            CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Galileo_Lobster_Kayak_C_CreateSkeletalAudioComp) == 0x000010, "Wrong alignment on B_Athena_Galileo_Lobster_Kayak_C_CreateSkeletalAudioComp");
static_assert(sizeof(B_Athena_Galileo_Lobster_Kayak_C_CreateSkeletalAudioComp) == 0x000050, "Wrong size on B_Athena_Galileo_Lobster_Kayak_C_CreateSkeletalAudioComp");
static_assert(offsetof(B_Athena_Galileo_Lobster_Kayak_C_CreateSkeletalAudioComp, Component) == 0x000000, "Member 'B_Athena_Galileo_Lobster_Kayak_C_CreateSkeletalAudioComp::Component' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Kayak_C_CreateSkeletalAudioComp, Temp_struct_Variable) == 0x000010, "Member 'B_Athena_Galileo_Lobster_Kayak_C_CreateSkeletalAudioComp::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Kayak_C_CreateSkeletalAudioComp, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'B_Athena_Galileo_Lobster_Kayak_C_CreateSkeletalAudioComp::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

}

