#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_FrenchYedoc_JWFriendly

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_FrenchYedoc_JWFriendly.B_Athena_FrenchYedoc_JWFriendly_C.ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly
// 0x01C0 (0x01C0 - 0x0000)
struct B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable_1;                             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Temp_byte_Variable;                                // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_Select_Default;                             // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_GameMode_C*                     K2Node_DynamicCast_AsAthena_Game_Mode;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortServerBotManagerAthena*            CallFunc_GetServerBotManager_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  CallFunc_SpawnBot_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0098(0x00B8)(ContainsInstancedReference)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaAIBotController*             K2Node_DynamicCast_AsFort_Athena_AIBot_Controller; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena_1;         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0xF];                                      // 0x0171(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0180(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VictoryDrone_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly) == 0x000010, "Wrong alignment on B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly");
static_assert(sizeof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly) == 0x0001C0, "Wrong size on B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, EntryPoint) == 0x000000, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000008, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000020, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000038, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, CallFunc_GetActorTeam_ReturnValue) == 0x000041, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, Temp_float_Variable) == 0x000044, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, Temp_float_Variable_1) == 0x000058, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, Temp_bool_Variable) == 0x00005C, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, Temp_byte_Variable) == 0x00005D, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, Temp_bool_Variable_1) == 0x00005E, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, K2Node_Select_Default) == 0x00005F, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, K2Node_Select_Default_1) == 0x000060, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, CallFunc_GetGameMode_ReturnValue) == 0x000068, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, K2Node_DynamicCast_AsAthena_Game_Mode) == 0x000070, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::K2Node_DynamicCast_AsAthena_Game_Mode' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000080, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, CallFunc_GetServerBotManager_ReturnValue) == 0x000088, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::CallFunc_GetServerBotManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, CallFunc_SpawnBot_ReturnValue) == 0x000090, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::CallFunc_SpawnBot_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000098, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, CallFunc_GetController_ReturnValue) == 0x000150, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, K2Node_DynamicCast_AsFort_Athena_AIBot_Controller) == 0x000158, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::K2Node_DynamicCast_AsFort_Athena_AIBot_Controller' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, K2Node_DynamicCast_bSuccess_3) == 0x000160, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, CallFunc_IsValid_ReturnValue_1) == 0x000161, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, K2Node_DynamicCast_AsPlayer_Pawn_Athena_1) == 0x000168, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::K2Node_DynamicCast_AsPlayer_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, K2Node_DynamicCast_bSuccess_4) == 0x000170, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, CallFunc_GetTransform_ReturnValue) == 0x000180, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001B0, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001B8, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_ExecuteUbergraph_B_Athena_FrenchYedoc_JWFriendly::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function B_Athena_FrenchYedoc_JWFriendly.B_Athena_FrenchYedoc_JWFriendly_C.OnRep_BotPawn
// 0x0001 (0x0001 - 0x0000)
struct B_Athena_FrenchYedoc_JWFriendly_C_OnRep_BotPawn final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Athena_FrenchYedoc_JWFriendly_C_OnRep_BotPawn) == 0x000001, "Wrong alignment on B_Athena_FrenchYedoc_JWFriendly_C_OnRep_BotPawn");
static_assert(sizeof(B_Athena_FrenchYedoc_JWFriendly_C_OnRep_BotPawn) == 0x000001, "Wrong size on B_Athena_FrenchYedoc_JWFriendly_C_OnRep_BotPawn");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_OnRep_BotPawn, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_OnRep_BotPawn::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function B_Athena_FrenchYedoc_JWFriendly.B_Athena_FrenchYedoc_JWFriendly_C.SetBotWeaponsHiddenInGame
// 0x0040 (0x0040 - 0x0000)
struct B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame final
{
public:
	class AFortPawn*                              BotPawn_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewHidden;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPropagateToChildren;                              // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponentBudgeted*> CallFunc_GetWeaponMeshes_WeaponMeshes;             // 0x0010(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponentBudgeted*         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame) == 0x000008, "Wrong alignment on B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame");
static_assert(sizeof(B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame) == 0x000040, "Wrong size on B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame, BotPawn_0) == 0x000000, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame::BotPawn_0' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame, NewHidden) == 0x000008, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame::NewHidden' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame, bPropagateToChildren) == 0x000009, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame::bPropagateToChildren' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame, CallFunc_GetWeaponMeshes_WeaponMeshes) == 0x000010, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame::CallFunc_GetWeaponMeshes_WeaponMeshes' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame, CallFunc_Array_Get_Item) == 0x000028, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'B_Athena_FrenchYedoc_JWFriendly_C_SetBotWeaponsHiddenInGame::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

