#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_FloppingRabbit_Weap_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_UtilityItem_Generic_Athena_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_FloppingRabbit_Weap_Athena.B_FloppingRabbit_Weap_Athena_C
// 0x0020 (0x0A58 - 0x0A38)
class AB_FloppingRabbit_Weap_Athena_C final : public AB_UtilityItem_Generic_Athena_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Projectile;                                        // 0x0A40(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Wire;                                              // 0x0A48(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideBobber;                                        // 0x0A50(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          OneHandGrip;                                       // 0x0A51(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_B_FloppingRabbit_Weap_Athena(int32 EntryPoint);
	void ForceKillFishing();
	void K2_OnUnEquip();
	void OnRep_HideBobber();
	void OnRep_OneHandGrip();
	void OnWeaponAttached();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_FloppingRabbit_Weap_Athena_C">();
	}
	static class AB_FloppingRabbit_Weap_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_FloppingRabbit_Weap_Athena_C>();
	}
};
static_assert(alignof(AB_FloppingRabbit_Weap_Athena_C) == 0x000008, "Wrong alignment on AB_FloppingRabbit_Weap_Athena_C");
static_assert(sizeof(AB_FloppingRabbit_Weap_Athena_C) == 0x000A58, "Wrong size on AB_FloppingRabbit_Weap_Athena_C");
static_assert(offsetof(AB_FloppingRabbit_Weap_Athena_C, UberGraphFrame) == 0x000A38, "Member 'AB_FloppingRabbit_Weap_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_FloppingRabbit_Weap_Athena_C, Projectile) == 0x000A40, "Member 'AB_FloppingRabbit_Weap_Athena_C::Projectile' has a wrong offset!");
static_assert(offsetof(AB_FloppingRabbit_Weap_Athena_C, Wire) == 0x000A48, "Member 'AB_FloppingRabbit_Weap_Athena_C::Wire' has a wrong offset!");
static_assert(offsetof(AB_FloppingRabbit_Weap_Athena_C, HideBobber) == 0x000A50, "Member 'AB_FloppingRabbit_Weap_Athena_C::HideBobber' has a wrong offset!");
static_assert(offsetof(AB_FloppingRabbit_Weap_Athena_C, OneHandGrip) == 0x000A51, "Member 'AB_FloppingRabbit_Weap_Athena_C::OneHandGrip' has a wrong offset!");

}

