#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Galileo_Lobster_Block_Collision

#include "Basic.hpp"

#include "DishHitReactSelectionInfo_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Galileo_Lobster_Block_Collision.B_Galileo_Lobster_Block_Collision_C
// 0x0278 (0x0A00 - 0x0788)
class AB_Galileo_Lobster_Block_Collision_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0788(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box2;                                              // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box3;                                              // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot1;                                 // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box1;                                              // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Athena_Galileo_Lobster_Parent_C*     BP_GalileoLobster;                                 // 0x07B8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<struct FDishHitReactSelectionInfo>     HitReactSelectionInfos;                            // 0x07C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UAnimMontage*                           HitReactionMontage;                                // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         StartingHealth;                                    // 0x07D8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         PoiseRegenCooldown;                                // 0x07F8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         LastHitTime;                                       // 0x0818(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpulseMultiplier;                                 // 0x081C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentPoise;                                      // 0x0820(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_824[0x4];                                      // 0x0824(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         CenterReflectConeAngle;                            // 0x0828(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ImpulseZ;                                          // 0x0848(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SpinImpulseMultiplier;                             // 0x0868(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ImpulseXY;                                         // 0x0888(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ReflectProjectileSpeed;                            // 0x08A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SideReflectProjectileConeAngle;                    // 0x08C8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ReflectProjectileCooldown;                         // 0x08E8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             ReflectSound;                                      // 0x0908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OwnerDied;                                         // 0x0910(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CanReflect;                                        // 0x0911(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BlockBreak;                                        // 0x0912(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bUp;                                               // 0x0913(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bRight;                                            // 0x0914(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_915[0x3];                                      // 0x0915(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_Deflect;                                        // 0x0918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Heal;                                           // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_BlockBreak;                                     // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_DamageResist;                                   // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           RepairTimerHandle;                                 // 0x0938(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_DeflectGeneric;                                 // 0x0940(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_DeflectBun;                                     // 0x0948(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_DeflectLobster;                                 // 0x0950(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_BlockBreak;                                     // 0x0958(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_Lobster;                                         // 0x0960(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_RangedWeapon;                                    // 0x0968(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_BlockBreakDuration;                              // 0x0970(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           T_BlockedDamageEvent;                              // 0x0990(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            DeflectReactionHandle;                             // 0x0998(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DeflectReactionTimerHandle;                        // 0x09A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         CollisionEnabled;                                  // 0x09A8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_DeflectReaction;                                 // 0x09AC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B4[0x4];                                      // 0x09B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    HitComponent;                                      // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HitCenter;                                         // 0x09C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C1[0x7];                                      // 0x09C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        ReflectTarget;                                     // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                M_Swing3;                                          // 0x09D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                M_Swing4;                                          // 0x09D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         FinisherImpulseMultiplier;                         // 0x09E0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_Galileo_Lobster_Block_Collision(int32 EntryPoint);
	void RemoveDeflectReaction();
	void SetCanReflect();
	void SpawnReflectProj(const struct FHitResult& HitInfo, bool WasGalileoBun);
	void OnBuildingHealthChanged_Event();
	void OnPlayerStartDBNO_Event_0();
	void RemovalChecks(class AFortPlayerPawn* PlayerPawn_0);
	void CustomEvent_0(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void StartHealingTimer();
	void ApplyHeal();
	void ReceiveBeginPlay();
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void GameplayCue_Damage(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void PlayHitReactMontage(const struct FHitResult& HitResult, const struct FVector& HitLocation);
	void ExecuteBlockGameplayCue(float Damage, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext, const struct FVector& ImpactColor, class AActor* Instigator_0, const struct FHitResult& HitResult, bool* WasGalileoBun);
	void OnRep_CollisionEnabled();
	void SendBlockedDamageEvent(float Damage, class AActor* DamageCauser);
	void BlockedLobsterImpulse(const struct FHitResult& HitInfo, class ACharacter* Instigator_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Galileo_Lobster_Block_Collision_C">();
	}
	static class AB_Galileo_Lobster_Block_Collision_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Galileo_Lobster_Block_Collision_C>();
	}
};
static_assert(alignof(AB_Galileo_Lobster_Block_Collision_C) == 0x000008, "Wrong alignment on AB_Galileo_Lobster_Block_Collision_C");
static_assert(sizeof(AB_Galileo_Lobster_Block_Collision_C) == 0x000A00, "Wrong size on AB_Galileo_Lobster_Block_Collision_C");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, UberGraphFrame) == 0x000788, "Member 'AB_Galileo_Lobster_Block_Collision_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, Box2) == 0x000790, "Member 'AB_Galileo_Lobster_Block_Collision_C::Box2' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, Box3) == 0x000798, "Member 'AB_Galileo_Lobster_Block_Collision_C::Box3' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, DefaultSceneRoot1) == 0x0007A0, "Member 'AB_Galileo_Lobster_Block_Collision_C::DefaultSceneRoot1' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, Box1) == 0x0007A8, "Member 'AB_Galileo_Lobster_Block_Collision_C::Box1' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, PlayerPawn) == 0x0007B0, "Member 'AB_Galileo_Lobster_Block_Collision_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, BP_GalileoLobster) == 0x0007B8, "Member 'AB_Galileo_Lobster_Block_Collision_C::BP_GalileoLobster' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, HitReactSelectionInfos) == 0x0007C0, "Member 'AB_Galileo_Lobster_Block_Collision_C::HitReactSelectionInfos' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, HitReactionMontage) == 0x0007D0, "Member 'AB_Galileo_Lobster_Block_Collision_C::HitReactionMontage' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, StartingHealth) == 0x0007D8, "Member 'AB_Galileo_Lobster_Block_Collision_C::StartingHealth' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, PoiseRegenCooldown) == 0x0007F8, "Member 'AB_Galileo_Lobster_Block_Collision_C::PoiseRegenCooldown' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, LastHitTime) == 0x000818, "Member 'AB_Galileo_Lobster_Block_Collision_C::LastHitTime' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, ImpulseMultiplier) == 0x00081C, "Member 'AB_Galileo_Lobster_Block_Collision_C::ImpulseMultiplier' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, CurrentPoise) == 0x000820, "Member 'AB_Galileo_Lobster_Block_Collision_C::CurrentPoise' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, CenterReflectConeAngle) == 0x000828, "Member 'AB_Galileo_Lobster_Block_Collision_C::CenterReflectConeAngle' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, ImpulseZ) == 0x000848, "Member 'AB_Galileo_Lobster_Block_Collision_C::ImpulseZ' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, SpinImpulseMultiplier) == 0x000868, "Member 'AB_Galileo_Lobster_Block_Collision_C::SpinImpulseMultiplier' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, ImpulseXY) == 0x000888, "Member 'AB_Galileo_Lobster_Block_Collision_C::ImpulseXY' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, ReflectProjectileSpeed) == 0x0008A8, "Member 'AB_Galileo_Lobster_Block_Collision_C::ReflectProjectileSpeed' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, SideReflectProjectileConeAngle) == 0x0008C8, "Member 'AB_Galileo_Lobster_Block_Collision_C::SideReflectProjectileConeAngle' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, ReflectProjectileCooldown) == 0x0008E8, "Member 'AB_Galileo_Lobster_Block_Collision_C::ReflectProjectileCooldown' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, ReflectSound) == 0x000908, "Member 'AB_Galileo_Lobster_Block_Collision_C::ReflectSound' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, OwnerDied) == 0x000910, "Member 'AB_Galileo_Lobster_Block_Collision_C::OwnerDied' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, CanReflect) == 0x000911, "Member 'AB_Galileo_Lobster_Block_Collision_C::CanReflect' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, BlockBreak) == 0x000912, "Member 'AB_Galileo_Lobster_Block_Collision_C::BlockBreak' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, bUp) == 0x000913, "Member 'AB_Galileo_Lobster_Block_Collision_C::bUp' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, bRight) == 0x000914, "Member 'AB_Galileo_Lobster_Block_Collision_C::bRight' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, GE_Deflect) == 0x000918, "Member 'AB_Galileo_Lobster_Block_Collision_C::GE_Deflect' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, GE_Heal) == 0x000920, "Member 'AB_Galileo_Lobster_Block_Collision_C::GE_Heal' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, GE_BlockBreak) == 0x000928, "Member 'AB_Galileo_Lobster_Block_Collision_C::GE_BlockBreak' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, GE_DamageResist) == 0x000930, "Member 'AB_Galileo_Lobster_Block_Collision_C::GE_DamageResist' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, RepairTimerHandle) == 0x000938, "Member 'AB_Galileo_Lobster_Block_Collision_C::RepairTimerHandle' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, GC_DeflectGeneric) == 0x000940, "Member 'AB_Galileo_Lobster_Block_Collision_C::GC_DeflectGeneric' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, GC_DeflectBun) == 0x000948, "Member 'AB_Galileo_Lobster_Block_Collision_C::GC_DeflectBun' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, GC_DeflectLobster) == 0x000950, "Member 'AB_Galileo_Lobster_Block_Collision_C::GC_DeflectLobster' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, GC_BlockBreak) == 0x000958, "Member 'AB_Galileo_Lobster_Block_Collision_C::GC_BlockBreak' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, T_Lobster) == 0x000960, "Member 'AB_Galileo_Lobster_Block_Collision_C::T_Lobster' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, T_RangedWeapon) == 0x000968, "Member 'AB_Galileo_Lobster_Block_Collision_C::T_RangedWeapon' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, T_BlockBreakDuration) == 0x000970, "Member 'AB_Galileo_Lobster_Block_Collision_C::T_BlockBreakDuration' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, T_BlockedDamageEvent) == 0x000990, "Member 'AB_Galileo_Lobster_Block_Collision_C::T_BlockedDamageEvent' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, DeflectReactionHandle) == 0x000998, "Member 'AB_Galileo_Lobster_Block_Collision_C::DeflectReactionHandle' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, DeflectReactionTimerHandle) == 0x0009A0, "Member 'AB_Galileo_Lobster_Block_Collision_C::DeflectReactionTimerHandle' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, CollisionEnabled) == 0x0009A8, "Member 'AB_Galileo_Lobster_Block_Collision_C::CollisionEnabled' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, T_DeflectReaction) == 0x0009AC, "Member 'AB_Galileo_Lobster_Block_Collision_C::T_DeflectReaction' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, HitComponent) == 0x0009B8, "Member 'AB_Galileo_Lobster_Block_Collision_C::HitComponent' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, HitCenter) == 0x0009C0, "Member 'AB_Galileo_Lobster_Block_Collision_C::HitCenter' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, ReflectTarget) == 0x0009C8, "Member 'AB_Galileo_Lobster_Block_Collision_C::ReflectTarget' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, M_Swing3) == 0x0009D0, "Member 'AB_Galileo_Lobster_Block_Collision_C::M_Swing3' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, M_Swing4) == 0x0009D8, "Member 'AB_Galileo_Lobster_Block_Collision_C::M_Swing4' has a wrong offset!");
static_assert(offsetof(AB_Galileo_Lobster_Block_Collision_C, FinisherImpulseMultiplier) == 0x0009E0, "Member 'AB_Galileo_Lobster_Block_Collision_C::FinisherImpulseMultiplier' has a wrong offset!");

}

