#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Galileo_Lobster_Block_Collision

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DishHitReactSelectionInfo_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_Galileo_Lobster_Block_Collision.B_Galileo_Lobster_Block_Collision_C.ExecuteUbergraph_B_Galileo_Lobster_Block_Collision
// 0x08F0 (0x08F0 - 0x0000)
struct B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0018(0x00B8)(ContainsInstancedReference)
	float                                         K2Node_Event_Damage_1;                             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x00D8(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x0104(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_InstigatedBy_1;                       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x01A0(0x0018)()
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x01C0(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x01D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x01E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x01E8(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0208(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x0270(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FA[0x2];                                      // 0x02FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0360(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x038C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           K2Node_MakeStruct_GameplayEffectContextHandle;     // 0x03A0(0x0018)()
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x03C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x03D8(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0404(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x04A0(0x0018)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x04C0(0x00B8)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x05A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x05B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x05C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D4[0x4];                                      // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_CustomEvent_PlayerPawn;                     // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_1; // 0x05E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x05F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FA[0x2];                                      // 0x05FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0604(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619[0x3];                                      // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_HitInfo;                        // 0x061C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_WasGalileoBun;                  // 0x06A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A5[0x3];                                      // 0x06A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x06A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x06B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x06B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B6[0x2];                                      // 0x06B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x06C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x06CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x06D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x06E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0700(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0714(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0718(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0724(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0730(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x073C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_749[0x7];                                      // 0x0749(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0750(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78C[0x4];                                      // 0x078C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Prj_Galileo_Lobster_Reflect_C*       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0799(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79A[0x2];                                      // 0x079A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x079C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A9[0x3];                                      // 0x07A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x07AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x07B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B2[0x2];                                      // 0x07B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x07B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x07B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAtLocation_ReturnValue; // 0x07C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x07CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D4[0x4];                                      // 0x07D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x07D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E1[0x7];                                      // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           K2Node_MakeStruct_GameplayEffectContextHandle_1;   // 0x07E8(0x0018)()
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_2; // 0x0800(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0808(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0810(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2; // 0x0818(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_821[0x7];                                      // 0x0821(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_GetActiveEffectsWithAllTags_ReturnValue;  // 0x0828(0x0010)(ZeroConstructor, ReferenceParm)
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item;                           // 0x0838(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0840(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetActiveGameplayEffectRemainingDuration_ReturnValue; // 0x0850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0854(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0858(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x085C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x085D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x085E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85F[0x1];                                      // 0x085F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0860(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_869[0x7];                                      // 0x0869(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x0870(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_3; // 0x0878(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0880(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0890(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExecuteBlockGameplayCue_WasGalileoBun;    // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0899(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x089A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89B[0x1];                                      // 0x089B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x089C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x08A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x08B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x08C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x08C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C9[0x3];                                      // 0x08C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVectorInConeInDegrees_ReturnValue; // 0x08CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x08D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x08E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x08E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x08E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x08E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x08E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision) == 0x000010, "Wrong alignment on B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision");
static_assert(sizeof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision) == 0x0008F0, "Wrong size on B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, EntryPoint) == 0x000000, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_GameplayCueEvent_EventType) == 0x000014, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_GameplayCueEvent_Parameters) == 0x000018, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_Event_Damage_1) == 0x0000D0, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_Event_DamageTags_1) == 0x0000D8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_Event_Momentum_1) == 0x0000F8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_Event_HitInfo_1) == 0x000104, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_Event_InstigatedBy_1) == 0x000190, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_Event_DamageCauser_1) == 0x000198, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_Event_EffectContext_1) == 0x0001A0, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0001B8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0001BC, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0001C0, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x0001D8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0001E0, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x0001E8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000208, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakGameplayCueParameters_Location) == 0x000228, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakGameplayCueParameters_Normal) == 0x000234, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000240, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000248, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000250, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000258, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000260, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x000264, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000268, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_EffectContextGetHitResult_ReturnValue) == 0x000270, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_EffectContextGetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakHitResult_bBlockingHit) == 0x0002F8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002F9, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakHitResult_Time) == 0x0002FC, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakHitResult_Distance) == 0x000300, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakHitResult_Location) == 0x000304, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakHitResult_ImpactPoint) == 0x000310, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakHitResult_Normal) == 0x00031C, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakHitResult_ImpactNormal) == 0x000328, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakHitResult_PhysMat) == 0x000338, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakHitResult_HitActor) == 0x000340, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakHitResult_HitComponent) == 0x000348, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakHitResult_HitBoneName) == 0x000350, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakHitResult_HitItem) == 0x000358, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakHitResult_FaceIndex) == 0x00035C, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakHitResult_TraceStart) == 0x000360, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BreakHitResult_TraceEnd) == 0x00036C, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_K2_GetPawn_ReturnValue) == 0x000378, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000380, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_DynamicCast_bSuccess) == 0x000388, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_CreateDelegate_OutputDelegate_1) == 0x00038C, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_MakeStruct_GameplayEffectContextHandle) == 0x0003A0, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_MakeStruct_GameplayEffectContextHandle' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x0003B8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x0003C0, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0003C8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_GetValueAtLevel_ReturnValue) == 0x0003CC, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_Event_Damage) == 0x0003D0, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_Event_DamageTags) == 0x0003D8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_Event_Momentum) == 0x0003F8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_Event_HitInfo) == 0x000404, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_Event_InstigatedBy) == 0x000490, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_Event_DamageCauser) == 0x000498, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_Event_EffectContext) == 0x0004A0, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_GetOwner_ReturnValue) == 0x0004B8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0004C0, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000578, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_DynamicCast_bSuccess_1) == 0x000580, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_CustomEvent_DamagedActor) == 0x000588, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_CustomEvent_Damage) == 0x000590, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_CustomEvent_InstigatedBy) == 0x000598, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_CustomEvent_DamageCauser) == 0x0005A0, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_CustomEvent_HitLocation) == 0x0005A8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_CustomEvent_FHitComponent) == 0x0005B8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_CustomEvent_BoneName) == 0x0005C0, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_CustomEvent_Momentum) == 0x0005C8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_CustomEvent_PlayerPawn) == 0x0005D8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_CustomEvent_PlayerPawn' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_GetFortAbilitySystemComponent_ReturnValue_1) == 0x0005E0, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_GetFortAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_GetOwner_ReturnValue_1) == 0x0005E8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x0005F0, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_GetTeamAffiliation_ReturnValue) == 0x0005F8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, K2Node_SwitchEnum_CmpSuccess) == 0x0005F9, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision, CallFunc_GetHealth_ReturnValue) == 0x0005FC, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
