#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HidingProp

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function B_HidingProp.B_HidingProp_C.ExecuteUbergraph_B_HidingProp
// 0x0950 (0x0950 - 0x0000)
struct B_HidingProp_C_ExecuteUbergraph_B_HidingProp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_CustomEvent_PlayerPawn_1;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Z_Velocity_Mag;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0028(0x00B0)()
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData_1;             // 0x00E0(0x00B0)()
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        K2Node_CustomEvent_PlayerPawn;                     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0208(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPassengerInVehicle_ReturnValue;         // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D2[0x2];                                      // 0x02D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0300(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x032C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x03C8(0x0018)()
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x03E0(0x00B8)(ContainsInstancedReference)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x3];                                      // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x04B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_Array_Get_Item;                           // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData_2;             // 0x04D8(0x00B0)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData_3;             // 0x0598(0x00B0)()
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0648(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0658(0x0020)()
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array_1;                          // 0x0678(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0688(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0690(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_691[0x7];                                      // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_1; // 0x0698(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x06B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9[0x7];                                      // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_2;           // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2;  // 0x06E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_2;     // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F1[0x7];                                      // 0x06F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_CustomEvent_FortPawn_1;                     // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvironmentalItemEndReason                   K2Node_CustomEvent_EndReason;                      // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_701[0x7];                                      // 0x0701(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0708(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_719[0x7];                                      // 0x0719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_BoxTraceMultiForObjects_OutHits;          // 0x0720(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_BoxTraceMultiForObjects_ReturnValue;      // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_731[0x3];                                      // 0x0731(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item_1;                         // 0x0734(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x07BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x07C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C2[0x2];                                      // 0x07C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x07C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x07CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x07D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x07E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x07F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FC[0x4];                                      // 0x07FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0810(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0820(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0824(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0828(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0834(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0840(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_841[0x7];                                      // 0x0841(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_SMActor;             // 0x0848(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_851[0x3];                                      // 0x0851(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x0854(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85C[0x4];                                      // 0x085C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap;                // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_869[0x7];                                      // 0x0869(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_3;           // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0878(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_879[0x7];                                      // 0x0879(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0880(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x0888(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_899[0x7];                                      // 0x0899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x08A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x08B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x08B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B2[0x2];                                      // 0x08B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x08B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Map_Find_Value;                           // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x08BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BD[0x3];                                      // 0x08BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x08C0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x08D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x08D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DC[0x4];                                      // 0x08DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_CustomEvent_FortPawn;                       // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x08E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F4[0x4];                                      // 0x08F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0908(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_914[0x4];                                      // 0x0914(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0918(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0920(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0928(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_934[0x4];                                      // 0x0934(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_4;           // 0x0938(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0941(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_942[0x2];                                      // 0x0942(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Map_Find_Value_1;                         // 0x0944(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0948(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp) == 0x000008, "Wrong alignment on B_HidingProp_C_ExecuteUbergraph_B_HidingProp");
static_assert(sizeof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp) == 0x000950, "Wrong size on B_HidingProp_C_ExecuteUbergraph_B_HidingProp");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, EntryPoint) == 0x000000, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_CustomEvent_PlayerPawn_1) == 0x000018, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_CustomEvent_PlayerPawn_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_CustomEvent_Z_Velocity_Mag) == 0x000020, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_CustomEvent_Z_Velocity_Mag' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_MakeStruct_GameplayEventData) == 0x000028, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_IsServer_ReturnValue) == 0x0000D8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, Temp_int_Variable) == 0x0000DC, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_MakeStruct_GameplayEventData_1) == 0x0000E0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_MakeStruct_GameplayEventData_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_GetActorUpVector_ReturnValue) == 0x000190, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00019C, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_CustomEvent_PlayerPawn) == 0x0001A8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_CustomEvent_PlayerPawn' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001B0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001BC, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_MakeVector_ReturnValue) == 0x0001C0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_RotateAngleAxis_ReturnValue) == 0x0001CC, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001D8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001E8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_ComponentBoundEvent_OtherActor) == 0x0001F0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_ComponentBoundEvent_OtherComp) == 0x0001F8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000200, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_ComponentBoundEvent_bFromSweep) == 0x000204, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_ComponentBoundEvent_SweepResult) == 0x000208, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_Add_VectorVector_ReturnValue) == 0x000290, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0002A0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_DynamicCast_bSuccess) == 0x0002A8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0002AC, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_IsPassengerInVehicle_ReturnValue) == 0x0002B8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_IsPassengerInVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_IsInVehicle_ReturnValue) == 0x0002B9, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_IsInVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0002C0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0002D0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BooleanOR_ReturnValue) == 0x0002D1, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_Array_Find_ReturnValue) == 0x0002D4, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_GetVelocity_ReturnValue) == 0x0002D8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002E4, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakVector_X) == 0x0002E8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakVector_Y) == 0x0002EC, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakVector_Z) == 0x0002F0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0002F4, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, Temp_int_Array_Index_Variable) == 0x0002F8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_Event_Damage) == 0x0002FC, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_Event_DamageTags) == 0x000300, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_Event_Momentum) == 0x000320, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_Event_HitInfo) == 0x00032C, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_Event_InstigatedBy) == 0x0003B8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_Event_DamageCauser) == 0x0003C0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_Event_EffectContext) == 0x0003C8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0003E0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_Event_OtherActor) == 0x000498, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x0004A0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_DynamicCast_bSuccess_1) == 0x0004A8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_Add_IntInt_ReturnValue) == 0x0004AC, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x0004B0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x0004C0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_Array_Length_ReturnValue) == 0x0004C4, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0004C8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_Array_Get_Item) == 0x0004D0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_MakeStruct_GameplayEventData_2) == 0x0004D8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_MakeStruct_GameplayEventData_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_Add_IntInt_ReturnValue_1) == 0x000588, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, Temp_int_Loop_Counter_Variable) == 0x00058C, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_Add_IntInt_ReturnValue_2) == 0x000590, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_MakeStruct_GameplayEventData_3) == 0x000598, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_MakeStruct_GameplayEventData_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_MakeArray_Array) == 0x000648, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x000658, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_MakeArray_Array_1) == 0x000678, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_Event_InteractingPawn) == 0x000688, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_Event_InteractionBeingAttempted) == 0x000690, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_1) == 0x000698, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0006B8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0006C8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_DynamicCast_AsFort_Player_Pawn_2) == 0x0006D0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_DynamicCast_AsFort_Player_Pawn_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_DynamicCast_bSuccess_2) == 0x0006D8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_HasMatchingGameplayTag_self_CastInput_2) == 0x0006E0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_HasMatchingGameplayTag_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_HasMatchingGameplayTag_ReturnValue_2) == 0x0006F0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_HasMatchingGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_CustomEvent_FortPawn_1) == 0x0006F8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_CustomEvent_FortPawn_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_CustomEvent_EndReason) == 0x000700, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_CustomEvent_EndReason' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, Temp_object_Variable) == 0x000708, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_IsValid_ReturnValue) == 0x000718, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BoxTraceMultiForObjects_OutHits) == 0x000720, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BoxTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BoxTraceMultiForObjects_ReturnValue) == 0x000730, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BoxTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_Array_Get_Item_1) == 0x000734, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_Array_Length_ReturnValue_1) == 0x0007BC, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakHitResult_bBlockingHit) == 0x0007C0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakHitResult_bInitialOverlap) == 0x0007C1, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakHitResult_Time) == 0x0007C4, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakHitResult_Distance) == 0x0007C8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakHitResult_Location) == 0x0007CC, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakHitResult_ImpactPoint) == 0x0007D8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakHitResult_Normal) == 0x0007E4, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakHitResult_ImpactNormal) == 0x0007F0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakHitResult_PhysMat) == 0x000800, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakHitResult_HitActor) == 0x000808, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakHitResult_HitComponent) == 0x000810, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakHitResult_HitBoneName) == 0x000818, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakHitResult_HitItem) == 0x000820, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakHitResult_FaceIndex) == 0x000824, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakHitResult_TraceStart) == 0x000828, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_BreakHitResult_TraceEnd) == 0x000834, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_Less_IntInt_ReturnValue) == 0x000840, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_DynamicCast_AsBuilding_SMActor) == 0x000848, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_DynamicCast_AsBuilding_SMActor' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_DynamicCast_bSuccess_3) == 0x000850, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue) == 0x000854, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_DynamicCast_AsBuilding_Trap) == 0x000860, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_DynamicCast_AsBuilding_Trap' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_DynamicCast_bSuccess_4) == 0x000868, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_DynamicCast_AsFort_Player_Pawn_3) == 0x000870, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_DynamicCast_AsFort_Player_Pawn_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_DynamicCast_bSuccess_5) == 0x000878, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000880, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x000888, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x000898, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_GetController_ReturnValue) == 0x0008A0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_DynamicCast_AsFort_Player_Controller) == 0x0008A8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_DynamicCast_bSuccess_6) == 0x0008B0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_IsValid_ReturnValue_1) == 0x0008B1, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x0008B4, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_Map_Find_Value) == 0x0008B8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_Map_Find_ReturnValue) == 0x0008BC, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_CreateDelegate_OutputDelegate_1) == 0x0008C0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0008D0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0008D8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_CustomEvent_FortPawn) == 0x0008E0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_CustomEvent_FortPawn' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_CustomEvent_DamagedActor) == 0x0008E8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_CustomEvent_Damage) == 0x0008F0, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_CustomEvent_InstigatedBy) == 0x0008F8, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_CustomEvent_DamageCauser) == 0x000900, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_CustomEvent_HitLocation) == 0x000908, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_CustomEvent_FHitComponent) == 0x000918, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_CustomEvent_BoneName) == 0x000920, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_CustomEvent_Momentum) == 0x000928, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(B_HidingProp_C_ExecuteUbergraph_B_HidingProp, K2Node_DynamicCast_AsFort_Player_Pawn_4) == 0x000938, "Member 'B_HidingProp_C_ExecuteUbergraph_B_HidingProp::K2Node_DynamicCast_AsFort_Player_Pawn_4' has a wrong offset!");
