#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_FragGrenade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "B_Prj_Athena_Grenade_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_FragGrenade.B_Prj_Athena_FragGrenade_C
// 0x0028 (0x0910 - 0x08E8)
class AB_Prj_Athena_FragGrenade_C final : public AB_Prj_Athena_Grenade_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Prj_Athena_FragGrenade_C;         // 0x08E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_SurfaceTypeSoundComponent_C*        BP_SurfaceTypeSoundComponent;                      // 0x08F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         PreExploWarning_PreExplo_E5859FFE443F57359EC2C0AB73DFA4CD; // 0x08F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PreExploWarning__Direction_E5859FFE443F57359EC2C0AB73DFA4CD; // 0x08FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FD[0x3];                                      // 0x08FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PreExploWarning;                                   // 0x0900(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           FeedbackCue;                                       // 0x0908(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Athena_FragGrenade(int32 EntryPoint);
	void Pre_Explo_Audio_Tell();
	void ReceiveBeginPlay();
	void OnBounce(const struct FHitResult& Hit);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void FuseEnded();
	void PreExploWarning__FinishedFunc();
	void PreExploWarning__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_FragGrenade_C">();
	}
	static class AB_Prj_Athena_FragGrenade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_FragGrenade_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_FragGrenade_C) == 0x000008, "Wrong alignment on AB_Prj_Athena_FragGrenade_C");
static_assert(sizeof(AB_Prj_Athena_FragGrenade_C) == 0x000910, "Wrong size on AB_Prj_Athena_FragGrenade_C");
static_assert(offsetof(AB_Prj_Athena_FragGrenade_C, UberGraphFrame_B_Prj_Athena_FragGrenade_C) == 0x0008E8, "Member 'AB_Prj_Athena_FragGrenade_C::UberGraphFrame_B_Prj_Athena_FragGrenade_C' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_FragGrenade_C, BP_SurfaceTypeSoundComponent) == 0x0008F0, "Member 'AB_Prj_Athena_FragGrenade_C::BP_SurfaceTypeSoundComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_FragGrenade_C, PreExploWarning_PreExplo_E5859FFE443F57359EC2C0AB73DFA4CD) == 0x0008F8, "Member 'AB_Prj_Athena_FragGrenade_C::PreExploWarning_PreExplo_E5859FFE443F57359EC2C0AB73DFA4CD' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_FragGrenade_C, PreExploWarning__Direction_E5859FFE443F57359EC2C0AB73DFA4CD) == 0x0008FC, "Member 'AB_Prj_Athena_FragGrenade_C::PreExploWarning__Direction_E5859FFE443F57359EC2C0AB73DFA4CD' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_FragGrenade_C, PreExploWarning) == 0x000900, "Member 'AB_Prj_Athena_FragGrenade_C::PreExploWarning' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_FragGrenade_C, FeedbackCue) == 0x000908, "Member 'AB_Prj_Athena_FragGrenade_C::FeedbackCue' has a wrong offset!");

}

