#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Ranged_GrenadeLauncher_Snowball_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Ranged_GrenadeLauncher_Snowball_Athena.B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C.ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena
// 0x03B8 (0x03B8 - 0x0000)
struct B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit_1;                                // 0x0004(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x0098(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x00A8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingKilled_ReturnValue;                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit_2;                                // 0x00C8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_Select_Default;                             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_2;     // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0218(0x00B8)(ContainsInstancedReference)
	bool                                          CallFunc_IsInWater_ReturnValue;                    // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0330(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena) == 0x000008, "Wrong alignment on B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena");
static_assert(sizeof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena) == 0x0003B8, "Wrong size on B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, EntryPoint) == 0x000000, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_Event_Hit_1) == 0x000004, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_Event_Hit_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000090, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_Event_HitActors) == 0x000098, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_Event_HitResults) == 0x0000A8, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_Event_HitResults' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B8, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_IsBeingKilled_ReturnValue) == 0x0000C4, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_IsBeingKilled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, Temp_bool_Variable) == 0x0000C5, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_Event_Hit_2) == 0x0000C8, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_Event_Hit_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_K2_SetTimer_ReturnValue) == 0x000150, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_BreakHitResult_bBlockingHit) == 0x000158, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_BreakHitResult_bInitialOverlap) == 0x000159, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_BreakHitResult_Time) == 0x00015C, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_BreakHitResult_Distance) == 0x000160, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_BreakHitResult_Location) == 0x000164, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_BreakHitResult_ImpactPoint) == 0x000170, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_BreakHitResult_Normal) == 0x00017C, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_BreakHitResult_ImpactNormal) == 0x000188, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_BreakHitResult_PhysMat) == 0x000198, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_BreakHitResult_HitActor) == 0x0001A0, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_BreakHitResult_HitComponent) == 0x0001A8, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_BreakHitResult_HitBoneName) == 0x0001B0, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_BreakHitResult_HitItem) == 0x0001B8, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_BreakHitResult_FaceIndex) == 0x0001BC, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_BreakHitResult_TraceStart) == 0x0001C0, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_BreakHitResult_TraceEnd) == 0x0001CC, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_MakeRotFromZ_ReturnValue) == 0x0001D8, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_MakeRotFromX_ReturnValue) == 0x0001E4, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0001F0, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001F8, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_SwitchEnum_CmpSuccess) == 0x0001F9, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001FA, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0001FB, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_Select_Default) == 0x000200, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x000208, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_SpawnEmitterAtLocation_ReturnValue_2) == 0x000210, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_SpawnEmitterAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000218, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, CallFunc_IsInWater_ReturnValue) == 0x0002D0, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::CallFunc_IsInWater_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_ComponentBoundEvent_WaterBody) == 0x0002D8, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_ComponentBoundEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_ComponentBoundEvent_WaterInteractionComponent) == 0x0002E0, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_ComponentBoundEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_ComponentBoundEvent_bIsFirstBody) == 0x0002E8, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_ComponentBoundEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_Event_MyComp) == 0x0002F0, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_Event_Other) == 0x0002F8, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_Event_OtherComp) == 0x000300, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_Event_bSelfMoved) == 0x000308, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_Event_HitLocation) == 0x00030C, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_Event_HitNormal) == 0x000318, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_Event_NormalImpulse) == 0x000324, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena, K2Node_Event_Hit) == 0x000330, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Snowball_Athena::K2Node_Event_Hit' has a wrong offset!");

// Function B_Prj_Ranged_GrenadeLauncher_Snowball_Athena.B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C.ReceiveHit
// 0x00C8 (0x00C8 - 0x0000)
struct B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit) == 0x000008, "Wrong alignment on B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit");
static_assert(sizeof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit) == 0x0000C8, "Wrong size on B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit, MyComp) == 0x000000, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit, Other) == 0x000008, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit, OtherComp) == 0x000010, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit, HitNormal) == 0x000028, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit, Hit) == 0x000040, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_ReceiveHit::Hit' has a wrong offset!");

// Function B_Prj_Ranged_GrenadeLauncher_Snowball_Athena.B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C.BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         WaterInteractionComponent_0;                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000008, "Wrong alignment on B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(sizeof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000018, "Wrong size on B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterBody) == 0x000000, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterBody' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterInteractionComponent_0) == 0x000008, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterInteractionComponent_0' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, bIsFirstBody) == 0x000010, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::bIsFirstBody' has a wrong offset!");

// Function B_Prj_Ranged_GrenadeLauncher_Snowball_Athena.B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C.OnExploded
// 0x0020 (0x0020 - 0x0000)
struct B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnExploded final
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     HitResults;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnExploded) == 0x000008, "Wrong alignment on B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnExploded");
static_assert(sizeof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnExploded) == 0x000020, "Wrong size on B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnExploded");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnExploded, HitActors) == 0x000000, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnExploded::HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnExploded, HitResults) == 0x000010, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnExploded::HitResults' has a wrong offset!");

// Function B_Prj_Ranged_GrenadeLauncher_Snowball_Athena.B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C.OnBounce
// 0x0088 (0x0088 - 0x0000)
struct B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnBounce final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnBounce) == 0x000004, "Wrong alignment on B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnBounce");
static_assert(sizeof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnBounce) == 0x000088, "Wrong size on B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnBounce");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnBounce, Hit) == 0x000000, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnBounce::Hit' has a wrong offset!");

// Function B_Prj_Ranged_GrenadeLauncher_Snowball_Athena.B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C.OnStop
// 0x0088 (0x0088 - 0x0000)
struct B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnStop) == 0x000004, "Wrong alignment on B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnStop");
static_assert(sizeof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnStop) == 0x000088, "Wrong size on B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnStop");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnStop, Hit) == 0x000000, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_OnStop::Hit' has a wrong offset!");

// Function B_Prj_Ranged_GrenadeLauncher_Snowball_Athena.B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_UserConstructionScript final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_AddComponent_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_UserConstructionScript) == 0x000010, "Wrong alignment on B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_UserConstructionScript");
static_assert(sizeof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_UserConstructionScript) == 0x000040, "Wrong size on B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_UserConstructionScript");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000030, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function B_Prj_Ranged_GrenadeLauncher_Snowball_Athena.B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C.SpawnBounceFX
// 0x0140 (0x0140 - 0x0000)
struct B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_SpawnBounceFX final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 HitActor;                                          // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              SurfaceType;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               HitResultRotation;                                 // 0x0094(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              CallFunc_GetFortPhysicalSurface_ReturnValue;       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_SpawnBounceFX) == 0x000008, "Wrong alignment on B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_SpawnBounceFX");
static_assert(sizeof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_SpawnBounceFX) == 0x000140, "Wrong size on B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_SpawnBounceFX");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_SpawnBounceFX, Hit) == 0x000000, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_SpawnBounceFX::Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_SpawnBounceFX, HitActor) == 0x000088, "Member 'B_Prj_Ranged_GrenadeLauncher_Snowball_Athena_C_SpawnBounceFX::HitActor' has a wrong offset!");
