#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Ashton_Indigo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Ashton_Indigo.B_Prj_Ashton_Indigo_C
// 0x00E8 (0x0A28 - 0x0940)
class AB_Prj_Ashton_Indigo_C final : public AFortProjectileAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0940(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   TracerMesh_Outer;                                  // 0x0948(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TracerMesh;                                        // 0x0950(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               TracerBody;                                        // 0x0958(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Projectile_Max_Lifetime;                           // 0x0960(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasExploded_;                                     // 0x0964(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_965[0x3];                                      // 0x0965(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Impact_Location;                                   // 0x0968(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0974(0x0088)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         FX_Linger_Time;                                    // 0x09FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Lifespan_Timer;                                    // 0x0A00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         InterpSpeed;                                       // 0x0A08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Max_Projectile_Size;                               // 0x0A0C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Proj_MID;                                          // 0x0A18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tracer_Lifetime;                                   // 0x0A20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Ashton_Indigo(int32 EntryPoint);
	void OnReachedLockTargetDistanceThreshold();
	void OnHomingPassedTarget();
	void Explosion_VFX();
	void Timeout();
	void Reset_Explosion_Sound();
	void Play_Explosion_Sound();
	void OnStop(const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void OnRep_Impact_Location();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Ashton_Indigo_C">();
	}
	static class AB_Prj_Ashton_Indigo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Ashton_Indigo_C>();
	}
};
static_assert(alignof(AB_Prj_Ashton_Indigo_C) == 0x000008, "Wrong alignment on AB_Prj_Ashton_Indigo_C");
static_assert(sizeof(AB_Prj_Ashton_Indigo_C) == 0x000A28, "Wrong size on AB_Prj_Ashton_Indigo_C");
static_assert(offsetof(AB_Prj_Ashton_Indigo_C, UberGraphFrame) == 0x000940, "Member 'AB_Prj_Ashton_Indigo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ashton_Indigo_C, TracerMesh_Outer) == 0x000948, "Member 'AB_Prj_Ashton_Indigo_C::TracerMesh_Outer' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ashton_Indigo_C, TracerMesh) == 0x000950, "Member 'AB_Prj_Ashton_Indigo_C::TracerMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ashton_Indigo_C, TracerBody) == 0x000958, "Member 'AB_Prj_Ashton_Indigo_C::TracerBody' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ashton_Indigo_C, Projectile_Max_Lifetime) == 0x000960, "Member 'AB_Prj_Ashton_Indigo_C::Projectile_Max_Lifetime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ashton_Indigo_C, bHasExploded_) == 0x000964, "Member 'AB_Prj_Ashton_Indigo_C::bHasExploded_' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ashton_Indigo_C, Impact_Location) == 0x000968, "Member 'AB_Prj_Ashton_Indigo_C::Impact_Location' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ashton_Indigo_C, HitResult) == 0x000974, "Member 'AB_Prj_Ashton_Indigo_C::HitResult' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ashton_Indigo_C, FX_Linger_Time) == 0x0009FC, "Member 'AB_Prj_Ashton_Indigo_C::FX_Linger_Time' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ashton_Indigo_C, Lifespan_Timer) == 0x000A00, "Member 'AB_Prj_Ashton_Indigo_C::Lifespan_Timer' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ashton_Indigo_C, InterpSpeed) == 0x000A08, "Member 'AB_Prj_Ashton_Indigo_C::InterpSpeed' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ashton_Indigo_C, Max_Projectile_Size) == 0x000A0C, "Member 'AB_Prj_Ashton_Indigo_C::Max_Projectile_Size' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ashton_Indigo_C, Proj_MID) == 0x000A18, "Member 'AB_Prj_Ashton_Indigo_C::Proj_MID' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ashton_Indigo_C, Tracer_Lifetime) == 0x000A20, "Member 'AB_Prj_Ashton_Indigo_C::Tracer_Lifetime' has a wrong offset!");

}

