#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Arrow_DemonHunter_Crossbow_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Arrow_DemonHunter_Crossbow_Athena.B_Prj_Arrow_DemonHunter_Crossbow_Athena_C.ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena
// 0x0478 (0x0478 - 0x0000)
struct B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_12;                              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_14;                              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_15;                              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_16;                              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_17;                              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_18;                              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_19;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_20;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_21;                              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_22;                              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_23;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0080(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_bIsOverlap;                           // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_24;                              // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_25;                              // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              Temp_byte_Variable;                                // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation; // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal; // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition; // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLastWaterSurfaceInfo_WaterDepth;       // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx;     // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterVelocity;    // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D6[0x2];                                      // 0x01D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_256[0x2];                                      // 0x0256(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_2;       // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_272[0x2];                                      // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADeimos_Fiend_C*                        K2Node_DynamicCast_AsDeimos_Fiend;                 // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Temp_FindClosestBone_ClosestBone;         // 0x030C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0320(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0334(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BE[0x2];                                      // 0x03BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FindClosestBone_K2_BoneLocation;          // 0x03C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_FindClosestBone_K2_ReturnValue;           // 0x03CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              CallFunc_GetSurfaceType_ReturnValue;               // 0x03D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D6[0x2];                                      // 0x03D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_1;                           // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x03EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena) == 0x000008, "Wrong alignment on B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena");
static_assert(sizeof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena) == 0x000478, "Wrong size on B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, EntryPoint) == 0x000000, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_object_Variable) == 0x000008, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable) == 0x000010, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_1) == 0x000014, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_2) == 0x000018, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_3) == 0x00001C, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_4) == 0x000020, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_5) == 0x000024, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_6) == 0x000028, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_7) == 0x00002C, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_8) == 0x000030, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_9) == 0x000034, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_10) == 0x000038, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_10' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_11) == 0x00003C, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_11' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_12) == 0x000040, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_12' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_13) == 0x000044, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_13' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_14) == 0x000048, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_14' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_15) == 0x00004C, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_15' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_16) == 0x000050, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_16' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_17) == 0x000054, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_17' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_18) == 0x000058, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_18' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_19) == 0x00005C, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_19' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_20) == 0x000060, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_20' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_21) == 0x000064, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_21' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_22) == 0x000068, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_22' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_23) == 0x00006C, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_23' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, K2Node_Event_OtherActor) == 0x000070, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, K2Node_Event_OtherComp) == 0x000078, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, K2Node_Event_HitResult) == 0x000080, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, K2Node_Event_bIsOverlap) == 0x000108, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::K2Node_Event_bIsOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00010C, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_24) == 0x000118, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_24' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_int_Variable_25) == 0x00011C, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_int_Variable_25' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_GetActorForwardVector_ReturnValue) == 0x000120, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00012C, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x000138, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00013C, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000148, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x000154, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_bool_Variable) == 0x000160, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000164, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000170, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x000174, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_byte_Variable) == 0x000180, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_name_Variable) == 0x000184, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, Temp_bool_Variable_1) == 0x00018C, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000190, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation) == 0x00019C, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal) == 0x0001A8, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition) == 0x0001B4, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_GetLastWaterSurfaceInfo_WaterDepth) == 0x0001C0, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_GetLastWaterSurfaceInfo_WaterDepth' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx) == 0x0001C4, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_GetLastWaterSurfaceInfo_WaterVelocity) == 0x0001C8, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_GetLastWaterSurfaceInfo_WaterVelocity' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_bBlockingHit) == 0x0001D4, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001D5, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_Time) == 0x0001D8, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_Distance) == 0x0001DC, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_Location) == 0x0001E0, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_ImpactPoint) == 0x0001EC, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_Normal) == 0x0001F8, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_ImpactNormal) == 0x000204, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_PhysMat) == 0x000210, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_HitActor) == 0x000218, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_HitComponent) == 0x000220, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_HitBoneName) == 0x000228, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_HitItem) == 0x000230, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_FaceIndex) == 0x000234, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_TraceStart) == 0x000238, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_TraceEnd) == 0x000244, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000250, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_IsValid_ReturnValue) == 0x000254, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000255, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_Conv_VectorToRotator_ReturnValue_2) == 0x000258, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_Conv_VectorToRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000268, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000270, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000271, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_Time_1) == 0x000274, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_Distance_1) == 0x000278, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_Location_1) == 0x00027C, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000288, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_Normal_1) == 0x000294, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0002A0, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_PhysMat_1) == 0x0002B0, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_HitActor_1) == 0x0002B8, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_HitComponent_1) == 0x0002C0, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_HitBoneName_1) == 0x0002C8, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_HitItem_1) == 0x0002D0, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_FaceIndex_1) == 0x0002D4, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_TraceStart_1) == 0x0002D8, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_BreakHitResult_TraceEnd_1) == 0x0002E4, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0002F0, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, K2Node_DynamicCast_bSuccess) == 0x0002F8, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, K2Node_DynamicCast_AsDeimos_Fiend) == 0x000300, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::K2Node_DynamicCast_AsDeimos_Fiend' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, K2Node_DynamicCast_bSuccess_1) == 0x000308, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_Temp_FindClosestBone_ClosestBone) == 0x00030C, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_Temp_FindClosestBone_ClosestBone' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, K2Node_Select_Default) == 0x000318, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000320, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, K2Node_DynamicCast_AsFort_Pawn) == 0x000328, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, K2Node_DynamicCast_bSuccess_2) == 0x000330, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000334, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_GetTeamAffiliation_ReturnValue) == 0x0003BC, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, K2Node_SwitchEnum_CmpSuccess) == 0x0003BD, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_FindClosestBone_K2_BoneLocation) == 0x0003C0, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_FindClosestBone_K2_BoneLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_FindClosestBone_K2_ReturnValue) == 0x0003CC, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_FindClosestBone_K2_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0003D4, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, CallFunc_GetSurfaceType_ReturnValue) == 0x0003D5, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::CallFunc_GetSurfaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena, K2Node_Select_Default_1) == 0x0003D8, "Member 'B_Prj_Arrow_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_Prj_Arrow_DemonHunter_Crossbow_Athena::K2Node_Select_Default_1' has a wrong offset!");
