#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Ranged_Ashton_Indigo_Athena

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_Ranged_Ashton_Indigo_Athena.B_Ranged_Ashton_Indigo_Athena_C.ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena
// 0x00D8 (0x00D8 - 0x0000)
struct B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDualWeaponHand                               K2Node_CustomEvent_Hand;                           // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPersistantFire;                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNewIsTargeting;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    K2Node_Event_SpawnProjectile;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Prj_Ashton_Indigo_C*                 K2Node_DynamicCast_AsB_Prj_Ashton_Indigo;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingStyle_self_CastInput;            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingTurnSpeedMax_self_CastInput;     // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingTurnSpeedMin_self_CastInput;     // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingLockTargetDistanceThreshold_self_CastInput; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingTimeUntilMaxTurnSpeed_self_CastInput; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingTarget_self_CastInput;           // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAshton_Indigo_LockOnWidget_C*          CallFunc_Create_ReturnValue;                       // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EDualWeaponHand Hand, bool bPersistantFire)> K2Node_CreateDelegate_OutputDelegate;              // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena) == 0x000008, "Wrong alignment on B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena");
static_assert(sizeof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena) == 0x0000D8, "Wrong size on B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, EntryPoint) == 0x000000, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000006, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, Temp_bool_IsClosed_Variable) == 0x000007, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, K2Node_Event_bPersistentFire) == 0x000008, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, K2Node_Event_bSecondaryFire) == 0x000009, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, K2Node_CustomEvent_Hand) == 0x00000A, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::K2Node_CustomEvent_Hand' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, K2Node_CustomEvent_bPersistantFire) == 0x00000B, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::K2Node_CustomEvent_bPersistantFire' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1) == 0x00000C, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, K2Node_Event_bNewIsTargeting) == 0x00000D, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::K2Node_Event_bNewIsTargeting' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, K2Node_Event_SpawnProjectile) == 0x000010, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::K2Node_Event_SpawnProjectile' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, K2Node_DynamicCast_AsB_Prj_Ashton_Indigo) == 0x000018, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::K2Node_DynamicCast_AsB_Prj_Ashton_Indigo' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, CallFunc_SetHomingStyle_self_CastInput) == 0x000028, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::CallFunc_SetHomingStyle_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, Temp_bool_Has_Been_Initd_Variable_1) == 0x000038, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, CallFunc_SetHomingTurnSpeedMax_self_CastInput) == 0x000040, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::CallFunc_SetHomingTurnSpeedMax_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000050, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, CallFunc_SetHomingTurnSpeedMin_self_CastInput) == 0x000058, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::CallFunc_SetHomingTurnSpeedMin_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, CallFunc_SetHomingLockTargetDistanceThreshold_self_CastInput) == 0x000068, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::CallFunc_SetHomingLockTargetDistanceThreshold_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, CallFunc_SetHomingTimeUntilMaxTurnSpeed_self_CastInput) == 0x000078, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::CallFunc_SetHomingTimeUntilMaxTurnSpeed_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, CallFunc_SetHomingTarget_self_CastInput) == 0x000088, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::CallFunc_SetHomingTarget_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, CallFunc_Create_ReturnValue) == 0x000098, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, CallFunc_IsValid_ReturnValue_1) == 0x0000A0, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, CallFunc_IsLocallyControlled_ReturnValue) == 0x0000A1, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, K2Node_CreateDelegate_OutputDelegate) == 0x0000A4, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, CallFunc_IsValid_ReturnValue_2) == 0x0000B4, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000B8, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, CallFunc_IsValid_ReturnValue_3) == 0x0000C0, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000C8, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, K2Node_Event_DeltaSeconds) == 0x0000D0, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena, Temp_bool_IsClosed_Variable_1) == 0x0000D4, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ExecuteUbergraph_B_Ranged_Ashton_Indigo_Athena::Temp_bool_IsClosed_Variable_1' has a wrong offset!");

// Function B_Ranged_Ashton_Indigo_Athena.B_Ranged_Ashton_Indigo_Athena_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_Ranged_Ashton_Indigo_Athena_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_Ashton_Indigo_Athena_C_ReceiveTick) == 0x000004, "Wrong alignment on B_Ranged_Ashton_Indigo_Athena_C_ReceiveTick");
static_assert(sizeof(B_Ranged_Ashton_Indigo_Athena_C_ReceiveTick) == 0x000004, "Wrong size on B_Ranged_Ashton_Indigo_Athena_C_ReceiveTick");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function B_Ranged_Ashton_Indigo_Athena.B_Ranged_Ashton_Indigo_Athena_C.OnSpawnProjectile
// 0x0008 (0x0008 - 0x0000)
struct B_Ranged_Ashton_Indigo_Athena_C_OnSpawnProjectile final
{
public:
	class AFortProjectileBase*                    SpawnProjectile;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_Ashton_Indigo_Athena_C_OnSpawnProjectile) == 0x000008, "Wrong alignment on B_Ranged_Ashton_Indigo_Athena_C_OnSpawnProjectile");
static_assert(sizeof(B_Ranged_Ashton_Indigo_Athena_C_OnSpawnProjectile) == 0x000008, "Wrong size on B_Ranged_Ashton_Indigo_Athena_C_OnSpawnProjectile");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_OnSpawnProjectile, SpawnProjectile) == 0x000000, "Member 'B_Ranged_Ashton_Indigo_Athena_C_OnSpawnProjectile::SpawnProjectile' has a wrong offset!");

// Function B_Ranged_Ashton_Indigo_Athena.B_Ranged_Ashton_Indigo_Athena_C.OnSetTargeting
// 0x0001 (0x0001 - 0x0000)
struct B_Ranged_Ashton_Indigo_Athena_C_OnSetTargeting final
{
public:
	bool                                          bNewIsTargeting;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Ranged_Ashton_Indigo_Athena_C_OnSetTargeting) == 0x000001, "Wrong alignment on B_Ranged_Ashton_Indigo_Athena_C_OnSetTargeting");
static_assert(sizeof(B_Ranged_Ashton_Indigo_Athena_C_OnSetTargeting) == 0x000001, "Wrong size on B_Ranged_Ashton_Indigo_Athena_C_OnSetTargeting");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_OnSetTargeting, bNewIsTargeting) == 0x000000, "Member 'B_Ranged_Ashton_Indigo_Athena_C_OnSetTargeting::bNewIsTargeting' has a wrong offset!");

// Function B_Ranged_Ashton_Indigo_Athena.B_Ranged_Ashton_Indigo_Athena_C.HandFired
// 0x0002 (0x0002 - 0x0000)
struct B_Ranged_Ashton_Indigo_Athena_C_HandFired final
{
public:
	EDualWeaponHand                               Hand;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPersistantFire;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Ranged_Ashton_Indigo_Athena_C_HandFired) == 0x000001, "Wrong alignment on B_Ranged_Ashton_Indigo_Athena_C_HandFired");
static_assert(sizeof(B_Ranged_Ashton_Indigo_Athena_C_HandFired) == 0x000002, "Wrong size on B_Ranged_Ashton_Indigo_Athena_C_HandFired");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_HandFired, Hand) == 0x000000, "Member 'B_Ranged_Ashton_Indigo_Athena_C_HandFired::Hand' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_HandFired, bPersistantFire) == 0x000001, "Member 'B_Ranged_Ashton_Indigo_Athena_C_HandFired::bPersistantFire' has a wrong offset!");

// Function B_Ranged_Ashton_Indigo_Athena.B_Ranged_Ashton_Indigo_Athena_C.OnPlayWeaponFireFX
// 0x0002 (0x0002 - 0x0000)
struct B_Ranged_Ashton_Indigo_Athena_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSecondaryFire;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Ranged_Ashton_Indigo_Athena_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_Ranged_Ashton_Indigo_Athena_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_Ranged_Ashton_Indigo_Athena_C_OnPlayWeaponFireFX) == 0x000002, "Wrong size on B_Ranged_Ashton_Indigo_Athena_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_Ranged_Ashton_Indigo_Athena_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_OnPlayWeaponFireFX, bSecondaryFire) == 0x000001, "Member 'B_Ranged_Ashton_Indigo_Athena_C_OnPlayWeaponFireFX::bSecondaryFire' has a wrong offset!");

// Function B_Ranged_Ashton_Indigo_Athena.B_Ranged_Ashton_Indigo_Athena_C.HideReticle
// 0x0018 (0x0018 - 0x0000)
struct B_Ranged_Ashton_Indigo_Athena_C_HideReticle final
{
public:
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerZone*              K2Node_DynamicCast_AsFort_Player_Controller_Zone;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Ranged_Ashton_Indigo_Athena_C_HideReticle) == 0x000008, "Wrong alignment on B_Ranged_Ashton_Indigo_Athena_C_HideReticle");
static_assert(sizeof(B_Ranged_Ashton_Indigo_Athena_C_HideReticle) == 0x000018, "Wrong size on B_Ranged_Ashton_Indigo_Athena_C_HideReticle");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_HideReticle, CallFunc_GetInstigatorController_ReturnValue) == 0x000000, "Member 'B_Ranged_Ashton_Indigo_Athena_C_HideReticle::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_HideReticle, K2Node_DynamicCast_AsFort_Player_Controller_Zone) == 0x000008, "Member 'B_Ranged_Ashton_Indigo_Athena_C_HideReticle::K2Node_DynamicCast_AsFort_Player_Controller_Zone' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_HideReticle, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'B_Ranged_Ashton_Indigo_Athena_C_HideReticle::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function B_Ranged_Ashton_Indigo_Athena.B_Ranged_Ashton_Indigo_Athena_C.ShowReticle
// 0x0018 (0x0018 - 0x0000)
struct B_Ranged_Ashton_Indigo_Athena_C_ShowReticle final
{
public:
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerZone*              K2Node_DynamicCast_AsFort_Player_Controller_Zone;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Ranged_Ashton_Indigo_Athena_C_ShowReticle) == 0x000008, "Wrong alignment on B_Ranged_Ashton_Indigo_Athena_C_ShowReticle");
static_assert(sizeof(B_Ranged_Ashton_Indigo_Athena_C_ShowReticle) == 0x000018, "Wrong size on B_Ranged_Ashton_Indigo_Athena_C_ShowReticle");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ShowReticle, CallFunc_GetInstigatorController_ReturnValue) == 0x000000, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ShowReticle::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ShowReticle, K2Node_DynamicCast_AsFort_Player_Controller_Zone) == 0x000008, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ShowReticle::K2Node_DynamicCast_AsFort_Player_Controller_Zone' has a wrong offset!");
static_assert(offsetof(B_Ranged_Ashton_Indigo_Athena_C_ShowReticle, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'B_Ranged_Ashton_Indigo_Athena_C_ShowReticle::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

