#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassLeaderboard

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassLeaderboard.BattlePassLeaderboard_C
// 0x0038 (0x0320 - 0x02E8)
class UBattlePassLeaderboard_C final : public UBattlePassLeaderboard
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBattlePassLeaderboardListEntry_C*      BattlePassLeaderboardListEntry;                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CloseIcon;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox_26;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         MobileCloseButton;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayCloseButton;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void HandleBack(bool* PassThrough);
	void BP_OnActivated();
	void BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_BattlePassLeaderboard(int32 EntryPoint);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassLeaderboard_C">();
	}
	static class UBattlePassLeaderboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassLeaderboard_C>();
	}
};
static_assert(alignof(UBattlePassLeaderboard_C) == 0x000008, "Wrong alignment on UBattlePassLeaderboard_C");
static_assert(sizeof(UBattlePassLeaderboard_C) == 0x000320, "Wrong size on UBattlePassLeaderboard_C");
static_assert(offsetof(UBattlePassLeaderboard_C, UberGraphFrame) == 0x0002E8, "Member 'UBattlePassLeaderboard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassLeaderboard_C, BattlePassLeaderboardListEntry) == 0x0002F0, "Member 'UBattlePassLeaderboard_C::BattlePassLeaderboardListEntry' has a wrong offset!");
static_assert(offsetof(UBattlePassLeaderboard_C, CloseIcon) == 0x0002F8, "Member 'UBattlePassLeaderboard_C::CloseIcon' has a wrong offset!");
static_assert(offsetof(UBattlePassLeaderboard_C, Lightbox_26) == 0x000300, "Member 'UBattlePassLeaderboard_C::Lightbox_26' has a wrong offset!");
static_assert(offsetof(UBattlePassLeaderboard_C, MobileCloseButton) == 0x000308, "Member 'UBattlePassLeaderboard_C::MobileCloseButton' has a wrong offset!");
static_assert(offsetof(UBattlePassLeaderboard_C, OverlayCloseButton) == 0x000310, "Member 'UBattlePassLeaderboard_C::OverlayCloseButton' has a wrong offset!");
static_assert(offsetof(UBattlePassLeaderboard_C, SafeZone_0) == 0x000318, "Member 'UBattlePassLeaderboard_C::SafeZone_0' has a wrong offset!");

}

