#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassScreenReward

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassScreenReward.BattlePassScreenReward_C
// 0x0110 (0x0CA8 - 0x0B98)
class UBattlePassScreenReward_C final : public UFortBattlePassRewardEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CheckBoxPulse;                                     // 0x0BA0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RewardFade;                                        // 0x0BA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FreeTagPulse;                                      // 0x0BB0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SocialPopulate;                                    // 0x0BB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0BC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SocialPlayerFade;                                  // 0x0BC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Card_OverlayedContent;                             // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EarnedCheckmark;                                   // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EarnedTint;                                        // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FailedLoadIcon;                                    // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FreeGlow;                                          // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FreeTag_Backing;                                   // 0x0C00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               FreeTrack_FreeTag;                                 // 0x0C08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LevelNumber_Backing;                               // 0x0C10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaSeasonItemRewardIcon_C*          PrimaryAthenaSeasonItemRewardIcon;                 // 0x0C18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Progress;                                          // 0x0C20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Progress_Level_Bar;                                // 0x0C28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ProgressBarContainer;                              // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaSeasonItemRewardIcon_C*          SecondaryAthenaSeasonItemRewardIcon;               // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Social_Tracking;                                   // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SocialPlayerIcon;                                  // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SocialPointer;                                     // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SocialProgress_Tracker;                            // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Free;                                         // 0x0C60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Level;                                        // 0x0C68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bSocialUserVisible;                                // 0x0C70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPlaySocialUserAnimation;                          // 0x0C71(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C72[0x6];                                      // 0x0C72(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       SocialPlayerFade_0;                                // 0x0C78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0C80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C81[0x3];                                      // 0x0C81(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TierLevel;                                         // 0x0C84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPrimaryRewardSelected;                            // 0x0C88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C89[0x7];                                      // 0x0C89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     HB_Slot_1;                                         // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     HB_Slot_2;                                         // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LevelNumberStyling;                                // 0x0CA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHideProgressAndSocial;                            // 0x0CA1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void HandleMultiRewardSelectionChange(bool bIsSelected_0);
	void HandleMultiRewardSetup(const class UFortItem* RewardItem, const TSoftObjectPtr<class UTexture2D>& RewardTexture, bool bHasAdditionalStylesToDisplay);
	void HandleHover();
	void HandleUnhover();
	void HandleMultiRewardTickFillAnimation();
	void HandleSelectedAnim();
	void HandleDeselectedAnim();
	void HandleCompletionState(bool bIsFree, bool bOwnsBattlePass, int32 TierLevel_0, int32 CurrentSeasonLevel);
	void HandleFreeTagVisibility(bool bIsFreeItem);
	void HandleSecondaryRewardVisiblity();
	void HandleProgressBar(float ProgressAmount, bool bIsLastEntry);
	void HandleLevelNumberStyling(bool bIsCompletedLevel, int32 TierLevel_0);
	void SelectReward(class UAthenaSeasonItemRewardIcon_C* RewardIcon, bool bIsSelected_0);
	void PopulateRewardData(int32 TierLevel_0, bool IsFree, bool OwnsBattlePass, int32 CurrentSeasonLevel);
	void OnSetReward(class UFortItem* InReward, int32 TierLevel_0, float TierProgress, bool bIsLastEntry, bool bHasAdditionalStylesToDisplay, const TSoftObjectPtr<class UTexture2D>& RewardTexture, bool bIsFreeItem, bool bOwnsBattlePass, int32 SeasonLevel, bool bIsFirstEntry);
	void BP_OnSelected();
	void BP_OnDeselected();
	void Construct();
	void FadeOutSocialUser(bool bCallback);
	void FadeInSocialUser();
	void SetSocialPlayerProgress(float Progress_0);
	void OnLoadSocialIcon(bool bSuccess, class UTexture2D* Texture);
	void OnSetRotatingReward(class UFortItem* InReward, bool bHasAdditionalStylesToDisplay, const TSoftObjectPtr<class UTexture2D>& RewardTexture, bool bIsFreeItem, bool bOwnsBattlePass, int32 SeasonLevel);
	void OnRotateReward(int32 Index_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void ExecuteUbergraph_BattlePassScreenReward(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassScreenReward_C">();
	}
	static class UBattlePassScreenReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassScreenReward_C>();
	}
};
static_assert(alignof(UBattlePassScreenReward_C) == 0x000008, "Wrong alignment on UBattlePassScreenReward_C");
static_assert(sizeof(UBattlePassScreenReward_C) == 0x000CA8, "Wrong size on UBattlePassScreenReward_C");
static_assert(offsetof(UBattlePassScreenReward_C, UberGraphFrame) == 0x000B98, "Member 'UBattlePassScreenReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, CheckBoxPulse) == 0x000BA0, "Member 'UBattlePassScreenReward_C::CheckBoxPulse' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, RewardFade) == 0x000BA8, "Member 'UBattlePassScreenReward_C::RewardFade' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, FreeTagPulse) == 0x000BB0, "Member 'UBattlePassScreenReward_C::FreeTagPulse' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, SocialPopulate) == 0x000BB8, "Member 'UBattlePassScreenReward_C::SocialPopulate' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, Hover) == 0x000BC0, "Member 'UBattlePassScreenReward_C::Hover' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, SocialPlayerFade) == 0x000BC8, "Member 'UBattlePassScreenReward_C::SocialPlayerFade' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, Arrow) == 0x000BD0, "Member 'UBattlePassScreenReward_C::Arrow' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, Card_OverlayedContent) == 0x000BD8, "Member 'UBattlePassScreenReward_C::Card_OverlayedContent' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, EarnedCheckmark) == 0x000BE0, "Member 'UBattlePassScreenReward_C::EarnedCheckmark' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, EarnedTint) == 0x000BE8, "Member 'UBattlePassScreenReward_C::EarnedTint' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, FailedLoadIcon) == 0x000BF0, "Member 'UBattlePassScreenReward_C::FailedLoadIcon' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, FreeGlow) == 0x000BF8, "Member 'UBattlePassScreenReward_C::FreeGlow' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, FreeTag_Backing) == 0x000C00, "Member 'UBattlePassScreenReward_C::FreeTag_Backing' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, FreeTrack_FreeTag) == 0x000C08, "Member 'UBattlePassScreenReward_C::FreeTrack_FreeTag' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, LevelNumber_Backing) == 0x000C10, "Member 'UBattlePassScreenReward_C::LevelNumber_Backing' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, PrimaryAthenaSeasonItemRewardIcon) == 0x000C18, "Member 'UBattlePassScreenReward_C::PrimaryAthenaSeasonItemRewardIcon' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, Progress) == 0x000C20, "Member 'UBattlePassScreenReward_C::Progress' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, Progress_Level_Bar) == 0x000C28, "Member 'UBattlePassScreenReward_C::Progress_Level_Bar' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, ProgressBarContainer) == 0x000C30, "Member 'UBattlePassScreenReward_C::ProgressBarContainer' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, SecondaryAthenaSeasonItemRewardIcon) == 0x000C38, "Member 'UBattlePassScreenReward_C::SecondaryAthenaSeasonItemRewardIcon' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, Social_Tracking) == 0x000C40, "Member 'UBattlePassScreenReward_C::Social_Tracking' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, SocialPlayerIcon) == 0x000C48, "Member 'UBattlePassScreenReward_C::SocialPlayerIcon' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, SocialPointer) == 0x000C50, "Member 'UBattlePassScreenReward_C::SocialPointer' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, SocialProgress_Tracker) == 0x000C58, "Member 'UBattlePassScreenReward_C::SocialProgress_Tracker' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, Text_Free) == 0x000C60, "Member 'UBattlePassScreenReward_C::Text_Free' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, Text_Level) == 0x000C68, "Member 'UBattlePassScreenReward_C::Text_Level' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, bSocialUserVisible) == 0x000C70, "Member 'UBattlePassScreenReward_C::bSocialUserVisible' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, bPlaySocialUserAnimation) == 0x000C71, "Member 'UBattlePassScreenReward_C::bPlaySocialUserAnimation' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, SocialPlayerFade_0) == 0x000C78, "Member 'UBattlePassScreenReward_C::SocialPlayerFade_0' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, bIsSelected) == 0x000C80, "Member 'UBattlePassScreenReward_C::bIsSelected' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, TierLevel) == 0x000C84, "Member 'UBattlePassScreenReward_C::TierLevel' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, bPrimaryRewardSelected) == 0x000C88, "Member 'UBattlePassScreenReward_C::bPrimaryRewardSelected' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, HB_Slot_1) == 0x000C90, "Member 'UBattlePassScreenReward_C::HB_Slot_1' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, HB_Slot_2) == 0x000C98, "Member 'UBattlePassScreenReward_C::HB_Slot_2' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, LevelNumberStyling) == 0x000CA0, "Member 'UBattlePassScreenReward_C::LevelNumberStyling' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenReward_C, bHideProgressAndSocial) == 0x000CA1, "Member 'UBattlePassScreenReward_C::bHideProgressAndSocial' has a wrong offset!");

}

