#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BottomBarWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BottomBarWidget.BottomBarWidget_C
// 0x00B0 (0x0308 - 0x0258)
class UBottomBarWidget_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                BorderShell;                                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputReflector_C*                      InputReflector;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputReflector_BottomBar_C*            InputReflector_Athena;                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        InputReflectorButtonStyle;                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            MobileBackground;                                  // 0x0280(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetupBottomBarStyle();
	void Construct();
	void ExecuteUbergraph_BottomBarWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BottomBarWidget_C">();
	}
	static class UBottomBarWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBottomBarWidget_C>();
	}
};
static_assert(alignof(UBottomBarWidget_C) == 0x000008, "Wrong alignment on UBottomBarWidget_C");
static_assert(sizeof(UBottomBarWidget_C) == 0x000308, "Wrong size on UBottomBarWidget_C");
static_assert(offsetof(UBottomBarWidget_C, UberGraphFrame) == 0x000258, "Member 'UBottomBarWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBottomBarWidget_C, BorderShell) == 0x000260, "Member 'UBottomBarWidget_C::BorderShell' has a wrong offset!");
static_assert(offsetof(UBottomBarWidget_C, InputReflector) == 0x000268, "Member 'UBottomBarWidget_C::InputReflector' has a wrong offset!");
static_assert(offsetof(UBottomBarWidget_C, InputReflector_Athena) == 0x000270, "Member 'UBottomBarWidget_C::InputReflector_Athena' has a wrong offset!");
static_assert(offsetof(UBottomBarWidget_C, InputReflectorButtonStyle) == 0x000278, "Member 'UBottomBarWidget_C::InputReflectorButtonStyle' has a wrong offset!");
static_assert(offsetof(UBottomBarWidget_C, MobileBackground) == 0x000280, "Member 'UBottomBarWidget_C::MobileBackground' has a wrong offset!");

}

