#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ARDronePawn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ARDronePawn.BP_ARDronePawn_C
// 0x0058 (0x0478 - 0x0420)
class ABP_ARDronePawn_C final : public AARDronePawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   One080Plane;                                       // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          WindAudioEnabled;                                  // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AltitudeWindAudioComp;                             // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WindAudioAltMin;                                   // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WindAudioAltMax;                                   // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WindAudioVolMin;                                   // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WindAudioVolMax;                                   // 0x044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundWindMovementLoop;                             // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundWindAltitudeLoop;                             // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentAltitudeWindVolume;                         // 0x0460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0464(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        MovementWindAudioComp;                             // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentMovementWindVolume;                         // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ARDronePawn(int32 EntryPoint);
	void Update_Wind_Audio();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ReceivePossessed(class AController* NewController);
	void ReceiveUnpossessed(class AController* OldController);
	void SetWindAudioEnabled(bool Enabled);
	void GetWindVolumeFromAltitude(float Altitude, float* Volume);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ARDronePawn_C">();
	}
	static class ABP_ARDronePawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ARDronePawn_C>();
	}
};
static_assert(alignof(ABP_ARDronePawn_C) == 0x000008, "Wrong alignment on ABP_ARDronePawn_C");
static_assert(sizeof(ABP_ARDronePawn_C) == 0x000478, "Wrong size on ABP_ARDronePawn_C");
static_assert(offsetof(ABP_ARDronePawn_C, UberGraphFrame) == 0x000420, "Member 'ABP_ARDronePawn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ARDronePawn_C, One080Plane) == 0x000428, "Member 'ABP_ARDronePawn_C::One080Plane' has a wrong offset!");
static_assert(offsetof(ABP_ARDronePawn_C, WindAudioEnabled) == 0x000430, "Member 'ABP_ARDronePawn_C::WindAudioEnabled' has a wrong offset!");
static_assert(offsetof(ABP_ARDronePawn_C, AltitudeWindAudioComp) == 0x000438, "Member 'ABP_ARDronePawn_C::AltitudeWindAudioComp' has a wrong offset!");
static_assert(offsetof(ABP_ARDronePawn_C, WindAudioAltMin) == 0x000440, "Member 'ABP_ARDronePawn_C::WindAudioAltMin' has a wrong offset!");
static_assert(offsetof(ABP_ARDronePawn_C, WindAudioAltMax) == 0x000444, "Member 'ABP_ARDronePawn_C::WindAudioAltMax' has a wrong offset!");
static_assert(offsetof(ABP_ARDronePawn_C, WindAudioVolMin) == 0x000448, "Member 'ABP_ARDronePawn_C::WindAudioVolMin' has a wrong offset!");
static_assert(offsetof(ABP_ARDronePawn_C, WindAudioVolMax) == 0x00044C, "Member 'ABP_ARDronePawn_C::WindAudioVolMax' has a wrong offset!");
static_assert(offsetof(ABP_ARDronePawn_C, SoundWindMovementLoop) == 0x000450, "Member 'ABP_ARDronePawn_C::SoundWindMovementLoop' has a wrong offset!");
static_assert(offsetof(ABP_ARDronePawn_C, SoundWindAltitudeLoop) == 0x000458, "Member 'ABP_ARDronePawn_C::SoundWindAltitudeLoop' has a wrong offset!");
static_assert(offsetof(ABP_ARDronePawn_C, CurrentAltitudeWindVolume) == 0x000460, "Member 'ABP_ARDronePawn_C::CurrentAltitudeWindVolume' has a wrong offset!");
static_assert(offsetof(ABP_ARDronePawn_C, Speed) == 0x000464, "Member 'ABP_ARDronePawn_C::Speed' has a wrong offset!");
static_assert(offsetof(ABP_ARDronePawn_C, MovementWindAudioComp) == 0x000468, "Member 'ABP_ARDronePawn_C::MovementWindAudioComp' has a wrong offset!");
static_assert(offsetof(ABP_ARDronePawn_C, CurrentMovementWindVolume) == 0x000470, "Member 'ABP_ARDronePawn_C::CurrentMovementWindVolume' has a wrong offset!");

}

