#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CozyLodge_SelectablePresent_Tree

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_CozyLodge_SelectablePresent_Tree.BP_CozyLodge_SelectablePresent_Tree_C.HandleObjectSpecialInteraction
// 0x0010 (0x0010 - 0x0000)
struct BP_CozyLodge_SelectablePresent_Tree_C_HandleObjectSpecialInteraction final
{
public:
	struct FGameplayTag                           ActionTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CameraTag;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CozyLodge_SelectablePresent_Tree_C_HandleObjectSpecialInteraction) == 0x000004, "Wrong alignment on BP_CozyLodge_SelectablePresent_Tree_C_HandleObjectSpecialInteraction");
static_assert(sizeof(BP_CozyLodge_SelectablePresent_Tree_C_HandleObjectSpecialInteraction) == 0x000010, "Wrong size on BP_CozyLodge_SelectablePresent_Tree_C_HandleObjectSpecialInteraction");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_HandleObjectSpecialInteraction, ActionTag) == 0x000000, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_HandleObjectSpecialInteraction::ActionTag' has a wrong offset!");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_HandleObjectSpecialInteraction, CameraTag) == 0x000008, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_HandleObjectSpecialInteraction::CameraTag' has a wrong offset!");

// Function BP_CozyLodge_SelectablePresent_Tree.BP_CozyLodge_SelectablePresent_Tree_C.ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree
// 0x0068 (0x0068 - 0x0000)
struct BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetNodeTag_ReturnValue;                   // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_ActionTag;                            // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_CameraTag;                            // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGSC_DynamicLevelStreaming_C*>   CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0038(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGSC_DynamicLevelStreaming_C*           CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree) == 0x000008, "Wrong alignment on BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree");
static_assert(sizeof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree) == 0x000068, "Wrong size on BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree, EntryPoint) == 0x000000, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree, CallFunc_GetNodeTag_ReturnValue) == 0x000004, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree::CallFunc_GetNodeTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree, K2Node_Event_ActionTag) == 0x000018, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree::K2Node_Event_ActionTag' has a wrong offset!");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree, K2Node_Event_CameraTag) == 0x000020, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree::K2Node_Event_CameraTag' has a wrong offset!");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree, CallFunc_GetGameState_ReturnValue) == 0x000028, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000030, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000038, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x000048, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree, CallFunc_BooleanAND_ReturnValue) == 0x000058, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_CozyLodge_SelectablePresent_Tree_C_ExecuteUbergraph_BP_CozyLodge_SelectablePresent_Tree::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

