#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GalileoPlayerController

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_GalileoPlayerController.BP_GalileoPlayerController_C.ExecuteUbergraph_BP_GalileoPlayerController
// 0x0048 (0x0048 - 0x0000)
struct BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerPawn_Athena_Galileo_C*        K2Node_DynamicCast_AsBP_Player_Pawn_Athena_Galileo; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerPawn_Athena_Galileo_C*        K2Node_DynamicCast_AsBP_Player_Pawn_Athena_Galileo_1; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController) == 0x000008, "Wrong alignment on BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController");
static_assert(sizeof(BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController) == 0x000048, "Wrong size on BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController");
static_assert(offsetof(BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController, EntryPoint) == 0x000000, "Member 'BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController, K2Node_DynamicCast_AsBP_Player_Pawn_Athena_Galileo) == 0x000008, "Member 'BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController::K2Node_DynamicCast_AsBP_Player_Pawn_Athena_Galileo' has a wrong offset!");
static_assert(offsetof(BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController, K2Node_DynamicCast_AsBP_Player_Pawn_Athena_Galileo_1) == 0x000018, "Member 'BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController::K2Node_DynamicCast_AsBP_Player_Pawn_Athena_Galileo_1' has a wrong offset!");
static_assert(offsetof(BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000028, "Member 'BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000030, "Member 'BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000038, "Member 'BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000040, "Member 'BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController, CallFunc_HasAuthority_ReturnValue) == 0x000041, "Member 'BP_GalileoPlayerController_C_ExecuteUbergraph_BP_GalileoPlayerController::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_GalileoPlayerController.BP_GalileoPlayerController_C.SetBlackboardValues
// 0x0008 (0x0008 - 0x0000)
struct BP_GalileoPlayerController_C_SetBlackboardValues final
{
public:
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GalileoPlayerController_C_SetBlackboardValues) == 0x000008, "Wrong alignment on BP_GalileoPlayerController_C_SetBlackboardValues");
static_assert(sizeof(BP_GalileoPlayerController_C_SetBlackboardValues) == 0x000008, "Wrong size on BP_GalileoPlayerController_C_SetBlackboardValues");
static_assert(offsetof(BP_GalileoPlayerController_C_SetBlackboardValues, CallFunc_GetBlackboard_ReturnValue) == 0x000000, "Member 'BP_GalileoPlayerController_C_SetBlackboardValues::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");

}

