#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerPawn_Athena_Galileo

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PlayerPawn_Athena_Galileo.BP_PlayerPawn_Athena_Galileo_C.ExecuteUbergraph_BP_PlayerPawn_Athena_Galileo
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerPawn_Athena_Galileo_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Galileo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_Event_Pawn;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerPawn_Athena_Galileo_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Galileo) == 0x000008, "Wrong alignment on BP_PlayerPawn_Athena_Galileo_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Galileo");
static_assert(sizeof(BP_PlayerPawn_Athena_Galileo_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Galileo) == 0x000018, "Wrong size on BP_PlayerPawn_Athena_Galileo_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Galileo");
static_assert(offsetof(BP_PlayerPawn_Athena_Galileo_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Galileo, EntryPoint) == 0x000000, "Member 'BP_PlayerPawn_Athena_Galileo_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Galileo::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Galileo_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Galileo, K2Node_Event_Pawn) == 0x000008, "Member 'BP_PlayerPawn_Athena_Galileo_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Galileo::K2Node_Event_Pawn' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Galileo_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Galileo, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_PlayerPawn_Athena_Galileo_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Galileo::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_PlayerPawn_Athena_Galileo.BP_PlayerPawn_Athena_Galileo_C.OnCharacterCustomizationCompleted
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerPawn_Athena_Galileo_C_OnCharacterCustomizationCompleted final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerPawn_Athena_Galileo_C_OnCharacterCustomizationCompleted) == 0x000008, "Wrong alignment on BP_PlayerPawn_Athena_Galileo_C_OnCharacterCustomizationCompleted");
static_assert(sizeof(BP_PlayerPawn_Athena_Galileo_C_OnCharacterCustomizationCompleted) == 0x000008, "Wrong size on BP_PlayerPawn_Athena_Galileo_C_OnCharacterCustomizationCompleted");
static_assert(offsetof(BP_PlayerPawn_Athena_Galileo_C_OnCharacterCustomizationCompleted, Pawn) == 0x000000, "Member 'BP_PlayerPawn_Athena_Galileo_C_OnCharacterCustomizationCompleted::Pawn' has a wrong offset!");

// Function BP_PlayerPawn_Athena_Galileo.BP_PlayerPawn_Athena_Galileo_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerPawn_Athena_Galileo_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerPawn_Athena_Galileo_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PlayerPawn_Athena_Galileo_C_ReceiveTick");
static_assert(sizeof(BP_PlayerPawn_Athena_Galileo_C_ReceiveTick) == 0x000004, "Wrong size on BP_PlayerPawn_Athena_Galileo_C_ReceiveTick");
static_assert(offsetof(BP_PlayerPawn_Athena_Galileo_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PlayerPawn_Athena_Galileo_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PlayerPawn_Athena_Galileo.BP_PlayerPawn_Athena_Galileo_C.OnRep_IsPatrolling
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerPawn_Athena_Galileo_C_OnRep_IsPatrolling final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlayerAnimInstance*                K2Node_DynamicCast_AsFort_Player_Anim_Instance;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerPawn_Athena_Galileo_C_OnRep_IsPatrolling) == 0x000008, "Wrong alignment on BP_PlayerPawn_Athena_Galileo_C_OnRep_IsPatrolling");
static_assert(sizeof(BP_PlayerPawn_Athena_Galileo_C_OnRep_IsPatrolling) == 0x000018, "Wrong size on BP_PlayerPawn_Athena_Galileo_C_OnRep_IsPatrolling");
static_assert(offsetof(BP_PlayerPawn_Athena_Galileo_C_OnRep_IsPatrolling, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'BP_PlayerPawn_Athena_Galileo_C_OnRep_IsPatrolling::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Galileo_C_OnRep_IsPatrolling, K2Node_DynamicCast_AsFort_Player_Anim_Instance) == 0x000008, "Member 'BP_PlayerPawn_Athena_Galileo_C_OnRep_IsPatrolling::K2Node_DynamicCast_AsFort_Player_Anim_Instance' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Galileo_C_OnRep_IsPatrolling, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_PlayerPawn_Athena_Galileo_C_OnRep_IsPatrolling::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

