#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplayPC_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ReplayPC_Athena.BP_ReplayPC_Athena_C
// 0x00B0 (0x3560 - 0x34B0)
class ABP_ReplayPC_Athena_C final : public AFortReplaySpectatorAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x34B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<float, class USoundMix*>                 PlaybackRateMap;                                   // 0x34B8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         CurrentPlayRate;                                   // 0x3508(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFast;                                           // 0x350C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_350D[0x3];                                     // 0x350D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        SpeedupLoop;                                       // 0x3510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SlowdownLoop;                                      // 0x3518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHudVisible;                                     // 0x3520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3521[0x7];                                     // 0x3521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        ZoomOutLoop;                                       // 0x3528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ZoomInLoop;                                        // 0x3530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSkydivingAudioEnabled;                          // 0x3538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsTargetParachuting;                              // 0x3539(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsTargetSkydiving;                                // 0x353A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_353B[0x5];                                     // 0x353B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        SkydivingAudioLoop;                                // 0x3540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPaused;                                         // 0x3548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3549[0x7];                                     // 0x3549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CurrentSkydivingSound;                             // 0x3550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ReplayPC_Athena(int32 EntryPoint);
	void Looping_Audio_Update();
	void Handle_Parachute_Audio_State();
	void On_Pause_State_Changed(bool bPaused);
	void OnZoomInBegin();
	void OnZoomInEnd();
	void OnZoomOutBegin();
	void OnZoomOutEnd();
	void OnReplayHudVisibilityChanged(const EHudVisibilityState IsVisible);
	void _Speedup_Loops(float Playback_Multiplier);
	void OnNotifyNewPlaybackMultiplier(float NewMultiplier);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	class USoundBase* GetSkydivingSound();
	void SetSkydivingAudioEnabled(bool Enabled);
	void IsGameplayCamera(bool* IsGameplayCamera_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ReplayPC_Athena_C">();
	}
	static class ABP_ReplayPC_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ReplayPC_Athena_C>();
	}
};
static_assert(alignof(ABP_ReplayPC_Athena_C) == 0x000010, "Wrong alignment on ABP_ReplayPC_Athena_C");
static_assert(sizeof(ABP_ReplayPC_Athena_C) == 0x003560, "Wrong size on ABP_ReplayPC_Athena_C");
static_assert(offsetof(ABP_ReplayPC_Athena_C, UberGraphFrame) == 0x0034B0, "Member 'ABP_ReplayPC_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, PlaybackRateMap) == 0x0034B8, "Member 'ABP_ReplayPC_Athena_C::PlaybackRateMap' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, CurrentPlayRate) == 0x003508, "Member 'ABP_ReplayPC_Athena_C::CurrentPlayRate' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsFast) == 0x00350C, "Member 'ABP_ReplayPC_Athena_C::bIsFast' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, SpeedupLoop) == 0x003510, "Member 'ABP_ReplayPC_Athena_C::SpeedupLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, SlowdownLoop) == 0x003518, "Member 'ABP_ReplayPC_Athena_C::SlowdownLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsHudVisible) == 0x003520, "Member 'ABP_ReplayPC_Athena_C::bIsHudVisible' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, ZoomOutLoop) == 0x003528, "Member 'ABP_ReplayPC_Athena_C::ZoomOutLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, ZoomInLoop) == 0x003530, "Member 'ABP_ReplayPC_Athena_C::ZoomInLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsSkydivingAudioEnabled) == 0x003538, "Member 'ABP_ReplayPC_Athena_C::bIsSkydivingAudioEnabled' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsTargetParachuting) == 0x003539, "Member 'ABP_ReplayPC_Athena_C::bIsTargetParachuting' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsTargetSkydiving) == 0x00353A, "Member 'ABP_ReplayPC_Athena_C::bIsTargetSkydiving' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, SkydivingAudioLoop) == 0x003540, "Member 'ABP_ReplayPC_Athena_C::SkydivingAudioLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsPaused) == 0x003548, "Member 'ABP_ReplayPC_Athena_C::bIsPaused' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, CurrentSkydivingSound) == 0x003550, "Member 'ABP_ReplayPC_Athena_C::CurrentSkydivingSound' has a wrong offset!");

}

