#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bucket_Old_Gadget_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Bucket_Old_Gadget_Skeleton_AnimBP.Bucket_Old_Gadget_Skeleton_AnimBP_C
// 0x0760 (0x0B50 - 0x03F0)
class UBucket_Old_Gadget_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_100A68464EFD27B24AC5D39A7070E7BB; // 0x0400(0x0560)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_D9CDABBC42AEDAD1965D0BBA81A7D90E; // 0x0960(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7B76CF1B466C82BF33D73CA3A143B952; // 0x0980(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput_5665FF0E4A879C97D18D2881B5897A6D; // 0x09A0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3EE1C4B34CE43804012628A05F924445; // 0x0A10(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_DEC1B9EF40E29A24759C37BAFB571A61; // 0x0A40(0x0108)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Bucket_Old_Gadget_Skeleton_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bucket_Old_Gadget_Skeleton_AnimBP_C">();
	}
	static class UBucket_Old_Gadget_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBucket_Old_Gadget_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(UBucket_Old_Gadget_Skeleton_AnimBP_C) == 0x000010, "Wrong alignment on UBucket_Old_Gadget_Skeleton_AnimBP_C");
static_assert(sizeof(UBucket_Old_Gadget_Skeleton_AnimBP_C) == 0x000B50, "Wrong size on UBucket_Old_Gadget_Skeleton_AnimBP_C");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, UberGraphFrame) == 0x0003F0, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_RigidBody_100A68464EFD27B24AC5D39A7070E7BB) == 0x000400, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_RigidBody_100A68464EFD27B24AC5D39A7070E7BB' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_LocalToComponentSpace_D9CDABBC42AEDAD1965D0BBA81A7D90E) == 0x000960, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_LocalToComponentSpace_D9CDABBC42AEDAD1965D0BBA81A7D90E' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_7B76CF1B466C82BF33D73CA3A143B952) == 0x000980, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_7B76CF1B466C82BF33D73CA3A143B952' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_SubInput_5665FF0E4A879C97D18D2881B5897A6D) == 0x0009A0, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_SubInput_5665FF0E4A879C97D18D2881B5897A6D' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_Root_3EE1C4B34CE43804012628A05F924445) == 0x000A10, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_Root_3EE1C4B34CE43804012628A05F924445' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_ModifyBone_DEC1B9EF40E29A24759C37BAFB571A61) == 0x000A40, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_ModifyBone_DEC1B9EF40E29A24759C37BAFB571A61' has a wrong offset!");

}

