#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuiltInEmotePopUP

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BuiltInEmotePopUP.BuiltInEmotePopUP_C
// 0x0020 (0x0250 - 0x0230)
class UBuiltInEmotePopUP_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       FadeAnim;                                          // 0x0230(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroAnim;                                         // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_ItemRarity;                                 // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_ItemPrompt;                               // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BuiltInEmotePopUP_C">();
	}
	static class UBuiltInEmotePopUP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuiltInEmotePopUP_C>();
	}
};
static_assert(alignof(UBuiltInEmotePopUP_C) == 0x000008, "Wrong alignment on UBuiltInEmotePopUP_C");
static_assert(sizeof(UBuiltInEmotePopUP_C) == 0x000250, "Wrong size on UBuiltInEmotePopUP_C");
static_assert(offsetof(UBuiltInEmotePopUP_C, FadeAnim) == 0x000230, "Member 'UBuiltInEmotePopUP_C::FadeAnim' has a wrong offset!");
static_assert(offsetof(UBuiltInEmotePopUP_C, IntroAnim) == 0x000238, "Member 'UBuiltInEmotePopUP_C::IntroAnim' has a wrong offset!");
static_assert(offsetof(UBuiltInEmotePopUP_C, Border_ItemRarity) == 0x000240, "Member 'UBuiltInEmotePopUP_C::Border_ItemRarity' has a wrong offset!");
static_assert(offsetof(UBuiltInEmotePopUP_C, RichText_ItemPrompt) == 0x000248, "Member 'UBuiltInEmotePopUP_C::RichText_ItemPrompt' has a wrong offset!");

}

