#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeListEntry_SpecialOffer

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeListEntry_SpecialOffer.ChallengeListEntry_SpecialOffer_C
// 0x0030 (0x02D8 - 0x02A8)
class UChallengeListEntry_SpecialOffer_C final : public UAthenaChallengeListEntry_StoreOffer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AxesOffer;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BoxActionWidgetWrapper;                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Smoke;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void ExecuteUbergraph_ChallengeListEntry_SpecialOffer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeListEntry_SpecialOffer_C">();
	}
	static class UChallengeListEntry_SpecialOffer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeListEntry_SpecialOffer_C>();
	}
};
static_assert(alignof(UChallengeListEntry_SpecialOffer_C) == 0x000008, "Wrong alignment on UChallengeListEntry_SpecialOffer_C");
static_assert(sizeof(UChallengeListEntry_SpecialOffer_C) == 0x0002D8, "Wrong size on UChallengeListEntry_SpecialOffer_C");
static_assert(offsetof(UChallengeListEntry_SpecialOffer_C, UberGraphFrame) == 0x0002A8, "Member 'UChallengeListEntry_SpecialOffer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_SpecialOffer_C, OnHover) == 0x0002B0, "Member 'UChallengeListEntry_SpecialOffer_C::OnHover' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_SpecialOffer_C, AxesOffer) == 0x0002B8, "Member 'UChallengeListEntry_SpecialOffer_C::AxesOffer' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_SpecialOffer_C, Border) == 0x0002C0, "Member 'UChallengeListEntry_SpecialOffer_C::Border' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_SpecialOffer_C, BoxActionWidgetWrapper) == 0x0002C8, "Member 'UChallengeListEntry_SpecialOffer_C::BoxActionWidgetWrapper' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_SpecialOffer_C, Smoke) == 0x0002D0, "Member 'UChallengeListEntry_SpecialOffer_C::Smoke' has a wrong offset!");

}

