#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeCountdown

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeCountdown.ChallengeCountdown_C
// 0x0040 (0x0358 - 0x0318)
class UChallengeCountdown_C final : public UAthenaChallengeCountdownDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Clock;                                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PaddingHB;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RedBoxBorder;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_TimeRemainingTag;                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              TextScale;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TransformOvr;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsLargeDisplay;                                    // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsMinimalDisplay;                                 // 0x0351(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void OnChallengeSet(const struct FTimerDisplayData& DisplayStyle);
	void ExecuteUbergraph_ChallengeCountdown(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeCountdown_C">();
	}
	static class UChallengeCountdown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeCountdown_C>();
	}
};
static_assert(alignof(UChallengeCountdown_C) == 0x000008, "Wrong alignment on UChallengeCountdown_C");
static_assert(sizeof(UChallengeCountdown_C) == 0x000358, "Wrong size on UChallengeCountdown_C");
static_assert(offsetof(UChallengeCountdown_C, UberGraphFrame) == 0x000318, "Member 'UChallengeCountdown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeCountdown_C, Clock) == 0x000320, "Member 'UChallengeCountdown_C::Clock' has a wrong offset!");
static_assert(offsetof(UChallengeCountdown_C, PaddingHB) == 0x000328, "Member 'UChallengeCountdown_C::PaddingHB' has a wrong offset!");
static_assert(offsetof(UChallengeCountdown_C, RedBoxBorder) == 0x000330, "Member 'UChallengeCountdown_C::RedBoxBorder' has a wrong offset!");
static_assert(offsetof(UChallengeCountdown_C, Text_TimeRemainingTag) == 0x000338, "Member 'UChallengeCountdown_C::Text_TimeRemainingTag' has a wrong offset!");
static_assert(offsetof(UChallengeCountdown_C, TextScale) == 0x000340, "Member 'UChallengeCountdown_C::TextScale' has a wrong offset!");
static_assert(offsetof(UChallengeCountdown_C, TransformOvr) == 0x000348, "Member 'UChallengeCountdown_C::TransformOvr' has a wrong offset!");
static_assert(offsetof(UChallengeCountdown_C, IsLargeDisplay) == 0x000350, "Member 'UChallengeCountdown_C::IsLargeDisplay' has a wrong offset!");
static_assert(offsetof(UChallengeCountdown_C, bIsMinimalDisplay) == 0x000351, "Member 'UChallengeCountdown_C::bIsMinimalDisplay' has a wrong offset!");

}

