#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatWidget

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChatWidget.ChatWidget_C
// 0x0070 (0x04B8 - 0x0448)
class UChatWidget_C final : public UFortChatPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0448(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      ConsoleChatShortcut;                               // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        DEPRECATED_CursorModeSwitcher;                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HudContentHBox;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindWidget;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CloseUserListAction;                               // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    OpenUserListAction;                                // 0x0480(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    CurrentUserListAction;                             // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bEnteringChat;                                     // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool EnteredChat)> OnEnteredChat;                                     // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void HandlePreShowConfirmationDialog(class UFortUIManagerWidget_NUI* Source, struct FFortDialogDescription_NUI& DialogDescription);
	void HandleControllerSendMessagePressed(bool* Handled);
	void HandleRightTabPressed(bool* Handled);
	void HandleLeftTabPressed(bool* Handled);
	void HandleExitPressed(bool* Handled);
	void InitializeChat();
	void BindDelegates();
	void HandleCursorModeChanged(bool bEnabled, class FName ActionName, class UUserWidget* Widget);
	void HandleShowChatWindow(EFortUIFeature Feature, EFortUIFeatureState FeatureState, EFortUIFeatureStateReason FeatureStateReason);
	void HandeChatEnteredEvent(bool bEnteringChat_0);
	void UpdateChatUserListIcon(bool Open);
	void Set_Chat_Shortcut_Visibility(ESlateVisibility New_Visibility);
	void Set_Chat_Visibility(ESlateVisibility New_Visibility);
	void Construct();
	void BndEvt__FortChat_K2Node_ComponentBoundEvent_0_OnUserListChangedDelegate__DelegateSignature(bool bOpen);
	void BndEvt__FortChat_K2Node_ComponentBoundEvent_66_OnChatEnteredDelegate__DelegateSignature(bool bEnteringChat_0);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Destruct();
	void HandleInputMethodChanged(ECommonInputType InputType);
	void ExecuteUbergraph_ChatWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChatWidget_C">();
	}
	static class UChatWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatWidget_C>();
	}
};
static_assert(alignof(UChatWidget_C) == 0x000008, "Wrong alignment on UChatWidget_C");
static_assert(sizeof(UChatWidget_C) == 0x0004B8, "Wrong size on UChatWidget_C");
static_assert(offsetof(UChatWidget_C, UberGraphFrame) == 0x000448, "Member 'UChatWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, ConsoleChatShortcut) == 0x000450, "Member 'UChatWidget_C::ConsoleChatShortcut' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, DEPRECATED_CursorModeSwitcher) == 0x000458, "Member 'UChatWidget_C::DEPRECATED_CursorModeSwitcher' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, HudContentHBox) == 0x000460, "Member 'UChatWidget_C::HudContentHBox' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, KeybindWidget) == 0x000468, "Member 'UChatWidget_C::KeybindWidget' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, CloseUserListAction) == 0x000470, "Member 'UChatWidget_C::CloseUserListAction' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, OpenUserListAction) == 0x000480, "Member 'UChatWidget_C::OpenUserListAction' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, CurrentUserListAction) == 0x000490, "Member 'UChatWidget_C::CurrentUserListAction' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, bEnteringChat) == 0x0004A0, "Member 'UChatWidget_C::bEnteringChat' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, OnEnteredChat) == 0x0004A8, "Member 'UChatWidget_C::OnEnteredChat' has a wrong offset!");

}

