#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComModalTutorialPopup

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ComModalTutorialPopup.ComModalTutorialPopup_C
// 0x00A8 (0x0550 - 0x04A8)
class UComModalTutorialPopup_C final : public UFortCommunityVotingTutorialPopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TutorialSlide3Out;                                 // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TutorialSlide2Out;                                 // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TutorialSlide1Out;                                 // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TutorialSlide3In;                                  // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TutorialSlide2In;                                  // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TutorialSlide1In;                                  // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_TapToCloseZone;                             // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircleArrowButtonComTutorial_C*        CircleArrowButtonComTutorial_Next;                 // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircleArrowButtonComTutorial_C*        CircleArrowButtonComTutorial_Previous;             // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 comTutorialImage_1;                                // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 comTutorialImage_4;                                // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Comtutorialtext1;                                  // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Comtutorialtext2;                                  // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Comtutorialtext3;                                  // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Darken;                                            // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DoT_1;                                             // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DoT_2;                                             // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DoT_3;                                             // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 flametuto;                                         // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FEventReply TapToClose(const struct FGeometry& MyGeometry, struct FPointerEvent& Mouse_Event);
	void PlayInSlideAnimation(int32 Index_0);
	void PlayOutSlideAnimation(int32 Index_0);
	void Construct();
	void ExecuteUbergraph_ComModalTutorialPopup(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComModalTutorialPopup_C">();
	}
	static class UComModalTutorialPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComModalTutorialPopup_C>();
	}
};
static_assert(alignof(UComModalTutorialPopup_C) == 0x000008, "Wrong alignment on UComModalTutorialPopup_C");
static_assert(sizeof(UComModalTutorialPopup_C) == 0x000550, "Wrong size on UComModalTutorialPopup_C");
static_assert(offsetof(UComModalTutorialPopup_C, UberGraphFrame) == 0x0004A8, "Member 'UComModalTutorialPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, TutorialSlide3Out) == 0x0004B0, "Member 'UComModalTutorialPopup_C::TutorialSlide3Out' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, TutorialSlide2Out) == 0x0004B8, "Member 'UComModalTutorialPopup_C::TutorialSlide2Out' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, TutorialSlide1Out) == 0x0004C0, "Member 'UComModalTutorialPopup_C::TutorialSlide1Out' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, FadeIn) == 0x0004C8, "Member 'UComModalTutorialPopup_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, TutorialSlide3In) == 0x0004D0, "Member 'UComModalTutorialPopup_C::TutorialSlide3In' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, TutorialSlide2In) == 0x0004D8, "Member 'UComModalTutorialPopup_C::TutorialSlide2In' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, TutorialSlide1In) == 0x0004E0, "Member 'UComModalTutorialPopup_C::TutorialSlide1In' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, Border_TapToCloseZone) == 0x0004E8, "Member 'UComModalTutorialPopup_C::Border_TapToCloseZone' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, CircleArrowButtonComTutorial_Next) == 0x0004F0, "Member 'UComModalTutorialPopup_C::CircleArrowButtonComTutorial_Next' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, CircleArrowButtonComTutorial_Previous) == 0x0004F8, "Member 'UComModalTutorialPopup_C::CircleArrowButtonComTutorial_Previous' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, comTutorialImage_1) == 0x000500, "Member 'UComModalTutorialPopup_C::comTutorialImage_1' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, comTutorialImage_4) == 0x000508, "Member 'UComModalTutorialPopup_C::comTutorialImage_4' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, Comtutorialtext1) == 0x000510, "Member 'UComModalTutorialPopup_C::Comtutorialtext1' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, Comtutorialtext2) == 0x000518, "Member 'UComModalTutorialPopup_C::Comtutorialtext2' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, Comtutorialtext3) == 0x000520, "Member 'UComModalTutorialPopup_C::Comtutorialtext3' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, Darken) == 0x000528, "Member 'UComModalTutorialPopup_C::Darken' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, DoT_1) == 0x000530, "Member 'UComModalTutorialPopup_C::DoT_1' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, DoT_2) == 0x000538, "Member 'UComModalTutorialPopup_C::DoT_2' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, DoT_3) == 0x000540, "Member 'UComModalTutorialPopup_C::DoT_3' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, flametuto) == 0x000548, "Member 'UComModalTutorialPopup_C::flametuto' has a wrong offset!");

}

