#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComOptionTileCandidate

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ComOptionTileCandidate.ComOptionTileCandidate_C
// 0x0100 (0x0350 - 0x0250)
class UComOptionTileCandidate_C final : public UFortCommunityVotingTileCandidate
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CallToAction;                                      // 0x0258(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ComDivider_option;                                 // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComRightImageBackground;                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VFXVOTING;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_StrikeThrough;                                 // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_CarouselTimerProgressBar;                      // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            Carousel_NextItemImage;                            // 0x0288(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         CarouselLoopTimeRemaining;                         // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CarouselLoopTimer;                                 // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              LargeSoftImage;                                    // 0x0318(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UTexture2D*                             Carousel_NextLargeTexture;                         // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    BattleStarTemplate;                                // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void AnimateImage();
	void Construct();
	void ExecuteUbergraph_ComOptionTileCandidate(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComOptionTileCandidate_C">();
	}
	static class UComOptionTileCandidate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComOptionTileCandidate_C>();
	}
};
static_assert(alignof(UComOptionTileCandidate_C) == 0x000008, "Wrong alignment on UComOptionTileCandidate_C");
static_assert(sizeof(UComOptionTileCandidate_C) == 0x000350, "Wrong size on UComOptionTileCandidate_C");
static_assert(offsetof(UComOptionTileCandidate_C, UberGraphFrame) == 0x000250, "Member 'UComOptionTileCandidate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComOptionTileCandidate_C, CallToAction) == 0x000258, "Member 'UComOptionTileCandidate_C::CallToAction' has a wrong offset!");
static_assert(offsetof(UComOptionTileCandidate_C, ComDivider_option) == 0x000260, "Member 'UComOptionTileCandidate_C::ComDivider_option' has a wrong offset!");
static_assert(offsetof(UComOptionTileCandidate_C, ComRightImageBackground) == 0x000268, "Member 'UComOptionTileCandidate_C::ComRightImageBackground' has a wrong offset!");
static_assert(offsetof(UComOptionTileCandidate_C, VFXVOTING) == 0x000270, "Member 'UComOptionTileCandidate_C::VFXVOTING' has a wrong offset!");
static_assert(offsetof(UComOptionTileCandidate_C, MID_StrikeThrough) == 0x000278, "Member 'UComOptionTileCandidate_C::MID_StrikeThrough' has a wrong offset!");
static_assert(offsetof(UComOptionTileCandidate_C, MID_CarouselTimerProgressBar) == 0x000280, "Member 'UComOptionTileCandidate_C::MID_CarouselTimerProgressBar' has a wrong offset!");
static_assert(offsetof(UComOptionTileCandidate_C, Carousel_NextItemImage) == 0x000288, "Member 'UComOptionTileCandidate_C::Carousel_NextItemImage' has a wrong offset!");
static_assert(offsetof(UComOptionTileCandidate_C, CarouselLoopTimeRemaining) == 0x000310, "Member 'UComOptionTileCandidate_C::CarouselLoopTimeRemaining' has a wrong offset!");
static_assert(offsetof(UComOptionTileCandidate_C, CarouselLoopTimer) == 0x000314, "Member 'UComOptionTileCandidate_C::CarouselLoopTimer' has a wrong offset!");
static_assert(offsetof(UComOptionTileCandidate_C, LargeSoftImage) == 0x000318, "Member 'UComOptionTileCandidate_C::LargeSoftImage' has a wrong offset!");
static_assert(offsetof(UComOptionTileCandidate_C, Carousel_NextLargeTexture) == 0x000340, "Member 'UComOptionTileCandidate_C::Carousel_NextLargeTexture' has a wrong offset!");
static_assert(offsetof(UComOptionTileCandidate_C, BattleStarTemplate) == 0x000348, "Member 'UComOptionTileCandidate_C::BattleStarTemplate' has a wrong offset!");

}

