#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComRevealScreen_Popup

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ComRevealScreen_Popup.ComRevealScreen_Popup_C
// 0x0080 (0x0548 - 0x04C8)
class UComRevealScreen_Popup_C final : public UFortCommunityVotingRevealScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PopIn;                                             // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reveal;                                            // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_TapToCloseZone;                             // 0x04E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UcomLogoTitle_C*                        comLogoTitle;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComPopUpBgarrows;                                  // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 comPopUpWhiteBorder;                               // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 comPopUpWhiteBorder_1;                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 comRevealFlashFullScreen;                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Currency1ItemImage2;                               // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Darken_1;                                          // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 footerimage;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 footerimage_2;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Reveal_screenBackground;                           // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice1;                            // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FEventReply TapToClose(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void StartFinalAnimation();
	void StartFadeOutScreen(float Delay);
	void Construct();
	void ExecuteUbergraph_ComRevealScreen_Popup(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComRevealScreen_Popup_C">();
	}
	static class UComRevealScreen_Popup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComRevealScreen_Popup_C>();
	}
};
static_assert(alignof(UComRevealScreen_Popup_C) == 0x000008, "Wrong alignment on UComRevealScreen_Popup_C");
static_assert(sizeof(UComRevealScreen_Popup_C) == 0x000548, "Wrong size on UComRevealScreen_Popup_C");
static_assert(offsetof(UComRevealScreen_Popup_C, UberGraphFrame) == 0x0004C8, "Member 'UComRevealScreen_Popup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, PopIn) == 0x0004D0, "Member 'UComRevealScreen_Popup_C::PopIn' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, FadeOut) == 0x0004D8, "Member 'UComRevealScreen_Popup_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, Reveal) == 0x0004E0, "Member 'UComRevealScreen_Popup_C::Reveal' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, Border_TapToCloseZone) == 0x0004E8, "Member 'UComRevealScreen_Popup_C::Border_TapToCloseZone' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, comLogoTitle) == 0x0004F0, "Member 'UComRevealScreen_Popup_C::comLogoTitle' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, ComPopUpBgarrows) == 0x0004F8, "Member 'UComRevealScreen_Popup_C::ComPopUpBgarrows' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, comPopUpWhiteBorder) == 0x000500, "Member 'UComRevealScreen_Popup_C::comPopUpWhiteBorder' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, comPopUpWhiteBorder_1) == 0x000508, "Member 'UComRevealScreen_Popup_C::comPopUpWhiteBorder_1' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, comRevealFlashFullScreen) == 0x000510, "Member 'UComRevealScreen_Popup_C::comRevealFlashFullScreen' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, Currency1ItemImage2) == 0x000518, "Member 'UComRevealScreen_Popup_C::Currency1ItemImage2' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, Darken_1) == 0x000520, "Member 'UComRevealScreen_Popup_C::Darken_1' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, footerimage) == 0x000528, "Member 'UComRevealScreen_Popup_C::footerimage' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, footerimage_2) == 0x000530, "Member 'UComRevealScreen_Popup_C::footerimage_2' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, Reveal_screenBackground) == 0x000538, "Member 'UComRevealScreen_Popup_C::Reveal_screenBackground' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, TextOfferDisplayPrice1) == 0x000540, "Member 'UComRevealScreen_Popup_C::TextOfferDisplayPrice1' has a wrong offset!");

}

