#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComScreenTile

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ComScreenTile.ComScreenTile_C
// 0x0108 (0x0D08 - 0x0C00)
class UComScreenTile_C final : public UFortCommunityVotingTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CallToAction;                                      // 0x0C08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CarouselTransition;                                // 0x0C10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0C18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UcomLogoTitle_C*                        comLogoTitle;                                      // 0x0C20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 poUpHeader;                                        // 0x0C28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_StrikeThrough;                                 // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_CarouselTimerProgressBar;                      // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            Carousel_NextItemImage;                            // 0x0C40(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         CarouselLoopTimeRemaining;                         // 0x0CC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CarouselLoopTimer;                                 // 0x0CCC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              LargeSoftImage;                                    // 0x0CD0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UTexture2D*                             Carousel_NextLargeTexture;                         // 0x0CF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    BattleStarTemplate;                                // 0x0D00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void ExecuteUbergraph_ComScreenTile(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComScreenTile_C">();
	}
	static class UComScreenTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComScreenTile_C>();
	}
};
static_assert(alignof(UComScreenTile_C) == 0x000008, "Wrong alignment on UComScreenTile_C");
static_assert(sizeof(UComScreenTile_C) == 0x000D08, "Wrong size on UComScreenTile_C");
static_assert(offsetof(UComScreenTile_C, UberGraphFrame) == 0x000C00, "Member 'UComScreenTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, CallToAction) == 0x000C08, "Member 'UComScreenTile_C::CallToAction' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, CarouselTransition) == 0x000C10, "Member 'UComScreenTile_C::CarouselTransition' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, Hover) == 0x000C18, "Member 'UComScreenTile_C::Hover' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, comLogoTitle) == 0x000C20, "Member 'UComScreenTile_C::comLogoTitle' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, poUpHeader) == 0x000C28, "Member 'UComScreenTile_C::poUpHeader' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, MID_StrikeThrough) == 0x000C30, "Member 'UComScreenTile_C::MID_StrikeThrough' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, MID_CarouselTimerProgressBar) == 0x000C38, "Member 'UComScreenTile_C::MID_CarouselTimerProgressBar' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, Carousel_NextItemImage) == 0x000C40, "Member 'UComScreenTile_C::Carousel_NextItemImage' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, CarouselLoopTimeRemaining) == 0x000CC8, "Member 'UComScreenTile_C::CarouselLoopTimeRemaining' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, CarouselLoopTimer) == 0x000CCC, "Member 'UComScreenTile_C::CarouselLoopTimer' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, LargeSoftImage) == 0x000CD0, "Member 'UComScreenTile_C::LargeSoftImage' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, Carousel_NextLargeTexture) == 0x000CF8, "Member 'UComScreenTile_C::Carousel_NextLargeTexture' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, BattleStarTemplate) == 0x000D00, "Member 'UComScreenTile_C::BattleStarTemplate' has a wrong offset!");

}

