#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComScreen

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ComScreen.ComScreen_C
// 0x0040 (0x0520 - 0x04E0)
class UComScreen_C final : public UFortCommunityVotingScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade;                                              // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CloseIcon;                                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComBgImage;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UcomLogoTitle_C*                        comLogoTitle;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 footerimage;                                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         MobileCloseButton;                                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayCloseButton;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void FadeOutScreen();
	void Construct();
	void ExecuteUbergraph_ComScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComScreen_C">();
	}
	static class UComScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComScreen_C>();
	}
};
static_assert(alignof(UComScreen_C) == 0x000008, "Wrong alignment on UComScreen_C");
static_assert(sizeof(UComScreen_C) == 0x000520, "Wrong size on UComScreen_C");
static_assert(offsetof(UComScreen_C, UberGraphFrame) == 0x0004E0, "Member 'UComScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComScreen_C, Fade) == 0x0004E8, "Member 'UComScreen_C::Fade' has a wrong offset!");
static_assert(offsetof(UComScreen_C, CloseIcon) == 0x0004F0, "Member 'UComScreen_C::CloseIcon' has a wrong offset!");
static_assert(offsetof(UComScreen_C, ComBgImage) == 0x0004F8, "Member 'UComScreen_C::ComBgImage' has a wrong offset!");
static_assert(offsetof(UComScreen_C, comLogoTitle) == 0x000500, "Member 'UComScreen_C::comLogoTitle' has a wrong offset!");
static_assert(offsetof(UComScreen_C, footerimage) == 0x000508, "Member 'UComScreen_C::footerimage' has a wrong offset!");
static_assert(offsetof(UComScreen_C, MobileCloseButton) == 0x000510, "Member 'UComScreen_C::MobileCloseButton' has a wrong offset!");
static_assert(offsetof(UComScreen_C, OverlayCloseButton) == 0x000518, "Member 'UComScreen_C::OverlayCloseButton' has a wrong offset!");

}

