#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControllerActionsMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ControllerActionsMenu.ControllerActionsMenu_C
// 0x0018 (0x0438 - 0x0420)
class UControllerActionsMenu_C final : public UCommonPopupMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_86;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       DynamicEntryBox_77;                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_ControllerActionsMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ControllerActionsMenu_C">();
	}
	static class UControllerActionsMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControllerActionsMenu_C>();
	}
};
static_assert(alignof(UControllerActionsMenu_C) == 0x000008, "Wrong alignment on UControllerActionsMenu_C");
static_assert(sizeof(UControllerActionsMenu_C) == 0x000438, "Wrong size on UControllerActionsMenu_C");
static_assert(offsetof(UControllerActionsMenu_C, UberGraphFrame) == 0x000420, "Member 'UControllerActionsMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UControllerActionsMenu_C, Button_86) == 0x000428, "Member 'UControllerActionsMenu_C::Button_86' has a wrong offset!");
static_assert(offsetof(UControllerActionsMenu_C, DynamicEntryBox_77) == 0x000430, "Member 'UControllerActionsMenu_C::DynamicEntryBox_77' has a wrong offset!");

}

