#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_CarminePack

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_CarminePack.DA_CarminePack_C
// 0x00A0 (0x0B60 - 0x0AC0)
class ADA_CarminePack_C final : public AFortCustomizableAbilityDecoTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TimePressed;                                       // 0x0AC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PunchPicker;                                       // 0x0ACC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          hasLandedAfterBeam;                                // 0x0AD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD1[0x7];                                      // 0x0AD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Carmine_Ability_Tags;                              // 0x0AD8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FGameplayTag>                   StoneTags;                                         // 0x0AF8(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, RepNotify)
	TArray<struct FGameplayTag>                   GemTags;                                           // 0x0B08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         int_0;                                             // 0x0B18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1C[0x4];                                      // 0x0B1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  SkydiveCue;                                        // 0x0B20(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TrailsCue;                                         // 0x0B40(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_DA_CarminePack(int32 EntryPoint);
	void BindPartchanged();
	void BPPressSecondaryFire(class AFortDecoHelper* FortDecoHelper);
	void BPPressTrigger(class AFortDecoHelper* FortDecoHelper);
	void Landed(const struct FHitResult& Hit);
	void OnRep_StoneTags();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DA_CarminePack_C">();
	}
	static class ADA_CarminePack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADA_CarminePack_C>();
	}
};
static_assert(alignof(ADA_CarminePack_C) == 0x000008, "Wrong alignment on ADA_CarminePack_C");
static_assert(sizeof(ADA_CarminePack_C) == 0x000B60, "Wrong size on ADA_CarminePack_C");
static_assert(offsetof(ADA_CarminePack_C, UberGraphFrame) == 0x000AC0, "Member 'ADA_CarminePack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, TimePressed) == 0x000AC8, "Member 'ADA_CarminePack_C::TimePressed' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, PunchPicker) == 0x000ACC, "Member 'ADA_CarminePack_C::PunchPicker' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, hasLandedAfterBeam) == 0x000AD0, "Member 'ADA_CarminePack_C::hasLandedAfterBeam' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, Carmine_Ability_Tags) == 0x000AD8, "Member 'ADA_CarminePack_C::Carmine_Ability_Tags' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, StoneTags) == 0x000AF8, "Member 'ADA_CarminePack_C::StoneTags' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, GemTags) == 0x000B08, "Member 'ADA_CarminePack_C::GemTags' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, int_0) == 0x000B18, "Member 'ADA_CarminePack_C::int_0' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, SkydiveCue) == 0x000B20, "Member 'ADA_CarminePack_C::SkydiveCue' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, TrailsCue) == 0x000B40, "Member 'ADA_CarminePack_C::TrailsCue' has a wrong offset!");

}

