#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBNO_Carried

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass DBNO_Carried.DBNO_Carried_C
// 0x0B30 (0xBD80 - 0xB250)
class UDBNO_Carried_C final : public UFortPlayerAnimInstance_DBNOCarried
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0xB250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_6FDF76E049A24B1EF9D7DEBBD91751CF; // 0xB258(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_647109C14F48E941AEF9E486BCFFCB5B; // 0xB288(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_59E069244645BEF22808AB9196186F3F; // 0xB2A8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_32956B0E479193012ACF3FB15ECAFEE6; // 0xB3B0(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_80446D5E4D39FC4DB897698A65CD29AC; // 0xB4B8(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_56B19EE040BEEBC25D674F8DC99831B9; // 0xB530(0x00C8)()
	uint8                                         Pad_B5F8[0x8];                                     // 0xB5F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_A2B587A34E6D45FD2755F6A163B2A7AD; // 0xB600(0x01E0)()
	EFortPlayerAnimBodyType                       __CustomProperty_my_animbodytype_BC9172D64300E6A13C48509FE2988A40; // 0xB7E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomGender                             __CustomProperty_my_gender_BC9172D64300E6A13C48509FE2988A40; // 0xB7E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B7E2[0x6];                                     // 0xB7E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance_BC9172D64300E6A13C48509FE2988A40; // 0xB7E8(0x0090)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2362F79B4764FBA8C8FEEDA5DC88C3B1; // 0xB878(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AC1F897843DFD7A8178B8A82E3A790EE; // 0xB898(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2DF19C19483B180CCD9B0395F0443067; // 0xB8C0(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_78D4698F4DBD0C20473F7A9407EBB46C; // 0xB8E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A08B893F416A2C075FC4E584C74BAC5C; // 0xB930(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_339D53304C96E6E9CA54849FD42463D2; // 0xB960(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2845F0614F1F506F5C75FEB6DB44688C; // 0xB9D8(0x0030)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_F7E4CA4748A4826364AE6EAADE5CBA3C; // 0xBA08(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_0DF022F34E2D19939A036B970D6F6AFA; // 0xBA50(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_928ECAB14B37D35EE66BE6A15B810F70; // 0xBA80(0x00B0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_AA9C546E4B1C5BEF0332B08ECB6BFC83; // 0xBB30(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_DB53A2DF4CAE9120C146E49AC957D990; // 0xBBF8(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_88EB1D724EB384A84A32F184D445B4B9; // 0xBCB0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_0634F0B8457CE9932959C29729FE76F9; // 0xBCD8(0x0028)()
	bool                                          Carried;                                           // 0xBD00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD01[0x7];                                     // 0xBD01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   CarrierPawn;                                       // 0xBD08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlayerAnimInstance*                CarrierAnimBP;                                     // 0xBD10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LHandIKLocation;                                   // 0xBD18(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LHandIKRotation;                                   // 0xBD24(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                TempAttachLocation;                                // 0xBD30(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TempAttachRotation;                                // 0xBD3C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         SubAnimPhysicsWeight;                              // 0xBD48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBeingDropped;                                    // 0xBD4C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD4D[0x3];                                     // 0xBD4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DropMontagePosition;                               // 0xBD50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD54[0x4];                                     // 0xBD54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CarrierDropMontage;                                // 0xBD58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CarrierPickupMontage;                              // 0xBD60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBeingPickedUp;                                   // 0xBD68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD69[0x3];                                     // 0xBD69(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PickupMontagePosition;                             // 0xBD6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TransitionFromPickupToIdle;                        // 0xBD70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_DBNO_Carried(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DBNO_Carried_AnimGraphNode_LinkedAnimGraph_BC9172D64300E6A13C48509FE2988A40();
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DBNO_Carried_AnimGraphNode_ApplyAdditive_56B19EE040BEEBC25D674F8DC99831B9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DBNO_Carried_AnimGraphNode_ModifyBone_59E069244645BEF22808AB9196186F3F();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DBNO_Carried_C">();
	}
	static class UDBNO_Carried_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBNO_Carried_C>();
	}
};
static_assert(alignof(UDBNO_Carried_C) == 0x000010, "Wrong alignment on UDBNO_Carried_C");
static_assert(sizeof(UDBNO_Carried_C) == 0x00BD80, "Wrong size on UDBNO_Carried_C");
static_assert(offsetof(UDBNO_Carried_C, UberGraphFrame) == 0x00B250, "Member 'UDBNO_Carried_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_Root_6FDF76E049A24B1EF9D7DEBBD91751CF) == 0x00B258, "Member 'UDBNO_Carried_C::AnimGraphNode_Root_6FDF76E049A24B1EF9D7DEBBD91751CF' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_LocalToComponentSpace_647109C14F48E941AEF9E486BCFFCB5B) == 0x00B288, "Member 'UDBNO_Carried_C::AnimGraphNode_LocalToComponentSpace_647109C14F48E941AEF9E486BCFFCB5B' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_ModifyBone_59E069244645BEF22808AB9196186F3F) == 0x00B2A8, "Member 'UDBNO_Carried_C::AnimGraphNode_ModifyBone_59E069244645BEF22808AB9196186F3F' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_ModifyBone_32956B0E479193012ACF3FB15ECAFEE6) == 0x00B3B0, "Member 'UDBNO_Carried_C::AnimGraphNode_ModifyBone_32956B0E479193012ACF3FB15ECAFEE6' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_SequencePlayer_80446D5E4D39FC4DB897698A65CD29AC) == 0x00B4B8, "Member 'UDBNO_Carried_C::AnimGraphNode_SequencePlayer_80446D5E4D39FC4DB897698A65CD29AC' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_ApplyAdditive_56B19EE040BEEBC25D674F8DC99831B9) == 0x00B530, "Member 'UDBNO_Carried_C::AnimGraphNode_ApplyAdditive_56B19EE040BEEBC25D674F8DC99831B9' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_TwoBoneIK_A2B587A34E6D45FD2755F6A163B2A7AD) == 0x00B600, "Member 'UDBNO_Carried_C::AnimGraphNode_TwoBoneIK_A2B587A34E6D45FD2755F6A163B2A7AD' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, __CustomProperty_my_animbodytype_BC9172D64300E6A13C48509FE2988A40) == 0x00B7E0, "Member 'UDBNO_Carried_C::__CustomProperty_my_animbodytype_BC9172D64300E6A13C48509FE2988A40' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, __CustomProperty_my_gender_BC9172D64300E6A13C48509FE2988A40) == 0x00B7E1, "Member 'UDBNO_Carried_C::__CustomProperty_my_gender_BC9172D64300E6A13C48509FE2988A40' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_SubInstance_BC9172D64300E6A13C48509FE2988A40) == 0x00B7E8, "Member 'UDBNO_Carried_C::AnimGraphNode_SubInstance_BC9172D64300E6A13C48509FE2988A40' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_ComponentToLocalSpace_2362F79B4764FBA8C8FEEDA5DC88C3B1) == 0x00B878, "Member 'UDBNO_Carried_C::AnimGraphNode_ComponentToLocalSpace_2362F79B4764FBA8C8FEEDA5DC88C3B1' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_TransitionResult_AC1F897843DFD7A8178B8A82E3A790EE) == 0x00B898, "Member 'UDBNO_Carried_C::AnimGraphNode_TransitionResult_AC1F897843DFD7A8178B8A82E3A790EE' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_TransitionResult_2DF19C19483B180CCD9B0395F0443067) == 0x00B8C0, "Member 'UDBNO_Carried_C::AnimGraphNode_TransitionResult_2DF19C19483B180CCD9B0395F0443067' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_SequenceEvaluator_78D4698F4DBD0C20473F7A9407EBB46C) == 0x00B8E8, "Member 'UDBNO_Carried_C::AnimGraphNode_SequenceEvaluator_78D4698F4DBD0C20473F7A9407EBB46C' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_StateResult_A08B893F416A2C075FC4E584C74BAC5C) == 0x00B930, "Member 'UDBNO_Carried_C::AnimGraphNode_StateResult_A08B893F416A2C075FC4E584C74BAC5C' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_SequencePlayer_339D53304C96E6E9CA54849FD42463D2) == 0x00B960, "Member 'UDBNO_Carried_C::AnimGraphNode_SequencePlayer_339D53304C96E6E9CA54849FD42463D2' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_StateResult_2845F0614F1F506F5C75FEB6DB44688C) == 0x00B9D8, "Member 'UDBNO_Carried_C::AnimGraphNode_StateResult_2845F0614F1F506F5C75FEB6DB44688C' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_SequenceEvaluator_F7E4CA4748A4826364AE6EAADE5CBA3C) == 0x00BA08, "Member 'UDBNO_Carried_C::AnimGraphNode_SequenceEvaluator_F7E4CA4748A4826364AE6EAADE5CBA3C' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_StateResult_0DF022F34E2D19939A036B970D6F6AFA) == 0x00BA50, "Member 'UDBNO_Carried_C::AnimGraphNode_StateResult_0DF022F34E2D19939A036B970D6F6AFA' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_StateMachine_928ECAB14B37D35EE66BE6A15B810F70) == 0x00BA80, "Member 'UDBNO_Carried_C::AnimGraphNode_StateMachine_928ECAB14B37D35EE66BE6A15B810F70' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_TwoWayBlend_AA9C546E4B1C5BEF0332B08ECB6BFC83) == 0x00BB30, "Member 'UDBNO_Carried_C::AnimGraphNode_TwoWayBlend_AA9C546E4B1C5BEF0332B08ECB6BFC83' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_SaveCachedPose_DB53A2DF4CAE9120C146E49AC957D990) == 0x00BBF8, "Member 'UDBNO_Carried_C::AnimGraphNode_SaveCachedPose_DB53A2DF4CAE9120C146E49AC957D990' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_UseCachedPose_88EB1D724EB384A84A32F184D445B4B9) == 0x00BCB0, "Member 'UDBNO_Carried_C::AnimGraphNode_UseCachedPose_88EB1D724EB384A84A32F184D445B4B9' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_UseCachedPose_0634F0B8457CE9932959C29729FE76F9) == 0x00BCD8, "Member 'UDBNO_Carried_C::AnimGraphNode_UseCachedPose_0634F0B8457CE9932959C29729FE76F9' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, Carried) == 0x00BD00, "Member 'UDBNO_Carried_C::Carried' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, CarrierPawn) == 0x00BD08, "Member 'UDBNO_Carried_C::CarrierPawn' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, CarrierAnimBP) == 0x00BD10, "Member 'UDBNO_Carried_C::CarrierAnimBP' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, LHandIKLocation) == 0x00BD18, "Member 'UDBNO_Carried_C::LHandIKLocation' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, LHandIKRotation) == 0x00BD24, "Member 'UDBNO_Carried_C::LHandIKRotation' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, TempAttachLocation) == 0x00BD30, "Member 'UDBNO_Carried_C::TempAttachLocation' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, TempAttachRotation) == 0x00BD3C, "Member 'UDBNO_Carried_C::TempAttachRotation' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, SubAnimPhysicsWeight) == 0x00BD48, "Member 'UDBNO_Carried_C::SubAnimPhysicsWeight' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, IsBeingDropped) == 0x00BD4C, "Member 'UDBNO_Carried_C::IsBeingDropped' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, DropMontagePosition) == 0x00BD50, "Member 'UDBNO_Carried_C::DropMontagePosition' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, CarrierDropMontage) == 0x00BD58, "Member 'UDBNO_Carried_C::CarrierDropMontage' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, CarrierPickupMontage) == 0x00BD60, "Member 'UDBNO_Carried_C::CarrierPickupMontage' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, IsBeingPickedUp) == 0x00BD68, "Member 'UDBNO_Carried_C::IsBeingPickedUp' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, PickupMontagePosition) == 0x00BD6C, "Member 'UDBNO_Carried_C::PickupMontagePosition' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, TransitionFromPickupToIdle) == 0x00BD70, "Member 'UDBNO_Carried_C::TransitionFromPickupToIdle' has a wrong offset!");

}

