#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Device_Floor_EliminationZone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Device_Floor_EliminationZone.Device_Floor_EliminationZone_C.ExecuteUbergraph_Device_Floor_EliminationZone
// 0x0120 (0x0120 - 0x0000)
struct Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPregame_ReturnValue;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              CallFunc_VFXParameters_Array;                      // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0068(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Transmit_if_Valid_Actor_Valid;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Transmit_if_Valid_Actor_Valid_1;          // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone) == 0x000008, "Wrong alignment on Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone");
static_assert(sizeof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone) == 0x000120, "Wrong size on Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, EntryPoint) == 0x000000, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, Temp_bool_Variable) == 0x000004, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_IsDedicatedServer_ReturnValue) == 0x000005, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_IsValid_ReturnValue) == 0x000006, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_IsPregame_ReturnValue) == 0x000007, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_IsPregame_ReturnValue' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_VFXParameters_Array) == 0x000008, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_VFXParameters_Array' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, K2Node_Select_Default) == 0x000020, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_BooleanOR_ReturnValue) == 0x000029, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_BooleanAND_ReturnValue_1) == 0x00002A, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_BooleanOR_ReturnValue_1) == 0x00002B, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_MakeVector_ReturnValue) == 0x00002C, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00003C, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000040, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_FMax_ReturnValue) == 0x000044, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000048, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000050, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000058, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000060, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, K2Node_ComponentBoundEvent_bFromSweep) == 0x000064, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, K2Node_ComponentBoundEvent_SweepResult) == 0x000068, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_FMax_ReturnValue_1) == 0x0000F0, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000F8, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, K2Node_ComponentBoundEvent_OtherActor) == 0x000100, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, K2Node_ComponentBoundEvent_OtherComp) == 0x000108, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000110, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_FMax_ReturnValue_2) == 0x000114, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_Transmit_if_Valid_Actor_Valid) == 0x000118, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_Transmit_if_Valid_Actor_Valid' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone, CallFunc_Transmit_if_Valid_Actor_Valid_1) == 0x000119, "Member 'Device_Floor_EliminationZone_C_ExecuteUbergraph_Device_Floor_EliminationZone::CallFunc_Transmit_if_Valid_Actor_Valid_1' has a wrong offset!");

// Function Device_Floor_EliminationZone.Device_Floor_EliminationZone_C.BndEvt__Trigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Device_Floor_EliminationZone.Device_Floor_EliminationZone_C.BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Device_Floor_EliminationZone_C_BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Device_Floor_EliminationZone.Device_Floor_EliminationZone_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct Device_Floor_EliminationZone_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Device_Floor_EliminationZone_C_UserConstructionScript) == 0x000001, "Wrong alignment on Device_Floor_EliminationZone_C_UserConstructionScript");
static_assert(sizeof(Device_Floor_EliminationZone_C_UserConstructionScript) == 0x000001, "Wrong size on Device_Floor_EliminationZone_C_UserConstructionScript");
static_assert(offsetof(Device_Floor_EliminationZone_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'Device_Floor_EliminationZone_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

}

