#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Device_Floor_EliminationZone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Device_Volume_Floor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Device_Floor_EliminationZone.Device_Floor_EliminationZone_C
// 0x0048 (0x0D90 - 0x0D48)
class ADevice_Floor_EliminationZone_C : public ADevice_Volume_Floor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Device_Floor_EliminationZone_C;     // 0x0D48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortGameplayTriggerMessageComponent*   TransmitOnLeaving;                                 // 0x0D50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortGameplayTriggerMessageComponent*   TransmitOnEntering;                                // 0x0D58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_EliminationZone_Edges;                           // 0x0D60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ParticlesMaxDrawDistance;                          // 0x0D68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ZoneDamageType;                                    // 0x0D6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ZoneDamage;                                        // 0x0D70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ZoneDamagePeriodLevel;                             // 0x0D74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShieldDamage;                                     // 0x0D78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D79[0x7];                                      // 0x0D79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        P_EliminationZone_DirectDamage;                    // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_EliminationZone_DOTDamage;                       // 0x0D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Device_Floor_EliminationZone(int32 EntryPoint);
	void BndEvt__Trigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void UpdateVolumeSize();
	void UpdateMinigameVisuals();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Device_Floor_EliminationZone_C">();
	}
	static class ADevice_Floor_EliminationZone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADevice_Floor_EliminationZone_C>();
	}
};
static_assert(alignof(ADevice_Floor_EliminationZone_C) == 0x000008, "Wrong alignment on ADevice_Floor_EliminationZone_C");
static_assert(sizeof(ADevice_Floor_EliminationZone_C) == 0x000D90, "Wrong size on ADevice_Floor_EliminationZone_C");
static_assert(offsetof(ADevice_Floor_EliminationZone_C, UberGraphFrame_Device_Floor_EliminationZone_C) == 0x000D48, "Member 'ADevice_Floor_EliminationZone_C::UberGraphFrame_Device_Floor_EliminationZone_C' has a wrong offset!");
static_assert(offsetof(ADevice_Floor_EliminationZone_C, TransmitOnLeaving) == 0x000D50, "Member 'ADevice_Floor_EliminationZone_C::TransmitOnLeaving' has a wrong offset!");
static_assert(offsetof(ADevice_Floor_EliminationZone_C, TransmitOnEntering) == 0x000D58, "Member 'ADevice_Floor_EliminationZone_C::TransmitOnEntering' has a wrong offset!");
static_assert(offsetof(ADevice_Floor_EliminationZone_C, P_EliminationZone_Edges) == 0x000D60, "Member 'ADevice_Floor_EliminationZone_C::P_EliminationZone_Edges' has a wrong offset!");
static_assert(offsetof(ADevice_Floor_EliminationZone_C, ParticlesMaxDrawDistance) == 0x000D68, "Member 'ADevice_Floor_EliminationZone_C::ParticlesMaxDrawDistance' has a wrong offset!");
static_assert(offsetof(ADevice_Floor_EliminationZone_C, ZoneDamageType) == 0x000D6C, "Member 'ADevice_Floor_EliminationZone_C::ZoneDamageType' has a wrong offset!");
static_assert(offsetof(ADevice_Floor_EliminationZone_C, ZoneDamage) == 0x000D70, "Member 'ADevice_Floor_EliminationZone_C::ZoneDamage' has a wrong offset!");
static_assert(offsetof(ADevice_Floor_EliminationZone_C, ZoneDamagePeriodLevel) == 0x000D74, "Member 'ADevice_Floor_EliminationZone_C::ZoneDamagePeriodLevel' has a wrong offset!");
static_assert(offsetof(ADevice_Floor_EliminationZone_C, bShieldDamage) == 0x000D78, "Member 'ADevice_Floor_EliminationZone_C::bShieldDamage' has a wrong offset!");
static_assert(offsetof(ADevice_Floor_EliminationZone_C, P_EliminationZone_DirectDamage) == 0x000D80, "Member 'ADevice_Floor_EliminationZone_C::P_EliminationZone_DirectDamage' has a wrong offset!");
static_assert(offsetof(ADevice_Floor_EliminationZone_C, P_EliminationZone_DOTDamage) == 0x000D88, "Member 'ADevice_Floor_EliminationZone_C::P_EliminationZone_DOTDamage' has a wrong offset!");

}

