#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Device_Wall_NoWeaponZone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Device_Wall_NoWeaponZone.Device_Wall_NoWeaponZone_C.ExecuteUbergraph_Device_Wall_NoWeaponZone
// 0x0028 (0x0028 - 0x0000)
struct Device_Wall_NoWeaponZone_C_ExecuteUbergraph_Device_Wall_NoWeaponZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorFloat_ReturnValue;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Device_Wall_NoWeaponZone_C_ExecuteUbergraph_Device_Wall_NoWeaponZone) == 0x000004, "Wrong alignment on Device_Wall_NoWeaponZone_C_ExecuteUbergraph_Device_Wall_NoWeaponZone");
static_assert(sizeof(Device_Wall_NoWeaponZone_C_ExecuteUbergraph_Device_Wall_NoWeaponZone) == 0x000028, "Wrong size on Device_Wall_NoWeaponZone_C_ExecuteUbergraph_Device_Wall_NoWeaponZone");
static_assert(offsetof(Device_Wall_NoWeaponZone_C_ExecuteUbergraph_Device_Wall_NoWeaponZone, EntryPoint) == 0x000000, "Member 'Device_Wall_NoWeaponZone_C_ExecuteUbergraph_Device_Wall_NoWeaponZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(Device_Wall_NoWeaponZone_C_ExecuteUbergraph_Device_Wall_NoWeaponZone, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'Device_Wall_NoWeaponZone_C_ExecuteUbergraph_Device_Wall_NoWeaponZone::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Device_Wall_NoWeaponZone_C_ExecuteUbergraph_Device_Wall_NoWeaponZone, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000010, "Member 'Device_Wall_NoWeaponZone_C_ExecuteUbergraph_Device_Wall_NoWeaponZone::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Device_Wall_NoWeaponZone_C_ExecuteUbergraph_Device_Wall_NoWeaponZone, CallFunc_Subtract_VectorFloat_ReturnValue) == 0x00001C, "Member 'Device_Wall_NoWeaponZone_C_ExecuteUbergraph_Device_Wall_NoWeaponZone::CallFunc_Subtract_VectorFloat_ReturnValue' has a wrong offset!");

// Function Device_Wall_NoWeaponZone.Device_Wall_NoWeaponZone_C.GetTriggerLocation
// 0x0034 (0x0034 - 0x0000)
struct Device_Wall_NoWeaponZone_C_GetTriggerLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Device_Wall_NoWeaponZone_C_GetTriggerLocation) == 0x000004, "Wrong alignment on Device_Wall_NoWeaponZone_C_GetTriggerLocation");
static_assert(sizeof(Device_Wall_NoWeaponZone_C_GetTriggerLocation) == 0x000034, "Wrong size on Device_Wall_NoWeaponZone_C_GetTriggerLocation");
static_assert(offsetof(Device_Wall_NoWeaponZone_C_GetTriggerLocation, Location) == 0x000000, "Member 'Device_Wall_NoWeaponZone_C_GetTriggerLocation::Location' has a wrong offset!");
static_assert(offsetof(Device_Wall_NoWeaponZone_C_GetTriggerLocation, CallFunc_BreakVector_X) == 0x00000C, "Member 'Device_Wall_NoWeaponZone_C_GetTriggerLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Device_Wall_NoWeaponZone_C_GetTriggerLocation, CallFunc_BreakVector_Y) == 0x000010, "Member 'Device_Wall_NoWeaponZone_C_GetTriggerLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Device_Wall_NoWeaponZone_C_GetTriggerLocation, CallFunc_BreakVector_Z) == 0x000014, "Member 'Device_Wall_NoWeaponZone_C_GetTriggerLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Device_Wall_NoWeaponZone_C_GetTriggerLocation, CallFunc_BreakVector_X_1) == 0x000018, "Member 'Device_Wall_NoWeaponZone_C_GetTriggerLocation::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Device_Wall_NoWeaponZone_C_GetTriggerLocation, CallFunc_BreakVector_Y_1) == 0x00001C, "Member 'Device_Wall_NoWeaponZone_C_GetTriggerLocation::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Device_Wall_NoWeaponZone_C_GetTriggerLocation, CallFunc_BreakVector_Z_1) == 0x000020, "Member 'Device_Wall_NoWeaponZone_C_GetTriggerLocation::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Device_Wall_NoWeaponZone_C_GetTriggerLocation, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'Device_Wall_NoWeaponZone_C_GetTriggerLocation::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Device_Wall_NoWeaponZone_C_GetTriggerLocation, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'Device_Wall_NoWeaponZone_C_GetTriggerLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

