#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DishHitReactSelectionInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct DishHitReactSelectionInfo.DishHitReactSelectionInfo
// 0x0014 (0x0014 - 0x0000)
struct FDishHitReactSelectionInfo final
{
public:
	float                                         MinYawToInstigator_7_CD66F5534D2342817E20CB958F42A05E; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxYawToInstigator_9_62A6FC5442FA6451356E01968FB0A85F; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFirstBlock_25_919B150F474766AEAD087EA3A84DC138;  // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MontageSectionName_17_C1FAF635407E1271A9D38598E5247255; // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FDishHitReactSelectionInfo) == 0x000004, "Wrong alignment on FDishHitReactSelectionInfo");
static_assert(sizeof(FDishHitReactSelectionInfo) == 0x000014, "Wrong size on FDishHitReactSelectionInfo");
static_assert(offsetof(FDishHitReactSelectionInfo, MinYawToInstigator_7_CD66F5534D2342817E20CB958F42A05E) == 0x000000, "Member 'FDishHitReactSelectionInfo::MinYawToInstigator_7_CD66F5534D2342817E20CB958F42A05E' has a wrong offset!");
static_assert(offsetof(FDishHitReactSelectionInfo, MaxYawToInstigator_9_62A6FC5442FA6451356E01968FB0A85F) == 0x000004, "Member 'FDishHitReactSelectionInfo::MaxYawToInstigator_9_62A6FC5442FA6451356E01968FB0A85F' has a wrong offset!");
static_assert(offsetof(FDishHitReactSelectionInfo, IsFirstBlock_25_919B150F474766AEAD087EA3A84DC138) == 0x000008, "Member 'FDishHitReactSelectionInfo::IsFirstBlock_25_919B150F474766AEAD087EA3A84DC138' has a wrong offset!");
static_assert(offsetof(FDishHitReactSelectionInfo, MontageSectionName_17_C1FAF635407E1271A9D38598E5247255) == 0x00000C, "Member 'FDishHitReactSelectionInfo::MontageSectionName_17_C1FAF635407E1271A9D38598E5247255' has a wrong offset!");

}

