#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnableMultiFactorAuthModalBP

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EnableMultiFactorAuthModalBP.EnableMultiFactorAuthModalBP_C
// 0x0120 (0x05C8 - 0x04A8)
class UEnableMultiFactorAuthModalBP_C final : public UEnableMultiFactorModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro_V2;                                          // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ArrowPulse;                                        // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       ConsoleTextBlock;                                  // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CT_LimitedTimeHeader;                              // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CT_TakenToWebsite;                                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        EnableButtonSwitcher;                              // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInfoWidget_C*                      ItemInfoWidget_FromSocialImport;                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         lazyImage;                                         // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_TitleHeader;                              // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EFrontEndCamera                               DesiredFrontEndCamera;                             // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    PreviewItemDef;                                    // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeartbeatDelayIntroAnimation;                      // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         debugSocialImportType;                             // 0x0524(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasReward;                                        // 0x0525(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_526[0x2];                                      // 0x0526(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FacebookHeader;                                    // 0x0528(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   VKHeader;                                          // 0x0540(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SteamHeader;                                       // 0x0558(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   PlaystationHeader;                                 // 0x0570(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   XboxHeader;                                        // 0x0588(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	ESocialImportPanelPlatform                    SocialPlatform;                                    // 0x05A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NewVar_0;                                          // 0x05A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 MobileLimitedTimeHeaderStyle;                      // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ScaleTitleForCulture();
	void AnimationFullyCompleteBP();
	void HandleSetScreenMode();
	void NavUp();
	void NavRight();
	void BP_OnActivated();
	void BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void HandleHeaderText();
	void PreConstruct(bool IsDesignTime);
	void OnPanelTypeSet(ESocialImportPanelType NewType);
	void OnIncentivizedSet(bool bIncentivized);
	void OnSetExitButtonText(const class FText& NewButtonText);
	void OnConsoleDisplayURLProvided(const class FText& UniquePlayerURLText);
	void OnSetScreenConfiguration(bool bIsConsole);
	void Construct();
	void ExecuteUbergraph_EnableMultiFactorAuthModalBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EnableMultiFactorAuthModalBP_C">();
	}
	static class UEnableMultiFactorAuthModalBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnableMultiFactorAuthModalBP_C>();
	}
};
static_assert(alignof(UEnableMultiFactorAuthModalBP_C) == 0x000008, "Wrong alignment on UEnableMultiFactorAuthModalBP_C");
static_assert(sizeof(UEnableMultiFactorAuthModalBP_C) == 0x0005C8, "Wrong size on UEnableMultiFactorAuthModalBP_C");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, UberGraphFrame) == 0x0004A8, "Member 'UEnableMultiFactorAuthModalBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, Intro_V2) == 0x0004B0, "Member 'UEnableMultiFactorAuthModalBP_C::Intro_V2' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, ArrowPulse) == 0x0004B8, "Member 'UEnableMultiFactorAuthModalBP_C::ArrowPulse' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, Intro) == 0x0004C0, "Member 'UEnableMultiFactorAuthModalBP_C::Intro' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, ConsoleTextBlock) == 0x0004C8, "Member 'UEnableMultiFactorAuthModalBP_C::ConsoleTextBlock' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, CT_LimitedTimeHeader) == 0x0004D0, "Member 'UEnableMultiFactorAuthModalBP_C::CT_LimitedTimeHeader' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, CT_TakenToWebsite) == 0x0004D8, "Member 'UEnableMultiFactorAuthModalBP_C::CT_TakenToWebsite' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, EnableButtonSwitcher) == 0x0004E0, "Member 'UEnableMultiFactorAuthModalBP_C::EnableButtonSwitcher' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, Image_0) == 0x0004E8, "Member 'UEnableMultiFactorAuthModalBP_C::Image_0' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, ItemInfoWidget_FromSocialImport) == 0x0004F0, "Member 'UEnableMultiFactorAuthModalBP_C::ItemInfoWidget_FromSocialImport' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, lazyImage) == 0x0004F8, "Member 'UEnableMultiFactorAuthModalBP_C::lazyImage' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, SafeZone) == 0x000500, "Member 'UEnableMultiFactorAuthModalBP_C::SafeZone' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, ScaleBox_TitleHeader) == 0x000508, "Member 'UEnableMultiFactorAuthModalBP_C::ScaleBox_TitleHeader' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, DesiredFrontEndCamera) == 0x000510, "Member 'UEnableMultiFactorAuthModalBP_C::DesiredFrontEndCamera' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, PreviewItemDef) == 0x000518, "Member 'UEnableMultiFactorAuthModalBP_C::PreviewItemDef' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, HeartbeatDelayIntroAnimation) == 0x000520, "Member 'UEnableMultiFactorAuthModalBP_C::HeartbeatDelayIntroAnimation' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, debugSocialImportType) == 0x000524, "Member 'UEnableMultiFactorAuthModalBP_C::debugSocialImportType' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, bHasReward) == 0x000525, "Member 'UEnableMultiFactorAuthModalBP_C::bHasReward' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, FacebookHeader) == 0x000528, "Member 'UEnableMultiFactorAuthModalBP_C::FacebookHeader' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, VKHeader) == 0x000540, "Member 'UEnableMultiFactorAuthModalBP_C::VKHeader' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, SteamHeader) == 0x000558, "Member 'UEnableMultiFactorAuthModalBP_C::SteamHeader' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, PlaystationHeader) == 0x000570, "Member 'UEnableMultiFactorAuthModalBP_C::PlaystationHeader' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, XboxHeader) == 0x000588, "Member 'UEnableMultiFactorAuthModalBP_C::XboxHeader' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, SocialPlatform) == 0x0005A0, "Member 'UEnableMultiFactorAuthModalBP_C::SocialPlatform' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, NewVar_0) == 0x0005A8, "Member 'UEnableMultiFactorAuthModalBP_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, MobileLimitedTimeHeaderStyle) == 0x0005C0, "Member 'UEnableMultiFactorAuthModalBP_C::MobileLimitedTimeHeaderStyle' has a wrong offset!");

}

