#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FIlteredTextEntryWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FIlteredTextEntryWidget.FilteredTextEntryWidget_C
// 0x0880 (0x0AE0 - 0x0260)
class UFilteredTextEntryWidget_C final : public UFortEditableFilteredCountedTextBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Error;                                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_Prompt;                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ErrorText;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Info;                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bUseOverrideStyle;                                 // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditableTextBoxStyle                  OverrideStyle;                                     // 0x0298(0x07F0)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bHideValidationInfo;                               // 0x0A88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	ETextJustify                                  Justification;                                     // 0x0A89(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowTextPrompt;                                    // 0x0A8A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_A8B[0x5];                                      // 0x0A8B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 PromptTextStyle;                                   // 0x0A90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   PromptText;                                        // 0x0A98(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void(class FText Text)> OnTextChanged;                                     // 0x0AB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bUseHintText;                                      // 0x0AC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AC1[0x7];                                      // 0x0AC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HintText;                                          // 0x0AC8(0x0018)(Edit, BlueprintVisible)

public:
	void GetCurrentText(class FText* Text);
	void HandleShowPrompt(const class FText& CurrentText);
	void SetTextFocus();
	void UpdateConfiguration(bool bOverrideStyle, bool bHideValidation, ETextJustify TextJustification, bool bShouldShowTextPrompt, const class FText& PromptDisplayText, class UClass* TextStyle);
	void Construct();
	void OnDirtyTextAttempted(bool bIsBadText);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__EditText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void ExecuteUbergraph_FilteredTextEntryWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FilteredTextEntryWidget_C">();
	}
	static class UFilteredTextEntryWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFilteredTextEntryWidget_C>();
	}
};
static_assert(alignof(UFilteredTextEntryWidget_C) == 0x000008, "Wrong alignment on UFilteredTextEntryWidget_C");
static_assert(sizeof(UFilteredTextEntryWidget_C) == 0x000AE0, "Wrong size on UFilteredTextEntryWidget_C");
static_assert(offsetof(UFilteredTextEntryWidget_C, UberGraphFrame) == 0x000260, "Member 'UFilteredTextEntryWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, Error) == 0x000268, "Member 'UFilteredTextEntryWidget_C::Error' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, CommonTextBlock_Prompt) == 0x000270, "Member 'UFilteredTextEntryWidget_C::CommonTextBlock_Prompt' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, ErrorText) == 0x000278, "Member 'UFilteredTextEntryWidget_C::ErrorText' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, HorizontalBox_Info) == 0x000280, "Member 'UFilteredTextEntryWidget_C::HorizontalBox_Info' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, Image_Selected) == 0x000288, "Member 'UFilteredTextEntryWidget_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, bUseOverrideStyle) == 0x000290, "Member 'UFilteredTextEntryWidget_C::bUseOverrideStyle' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, OverrideStyle) == 0x000298, "Member 'UFilteredTextEntryWidget_C::OverrideStyle' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, bHideValidationInfo) == 0x000A88, "Member 'UFilteredTextEntryWidget_C::bHideValidationInfo' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, Justification) == 0x000A89, "Member 'UFilteredTextEntryWidget_C::Justification' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, ShowTextPrompt) == 0x000A8A, "Member 'UFilteredTextEntryWidget_C::ShowTextPrompt' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, PromptTextStyle) == 0x000A90, "Member 'UFilteredTextEntryWidget_C::PromptTextStyle' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, PromptText) == 0x000A98, "Member 'UFilteredTextEntryWidget_C::PromptText' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, OnTextChanged) == 0x000AB0, "Member 'UFilteredTextEntryWidget_C::OnTextChanged' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, bUseHintText) == 0x000AC0, "Member 'UFilteredTextEntryWidget_C::bUseHintText' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, HintText) == 0x000AC8, "Member 'UFilteredTextEntryWidget_C::HintText' has a wrong offset!");

}

