#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Flopper_Gadget_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Flopper_Gadget_AnimBP.Flopper_Gadget_AnimBP_C
// 0x0570 (0x07E0 - 0x0270)
class UFlopper_Gadget_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_2F2AB8FA4E1C815767E9FF85ED9DB64C; // 0x0278(0x0018)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_F503A4E3403EE6E7C2EFEF835B120AE3; // 0x0290(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_072C83FB4DE31E194B88C79635DBA857; // 0x02B0(0x0020)()
	struct FAnimNode_Trail                        AnimGraphNode_Trail_31475A4D4176A843679325975216423F; // 0x02D0(0x0270)()
	struct FAnimNode_Trail                        AnimGraphNode_Trail_BD2C0AE146BBEC3C1A4E439940E02D82; // 0x0540(0x0270)()
	struct FAnimNode_Root                         AnimGraphNode_Root_E1C0D5694227B227D5EBBDB62D4F6321; // 0x07B0(0x0030)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Flopper_Gadget_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Flopper_Gadget_AnimBP_C">();
	}
	static class UFlopper_Gadget_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlopper_Gadget_AnimBP_C>();
	}
};
static_assert(alignof(UFlopper_Gadget_AnimBP_C) == 0x000010, "Wrong alignment on UFlopper_Gadget_AnimBP_C");
static_assert(sizeof(UFlopper_Gadget_AnimBP_C) == 0x0007E0, "Wrong size on UFlopper_Gadget_AnimBP_C");
static_assert(offsetof(UFlopper_Gadget_AnimBP_C, UberGraphFrame) == 0x000270, "Member 'UFlopper_Gadget_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFlopper_Gadget_AnimBP_C, AnimGraphNode_LocalRefPose_2F2AB8FA4E1C815767E9FF85ED9DB64C) == 0x000278, "Member 'UFlopper_Gadget_AnimBP_C::AnimGraphNode_LocalRefPose_2F2AB8FA4E1C815767E9FF85ED9DB64C' has a wrong offset!");
static_assert(offsetof(UFlopper_Gadget_AnimBP_C, AnimGraphNode_LocalToComponentSpace_F503A4E3403EE6E7C2EFEF835B120AE3) == 0x000290, "Member 'UFlopper_Gadget_AnimBP_C::AnimGraphNode_LocalToComponentSpace_F503A4E3403EE6E7C2EFEF835B120AE3' has a wrong offset!");
static_assert(offsetof(UFlopper_Gadget_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_072C83FB4DE31E194B88C79635DBA857) == 0x0002B0, "Member 'UFlopper_Gadget_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_072C83FB4DE31E194B88C79635DBA857' has a wrong offset!");
static_assert(offsetof(UFlopper_Gadget_AnimBP_C, AnimGraphNode_Trail_31475A4D4176A843679325975216423F) == 0x0002D0, "Member 'UFlopper_Gadget_AnimBP_C::AnimGraphNode_Trail_31475A4D4176A843679325975216423F' has a wrong offset!");
static_assert(offsetof(UFlopper_Gadget_AnimBP_C, AnimGraphNode_Trail_BD2C0AE146BBEC3C1A4E439940E02D82) == 0x000540, "Member 'UFlopper_Gadget_AnimBP_C::AnimGraphNode_Trail_BD2C0AE146BBEC3C1A4E439940E02D82' has a wrong offset!");
static_assert(offsetof(UFlopper_Gadget_AnimBP_C, AnimGraphNode_Root_E1C0D5694227B227D5EBBDB62D4F6321) == 0x0007B0, "Member 'UFlopper_Gadget_AnimBP_C::AnimGraphNode_Root_E1C0D5694227B227D5EBBDB62D4F6321' has a wrong offset!");

}

