#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortTutorial_LobbyPopup_2

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortTutorial_LobbyPopup_2.FortTutorial_LobbyPopup_2_C
// 0x0098 (0x0518 - 0x0480)
class UFortTutorial_LobbyPopup_2_C final : public UFortTutorialLobbyPopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       In_V2;                                             // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_V1;                                             // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Darken;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Close_Button;                                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Header;                                            // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Header_1;                                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Character;                                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Character_BG;                                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PH1;                                               // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PH1_1;                                             // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PH2;                                               // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PH2_1;                                             // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichText_Desc;                                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichText_Desc_1;                                   // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Skip_Button;                                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      YesButton;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void BndEvt__Skip_Button_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Close_Button_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Cancel_Button_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_FortTutorial_LobbyPopup_2(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortTutorial_LobbyPopup_2_C">();
	}
	static class UFortTutorial_LobbyPopup_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTutorial_LobbyPopup_2_C>();
	}
};
static_assert(alignof(UFortTutorial_LobbyPopup_2_C) == 0x000008, "Wrong alignment on UFortTutorial_LobbyPopup_2_C");
static_assert(sizeof(UFortTutorial_LobbyPopup_2_C) == 0x000518, "Wrong size on UFortTutorial_LobbyPopup_2_C");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, UberGraphFrame) == 0x000480, "Member 'UFortTutorial_LobbyPopup_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, In_V2) == 0x000488, "Member 'UFortTutorial_LobbyPopup_2_C::In_V2' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, In_V1) == 0x000490, "Member 'UFortTutorial_LobbyPopup_2_C::In_V1' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, Out) == 0x000498, "Member 'UFortTutorial_LobbyPopup_2_C::Out' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, In) == 0x0004A0, "Member 'UFortTutorial_LobbyPopup_2_C::In' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, Border_Darken) == 0x0004A8, "Member 'UFortTutorial_LobbyPopup_2_C::Border_Darken' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, Close_Button) == 0x0004B0, "Member 'UFortTutorial_LobbyPopup_2_C::Close_Button' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, Header) == 0x0004B8, "Member 'UFortTutorial_LobbyPopup_2_C::Header' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, Header_1) == 0x0004C0, "Member 'UFortTutorial_LobbyPopup_2_C::Header_1' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, IMG_Character) == 0x0004C8, "Member 'UFortTutorial_LobbyPopup_2_C::IMG_Character' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, IMG_Character_BG) == 0x0004D0, "Member 'UFortTutorial_LobbyPopup_2_C::IMG_Character_BG' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, PH1) == 0x0004D8, "Member 'UFortTutorial_LobbyPopup_2_C::PH1' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, PH1_1) == 0x0004E0, "Member 'UFortTutorial_LobbyPopup_2_C::PH1_1' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, PH2) == 0x0004E8, "Member 'UFortTutorial_LobbyPopup_2_C::PH2' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, PH2_1) == 0x0004F0, "Member 'UFortTutorial_LobbyPopup_2_C::PH2_1' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, RichText_Desc) == 0x0004F8, "Member 'UFortTutorial_LobbyPopup_2_C::RichText_Desc' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, RichText_Desc_1) == 0x000500, "Member 'UFortTutorial_LobbyPopup_2_C::RichText_Desc_1' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, Skip_Button) == 0x000508, "Member 'UFortTutorial_LobbyPopup_2_C::Skip_Button' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, YesButton) == 0x000510, "Member 'UFortTutorial_LobbyPopup_2_C::YesButton' has a wrong offset!");

}

