#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "McpProfileSys_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "BlueprintContext_classes.hpp"
#include "CommonInput_structs.hpp"
#include "CommonInput_classes.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SocialUMG_structs.hpp"
#include "SocialUMG_classes.hpp"
#include "InputCore_structs.hpp"
#include "EpicCMSUIFramework_classes.hpp"
#include "GameSubCatalog_structs.hpp"
#include "Party_structs.hpp"
#include "Slate_structs.hpp"
#include "LauncherSocialTypes_structs.hpp"


namespace SDK
{

// Class FortniteUI.AthenaLoadingScreenPreviewPanelBase
// 0x0018 (0x0428 - 0x0410)
class UAthenaLoadingScreenPreviewPanelBase : public UAthenaLoadingScreenPreviewPanel
{
public:
	class UNativeWidgetHost*                      LoadingScreenSlot;                                 // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          Button_Close;                                      // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaLoadingScreenPreviewPanelBase">();
	}
	static class UAthenaLoadingScreenPreviewPanelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLoadingScreenPreviewPanelBase>();
	}
};
static_assert(alignof(UAthenaLoadingScreenPreviewPanelBase) == 0x000008, "Wrong alignment on UAthenaLoadingScreenPreviewPanelBase");
static_assert(sizeof(UAthenaLoadingScreenPreviewPanelBase) == 0x000428, "Wrong size on UAthenaLoadingScreenPreviewPanelBase");
static_assert(offsetof(UAthenaLoadingScreenPreviewPanelBase, LoadingScreenSlot) == 0x000410, "Member 'UAthenaLoadingScreenPreviewPanelBase::LoadingScreenSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLoadingScreenPreviewPanelBase, Button_Close) == 0x000420, "Member 'UAthenaLoadingScreenPreviewPanelBase::Button_Close' has a wrong offset!");

// Class FortniteUI.FortTeamMemberEntryBase
// 0x0028 (0x0B98 - 0x0B70)
class UFortTeamMemberEntryBase : public UCommonButton
{
public:
	uint8                                         Pad_B70[0x28];                                     // 0x0B70(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnTeamMemberEstablished(bool bHasValidMember);
	void OnMemberGameReadinessChanged(EGameReadiness ReadyStatus);
	void OnMemberIsInFrontendChanged(bool bIsInFrontend);

	EGameReadiness GetCurrentMemberGameReadiness() const;
	bool IsCurrentMemberInFrontend() const;
	bool IsCurrentMemberLocal() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTeamMemberEntryBase">();
	}
	static class UFortTeamMemberEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTeamMemberEntryBase>();
	}
};
static_assert(alignof(UFortTeamMemberEntryBase) == 0x000008, "Wrong alignment on UFortTeamMemberEntryBase");
static_assert(sizeof(UFortTeamMemberEntryBase) == 0x000B98, "Wrong size on UFortTeamMemberEntryBase");

// Class FortniteUI.FortHeroAbilitiesAndGadgetsBase
// 0x0018 (0x0BB0 - 0x0B98)
class UFortHeroAbilitiesAndGadgetsBase final : public UFortTeamMemberEntryBase
{
public:
	bool                                          bHideAbilities;                                    // 0x0B98(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHideGadgets;                                      // 0x0B99(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B9A[0x2];                                      // 0x0B9A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AssignedMemberIndex;                               // 0x0B9C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortPerksWidget_NUI*                   HorizontalAbilitiesList;                           // 0x0BA0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortGadgetsWidgetBase*                 GadgetsWidget;                                     // 0x0BA8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Refresh(class UFortCampaignHeroLoadoutItem* HeroLoadout);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHeroAbilitiesAndGadgetsBase">();
	}
	static class UFortHeroAbilitiesAndGadgetsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHeroAbilitiesAndGadgetsBase>();
	}
};
static_assert(alignof(UFortHeroAbilitiesAndGadgetsBase) == 0x000008, "Wrong alignment on UFortHeroAbilitiesAndGadgetsBase");
static_assert(sizeof(UFortHeroAbilitiesAndGadgetsBase) == 0x000BB0, "Wrong size on UFortHeroAbilitiesAndGadgetsBase");
static_assert(offsetof(UFortHeroAbilitiesAndGadgetsBase, bHideAbilities) == 0x000B98, "Member 'UFortHeroAbilitiesAndGadgetsBase::bHideAbilities' has a wrong offset!");
static_assert(offsetof(UFortHeroAbilitiesAndGadgetsBase, bHideGadgets) == 0x000B99, "Member 'UFortHeroAbilitiesAndGadgetsBase::bHideGadgets' has a wrong offset!");
static_assert(offsetof(UFortHeroAbilitiesAndGadgetsBase, AssignedMemberIndex) == 0x000B9C, "Member 'UFortHeroAbilitiesAndGadgetsBase::AssignedMemberIndex' has a wrong offset!");
static_assert(offsetof(UFortHeroAbilitiesAndGadgetsBase, HorizontalAbilitiesList) == 0x000BA0, "Member 'UFortHeroAbilitiesAndGadgetsBase::HorizontalAbilitiesList' has a wrong offset!");
static_assert(offsetof(UFortHeroAbilitiesAndGadgetsBase, GadgetsWidget) == 0x000BA8, "Member 'UFortHeroAbilitiesAndGadgetsBase::GadgetsWidget' has a wrong offset!");

// Class FortniteUI.FortUserPermissions
// 0x0028 (0x0050 - 0x0028)
class UFortUserPermissions final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUserPermissions">();
	}
	static class UFortUserPermissions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUserPermissions>();
	}
};
static_assert(alignof(UFortUserPermissions) == 0x000008, "Wrong alignment on UFortUserPermissions");
static_assert(sizeof(UFortUserPermissions) == 0x000050, "Wrong size on UFortUserPermissions");

// Class FortniteUI.ApolloIntroLoadingPanel
// 0x0008 (0x0430 - 0x0428)
class UApolloIntroLoadingPanel : public UAthenaLoadingScreenPreviewPanelBase
{
public:
	class UFortPlaylistAthena*                    ApolloIntroPlaylist;                               // 0x0428(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ApolloIntroLoadingPanel">();
	}
	static class UApolloIntroLoadingPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UApolloIntroLoadingPanel>();
	}
};
static_assert(alignof(UApolloIntroLoadingPanel) == 0x000008, "Wrong alignment on UApolloIntroLoadingPanel");
static_assert(sizeof(UApolloIntroLoadingPanel) == 0x000430, "Wrong size on UApolloIntroLoadingPanel");
static_assert(offsetof(UApolloIntroLoadingPanel, ApolloIntroPlaylist) == 0x000428, "Member 'UApolloIntroLoadingPanel::ApolloIntroPlaylist' has a wrong offset!");

// Class FortniteUI.FortActivatablePanel
// 0x0030 (0x0438 - 0x0408)
class UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	bool                                          bIsPushedOnToContentPanelStack;                    // 0x0408(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlreadyOnContentPanelStack;                     // 0x0409(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputPriority                                InputPriority;                                     // 0x040A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsClosableByPlayerInput;                          // 0x040B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40C[0x2C];                                     // 0x040C(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AsyncPlaySound2D(const class UObject* WorldContextObject, TSoftObjectPtr<class USoundBase> SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime);
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void RestoreScrollWidget(class UWidget* FallbackWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivatablePanel">();
	}
	static class UFortActivatablePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatablePanel>();
	}
};
static_assert(alignof(UFortActivatablePanel) == 0x000008, "Wrong alignment on UFortActivatablePanel");
static_assert(sizeof(UFortActivatablePanel) == 0x000438, "Wrong size on UFortActivatablePanel");
static_assert(offsetof(UFortActivatablePanel, bIsPushedOnToContentPanelStack) == 0x000408, "Member 'UFortActivatablePanel::bIsPushedOnToContentPanelStack' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanel, bIsAlreadyOnContentPanelStack) == 0x000409, "Member 'UFortActivatablePanel::bIsAlreadyOnContentPanelStack' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanel, InputPriority) == 0x00040A, "Member 'UFortActivatablePanel::InputPriority' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanel, bIsClosableByPlayerInput) == 0x00040B, "Member 'UFortActivatablePanel::bIsClosableByPlayerInput' has a wrong offset!");

// Class FortniteUI.FortAthenaNewsPanel
// 0x0008 (0x0440 - 0x0438)
class UFortAthenaNewsPanel : public UFortActivatablePanel
{
public:
	class UFortAthenaNewsWidget*                  NewsWidget_Main;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnExternalURLOpened();

	void SendMotdInteractionAnalytic(const class FString& Interaction) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaNewsPanel">();
	}
	static class UFortAthenaNewsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaNewsPanel>();
	}
};
static_assert(alignof(UFortAthenaNewsPanel) == 0x000008, "Wrong alignment on UFortAthenaNewsPanel");
static_assert(sizeof(UFortAthenaNewsPanel) == 0x000440, "Wrong size on UFortAthenaNewsPanel");
static_assert(offsetof(UFortAthenaNewsPanel, NewsWidget_Main) == 0x000438, "Member 'UFortAthenaNewsPanel::NewsWidget_Main' has a wrong offset!");

// Class FortniteUI.FortOpenCardPackModal
// 0x0040 (0x0478 - 0x0438)
class UFortOpenCardPackModal final : public UFortActivatablePanel
{
public:
	class UCommonListView*                        CardPackList;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonButton*                          OpenAllButton;                                     // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          CancelButton;                                      // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(int32 PackIndex)> BPOnRequestOpenCardPack;                           // 0x0450(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_460[0x18];                                     // 0x0460(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortOpenCardPackModal">();
	}
	static class UFortOpenCardPackModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortOpenCardPackModal>();
	}
};
static_assert(alignof(UFortOpenCardPackModal) == 0x000008, "Wrong alignment on UFortOpenCardPackModal");
static_assert(sizeof(UFortOpenCardPackModal) == 0x000478, "Wrong size on UFortOpenCardPackModal");
static_assert(offsetof(UFortOpenCardPackModal, CardPackList) == 0x000438, "Member 'UFortOpenCardPackModal::CardPackList' has a wrong offset!");
static_assert(offsetof(UFortOpenCardPackModal, OpenAllButton) == 0x000440, "Member 'UFortOpenCardPackModal::OpenAllButton' has a wrong offset!");
static_assert(offsetof(UFortOpenCardPackModal, CancelButton) == 0x000448, "Member 'UFortOpenCardPackModal::CancelButton' has a wrong offset!");
static_assert(offsetof(UFortOpenCardPackModal, BPOnRequestOpenCardPack) == 0x000450, "Member 'UFortOpenCardPackModal::BPOnRequestOpenCardPack' has a wrong offset!");

// Class FortniteUI.ApolloIntroShimBase
// 0x0000 (0x0230 - 0x0230)
class UApolloIntroShimBase final : public UUserWidget
{
public:
	void HandleGamePhaseChanged(EAthenaGamePhase GamePhase);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ApolloIntroShimBase">();
	}
	static class UApolloIntroShimBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UApolloIntroShimBase>();
	}
};
static_assert(alignof(UApolloIntroShimBase) == 0x000008, "Wrong alignment on UApolloIntroShimBase");
static_assert(sizeof(UApolloIntroShimBase) == 0x000230, "Wrong size on UApolloIntroShimBase");

// Class FortniteUI.FortAthenaMOTDLobbyContentWidget
// 0x0010 (0x02E0 - 0x02D0)
class UFortAthenaMOTDLobbyContentWidget : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_2D0[0x10];                                     // 0x02D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMOTDLobbyContentWidget">();
	}
	static class UFortAthenaMOTDLobbyContentWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaMOTDLobbyContentWidget>();
	}
};
static_assert(alignof(UFortAthenaMOTDLobbyContentWidget) == 0x000008, "Wrong alignment on UFortAthenaMOTDLobbyContentWidget");
static_assert(sizeof(UFortAthenaMOTDLobbyContentWidget) == 0x0002E0, "Wrong size on UFortAthenaMOTDLobbyContentWidget");

// Class FortniteUI.FortRewardNotificationData
// 0x0008 (0x0030 - 0x0028)
class UFortRewardNotificationData : public UObject
{
public:
	EFrontEndRewardType                           RewardType;                                        // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetIconBrush(struct FSlateBrush* IconBrush, EFortBrushSize BrushSize);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortRewardNotificationData">();
	}
	static class UFortRewardNotificationData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRewardNotificationData>();
	}
};
static_assert(alignof(UFortRewardNotificationData) == 0x000008, "Wrong alignment on UFortRewardNotificationData");
static_assert(sizeof(UFortRewardNotificationData) == 0x000030, "Wrong size on UFortRewardNotificationData");
static_assert(offsetof(UFortRewardNotificationData, RewardType) == 0x000028, "Member 'UFortRewardNotificationData::RewardType' has a wrong offset!");

// Class FortniteUI.FortRewardCollectionBookData
// 0x0068 (0x0098 - 0x0030)
class UFortRewardCollectionBookData final : public UFortRewardNotificationData
{
public:
	struct FFortCollectionBookRewards             CollectionBookRewards;                             // 0x0030(0x0068)(BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortRewardCollectionBookData">();
	}
	static class UFortRewardCollectionBookData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRewardCollectionBookData>();
	}
};
static_assert(alignof(UFortRewardCollectionBookData) == 0x000008, "Wrong alignment on UFortRewardCollectionBookData");
static_assert(sizeof(UFortRewardCollectionBookData) == 0x000098, "Wrong size on UFortRewardCollectionBookData");
static_assert(offsetof(UFortRewardCollectionBookData, CollectionBookRewards) == 0x000030, "Member 'UFortRewardCollectionBookData::CollectionBookRewards' has a wrong offset!");

// Class FortniteUI.FortHUDElementWidget
// 0x0040 (0x0298 - 0x0258)
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ElementTag;                                        // 0x0260(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  HUDElementTag;                                     // 0x0268(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	ESlateVisibility                              HiddenVisibility;                                  // 0x0288(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTutorialHighlight*                     TutorialHighlight;                                 // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleOnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenHUDElementTags);
	void HandleOnHUDResetToDefaults();
	void OnVisibilitySetEvent(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHUDElementWidget">();
	}
	static class UFortHUDElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHUDElementWidget>();
	}
};
static_assert(alignof(UFortHUDElementWidget) == 0x000008, "Wrong alignment on UFortHUDElementWidget");
static_assert(sizeof(UFortHUDElementWidget) == 0x000298, "Wrong size on UFortHUDElementWidget");
static_assert(offsetof(UFortHUDElementWidget, ElementTag) == 0x000260, "Member 'UFortHUDElementWidget::ElementTag' has a wrong offset!");
static_assert(offsetof(UFortHUDElementWidget, HUDElementTag) == 0x000268, "Member 'UFortHUDElementWidget::HUDElementTag' has a wrong offset!");
static_assert(offsetof(UFortHUDElementWidget, HiddenVisibility) == 0x000288, "Member 'UFortHUDElementWidget::HiddenVisibility' has a wrong offset!");
static_assert(offsetof(UFortHUDElementWidget, TutorialHighlight) == 0x000290, "Member 'UFortHUDElementWidget::TutorialHighlight' has a wrong offset!");

// Class FortniteUI.FortOptionsTab
// 0x0050 (0x0320 - 0x02D0)
class UFortOptionsTab : public UCommonActivatableWidget
{
public:
	TMulticastInlineDelegate<void()>              OnTabSettingChanged;                               // 0x02D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnTabActivated;                                    // 0x02E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnTabDeactivated;                                  // 0x02F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class UCommonListView*                        TabListView;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESettingTab                                   TabType;                                           // 0x0308(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortSettingInfo*>               TabSettingsData;                                   // 0x0310(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	bool AreParentalControlsEnabled();
	void CenterOnTab();
	void ConstructSettingList();
	bool IsAthena();
	bool IsPS4Platform();
	bool IsSwitchPlatform();
	bool IsXboxPlatform();
	void ResetOptionsToDefault();
	bool ShouldShowSetting(const struct FSettingData& SettingData);
	void TempNew_UpdateOptionsTab();
	void UpdateOptions(bool UpdateQuality);
	void UpdateOptionsTab();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortOptionsTab">();
	}
	static class UFortOptionsTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortOptionsTab>();
	}
};
static_assert(alignof(UFortOptionsTab) == 0x000008, "Wrong alignment on UFortOptionsTab");
static_assert(sizeof(UFortOptionsTab) == 0x000320, "Wrong size on UFortOptionsTab");
static_assert(offsetof(UFortOptionsTab, OnTabSettingChanged) == 0x0002D0, "Member 'UFortOptionsTab::OnTabSettingChanged' has a wrong offset!");
static_assert(offsetof(UFortOptionsTab, OnTabActivated) == 0x0002E0, "Member 'UFortOptionsTab::OnTabActivated' has a wrong offset!");
static_assert(offsetof(UFortOptionsTab, OnTabDeactivated) == 0x0002F0, "Member 'UFortOptionsTab::OnTabDeactivated' has a wrong offset!");
static_assert(offsetof(UFortOptionsTab, TabListView) == 0x000300, "Member 'UFortOptionsTab::TabListView' has a wrong offset!");
static_assert(offsetof(UFortOptionsTab, TabType) == 0x000308, "Member 'UFortOptionsTab::TabType' has a wrong offset!");
static_assert(offsetof(UFortOptionsTab, TabSettingsData) == 0x000310, "Member 'UFortOptionsTab::TabSettingsData' has a wrong offset!");

// Class FortniteUI.FortOptionsTab_NewSystemShim
// 0x0010 (0x0330 - 0x0320)
class UFortOptionsTab_NewSystemShim : public UFortOptionsTab
{
public:
	class UFortSettingsPanel*                     Settings_Panel;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortGameSettingRegistry*               Registry;                                          // 0x0328(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	bool AttemptToPopNavigation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortOptionsTab_NewSystemShim">();
	}
	static class UFortOptionsTab_NewSystemShim* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortOptionsTab_NewSystemShim>();
	}
};
static_assert(alignof(UFortOptionsTab_NewSystemShim) == 0x000008, "Wrong alignment on UFortOptionsTab_NewSystemShim");
static_assert(sizeof(UFortOptionsTab_NewSystemShim) == 0x000330, "Wrong size on UFortOptionsTab_NewSystemShim");
static_assert(offsetof(UFortOptionsTab_NewSystemShim, Settings_Panel) == 0x000320, "Member 'UFortOptionsTab_NewSystemShim::Settings_Panel' has a wrong offset!");
static_assert(offsetof(UFortOptionsTab_NewSystemShim, Registry) == 0x000328, "Member 'UFortOptionsTab_NewSystemShim::Registry' has a wrong offset!");

// Class FortniteUI.FortTabAudioOptions_TempNew
// 0x0000 (0x0330 - 0x0330)
class UFortTabAudioOptions_TempNew : public UFortOptionsTab_NewSystemShim
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTabAudioOptions_TempNew">();
	}
	static class UFortTabAudioOptions_TempNew* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTabAudioOptions_TempNew>();
	}
};
static_assert(alignof(UFortTabAudioOptions_TempNew) == 0x000008, "Wrong alignment on UFortTabAudioOptions_TempNew");
static_assert(sizeof(UFortTabAudioOptions_TempNew) == 0x000330, "Wrong size on UFortTabAudioOptions_TempNew");

// Class FortniteUI.LTMWidgetBase
// 0x0050 (0x02E8 - 0x0298)
class ULTMWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_298[0x40];                                     // 0x0298(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AFortGameplayMutator>       MutatorClassToWaitFor;                             // 0x02D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E0[0x1];                                      // 0x02E0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPrioritizedWidgetData             PrioritizationData;                                // 0x02E1(0x0002)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E3[0x5];                                      // 0x02E3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void K2_OnBecomeActive();
	void K2_OnBecomeInactive();
	void OnGamePhaseChanged(EAthenaGamePhase NewPhase);
	void OnHandleSpectatingChanged(class AFortPlayerStateZone* SpectatingTarget);
	void OnStompedByOtherWidget();
	void OnStompFailed();

	uint8 GetViewingTeam() const;
	bool K2_HasActiveContent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LTMWidgetBase">();
	}
	static class ULTMWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULTMWidgetBase>();
	}
};
static_assert(alignof(ULTMWidgetBase) == 0x000008, "Wrong alignment on ULTMWidgetBase");
static_assert(sizeof(ULTMWidgetBase) == 0x0002E8, "Wrong size on ULTMWidgetBase");
static_assert(offsetof(ULTMWidgetBase, MutatorClassToWaitFor) == 0x0002D8, "Member 'ULTMWidgetBase::MutatorClassToWaitFor' has a wrong offset!");
static_assert(offsetof(ULTMWidgetBase, PrioritizationData) == 0x0002E1, "Member 'ULTMWidgetBase::PrioritizationData' has a wrong offset!");

// Class FortniteUI.FortActivatablePanelWithItemPreview
// 0x0128 (0x0560 - 0x0438)
class UFortActivatablePanelWithItemPreview : public UFortActivatablePanel
{
public:
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemView*                          ItemViewObject;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewUnifiedSupportsCameraControlInputAction;   // 0x0448(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewUnifiedZoomInputAction;                    // 0x0458(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewZoomOutInputAction;                        // 0x0468(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewZoomInInputAction;                         // 0x0478(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewRotateInputAction;                         // 0x0488(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_498[0x94];                                     // 0x0498(0x0094)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          AllowItemRotation;                                 // 0x052C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          AllowItemZooming;                                  // 0x052D(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          AutomaticallyRegisterCameraView;                   // 0x052E(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          OverrideFixedCameras;                              // 0x052F(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             ActionDataTable;                                   // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       AnimationToHideItemInfo;                           // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoShowDetails;                                  // 0x0540(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bItemDetailsHidden;                                // 0x0541(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_542[0x2];                                      // 0x0542(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HideItemInfoHeaderDurationSecs;                    // 0x0544(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_548[0x18];                                     // 0x0548(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UWidget* GetWidgetForFramingViewedItem();
	void HideItemDetails();
	void OnCosmeticSpecialActionPressed_0(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_1(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_2(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_3(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_4(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_5(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_6(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_7(bool* bPassThrough);
	void OnItemPreviewChanged(class AActor* NewPrefab, class UFortItem* NewItem);
	void OnVaultItemsViewed(const TArray<class UFortItem*>& Items);
	void ShowItemDetails();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivatablePanelWithItemPreview">();
	}
	static class UFortActivatablePanelWithItemPreview* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatablePanelWithItemPreview>();
	}
};
static_assert(alignof(UFortActivatablePanelWithItemPreview) == 0x000008, "Wrong alignment on UFortActivatablePanelWithItemPreview");
static_assert(sizeof(UFortActivatablePanelWithItemPreview) == 0x000560, "Wrong size on UFortActivatablePanelWithItemPreview");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewObject) == 0x000440, "Member 'UFortActivatablePanelWithItemPreview::ItemViewObject' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewUnifiedSupportsCameraControlInputAction) == 0x000448, "Member 'UFortActivatablePanelWithItemPreview::ItemViewUnifiedSupportsCameraControlInputAction' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewUnifiedZoomInputAction) == 0x000458, "Member 'UFortActivatablePanelWithItemPreview::ItemViewUnifiedZoomInputAction' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewZoomOutInputAction) == 0x000468, "Member 'UFortActivatablePanelWithItemPreview::ItemViewZoomOutInputAction' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewZoomInInputAction) == 0x000478, "Member 'UFortActivatablePanelWithItemPreview::ItemViewZoomInInputAction' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewRotateInputAction) == 0x000488, "Member 'UFortActivatablePanelWithItemPreview::ItemViewRotateInputAction' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, AllowItemRotation) == 0x00052C, "Member 'UFortActivatablePanelWithItemPreview::AllowItemRotation' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, AllowItemZooming) == 0x00052D, "Member 'UFortActivatablePanelWithItemPreview::AllowItemZooming' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, AutomaticallyRegisterCameraView) == 0x00052E, "Member 'UFortActivatablePanelWithItemPreview::AutomaticallyRegisterCameraView' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, OverrideFixedCameras) == 0x00052F, "Member 'UFortActivatablePanelWithItemPreview::OverrideFixedCameras' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ActionDataTable) == 0x000530, "Member 'UFortActivatablePanelWithItemPreview::ActionDataTable' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, AnimationToHideItemInfo) == 0x000538, "Member 'UFortActivatablePanelWithItemPreview::AnimationToHideItemInfo' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, bAutoShowDetails) == 0x000540, "Member 'UFortActivatablePanelWithItemPreview::bAutoShowDetails' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, bItemDetailsHidden) == 0x000541, "Member 'UFortActivatablePanelWithItemPreview::bItemDetailsHidden' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, HideItemInfoHeaderDurationSecs) == 0x000544, "Member 'UFortActivatablePanelWithItemPreview::HideItemInfoHeaderDurationSecs' has a wrong offset!");

// Class FortniteUI.BattlePassViewAllRewardsScreen
// 0x0058 (0x05B8 - 0x0560)
class UBattlePassViewAllRewardsScreen : public UFortActivatablePanelWithItemPreview
{
public:
	uint8                                         Pad_560[0x8];                                      // 0x0560(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              LastViewedItem;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UBattlePassViewRewardData*>      AllRewardItems;                                    // 0x0570(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	float                                         StaggerTime;                                       // 0x0580(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_584[0x4];                                      // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_SortLabel;                                    // 0x0588(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_ChapterLabel;                                 // 0x0590(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_SeasonLabel;                                  // 0x0598(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                          Button_CycleSort;                                  // 0x05A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTileView*                              TileView_Rewards;                                  // 0x05A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5B0[0x8];                                      // 0x05B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnItemViewed(const class UBattlePassViewRewardData* ItemDisplayed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassViewAllRewardsScreen">();
	}
	static class UBattlePassViewAllRewardsScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassViewAllRewardsScreen>();
	}
};
static_assert(alignof(UBattlePassViewAllRewardsScreen) == 0x000008, "Wrong alignment on UBattlePassViewAllRewardsScreen");
static_assert(sizeof(UBattlePassViewAllRewardsScreen) == 0x0005B8, "Wrong size on UBattlePassViewAllRewardsScreen");
static_assert(offsetof(UBattlePassViewAllRewardsScreen, LastViewedItem) == 0x000568, "Member 'UBattlePassViewAllRewardsScreen::LastViewedItem' has a wrong offset!");
static_assert(offsetof(UBattlePassViewAllRewardsScreen, AllRewardItems) == 0x000570, "Member 'UBattlePassViewAllRewardsScreen::AllRewardItems' has a wrong offset!");
static_assert(offsetof(UBattlePassViewAllRewardsScreen, StaggerTime) == 0x000580, "Member 'UBattlePassViewAllRewardsScreen::StaggerTime' has a wrong offset!");
static_assert(offsetof(UBattlePassViewAllRewardsScreen, Text_SortLabel) == 0x000588, "Member 'UBattlePassViewAllRewardsScreen::Text_SortLabel' has a wrong offset!");
static_assert(offsetof(UBattlePassViewAllRewardsScreen, Text_ChapterLabel) == 0x000590, "Member 'UBattlePassViewAllRewardsScreen::Text_ChapterLabel' has a wrong offset!");
static_assert(offsetof(UBattlePassViewAllRewardsScreen, Text_SeasonLabel) == 0x000598, "Member 'UBattlePassViewAllRewardsScreen::Text_SeasonLabel' has a wrong offset!");
static_assert(offsetof(UBattlePassViewAllRewardsScreen, Button_CycleSort) == 0x0005A0, "Member 'UBattlePassViewAllRewardsScreen::Button_CycleSort' has a wrong offset!");
static_assert(offsetof(UBattlePassViewAllRewardsScreen, TileView_Rewards) == 0x0005A8, "Member 'UBattlePassViewAllRewardsScreen::TileView_Rewards' has a wrong offset!");

// Class FortniteUI.AshtonWidgetBase
// 0x0018 (0x0300 - 0x02E8)
class UAshtonWidgetBase final : public ULTMWidgetBase
{
public:
	class AFortAthenaMutator_Ashton*              AshtonMutatorRef;                                  // 0x02E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F0[0x10];                                     // 0x02F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCloseWidget();
	void OnOpenWidget();
	void OnStoneChanged(EAshtonStoneType StoneType, EAshtonStoneStateType StoneState);
	void OnStoneListChanged();
	void OnVillainRespawnCountChanged(int32 NumRespawnsLeft, float RespawnPercentLeft);
	void OnVillainRespawnsRemainingChanged();
	void UpdateAllUI(bool bFirstUpdate);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AshtonWidgetBase">();
	}
	static class UAshtonWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAshtonWidgetBase>();
	}
};
static_assert(alignof(UAshtonWidgetBase) == 0x000008, "Wrong alignment on UAshtonWidgetBase");
static_assert(sizeof(UAshtonWidgetBase) == 0x000300, "Wrong size on UAshtonWidgetBase");
static_assert(offsetof(UAshtonWidgetBase, AshtonMutatorRef) == 0x0002E8, "Member 'UAshtonWidgetBase::AshtonMutatorRef' has a wrong offset!");

// Class FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys
// 0x0020 (0x0050 - 0x0030)
class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              Finished;                                          // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortPlayerSurveyDispatcher*            Dispatcher;                                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* DisplaySurveys(class UFortPlayerSurveyDispatcher* Dispatcher_0, int32 SurveyCount);

	void HandleAllSurveysFinished(class UObject* Source);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys">();
	}
	static class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys>();
	}
};
static_assert(alignof(UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys) == 0x000008, "Wrong alignment on UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys");
static_assert(sizeof(UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys) == 0x000050, "Wrong size on UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys");
static_assert(offsetof(UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys, Finished) == 0x000030, "Member 'UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys::Finished' has a wrong offset!");
static_assert(offsetof(UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys, Dispatcher) == 0x000040, "Member 'UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys::Dispatcher' has a wrong offset!");

// Class FortniteUI.FortMissionTrackerEntry
// 0x00A8 (0x0300 - 0x0258)
class UFortMissionTrackerEntry final : public UCommonUserWidget
{
public:
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnMissionEntryVisibilityChanged;                   // 0x0260(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionTrackerSubEntry> SubEntryClass;                                     // 0x0270(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bConfigureAsHUD;                                   // 0x0278(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHiddenByHeightConstraint;                         // 0x0279(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_27A[0x6];                                      // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       MissionNameText;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           ObjectivesListBox;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 UpperSeparator;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortMission*                           TrackedMission;                                    // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UObject* ChangedElement)> OnSizeEstimateChangedDelegate;                     // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B0[0x50];                                     // 0x02B0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleMissionInfoSet();
	void HandleObjectivesChanged();
	void OnMissionSet();
	void UpdateVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMissionTrackerEntry">();
	}
	static class UFortMissionTrackerEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMissionTrackerEntry>();
	}
};
static_assert(alignof(UFortMissionTrackerEntry) == 0x000008, "Wrong alignment on UFortMissionTrackerEntry");
static_assert(sizeof(UFortMissionTrackerEntry) == 0x000300, "Wrong size on UFortMissionTrackerEntry");
static_assert(offsetof(UFortMissionTrackerEntry, OnMissionEntryVisibilityChanged) == 0x000260, "Member 'UFortMissionTrackerEntry::OnMissionEntryVisibilityChanged' has a wrong offset!");
static_assert(offsetof(UFortMissionTrackerEntry, SubEntryClass) == 0x000270, "Member 'UFortMissionTrackerEntry::SubEntryClass' has a wrong offset!");
static_assert(offsetof(UFortMissionTrackerEntry, bConfigureAsHUD) == 0x000278, "Member 'UFortMissionTrackerEntry::bConfigureAsHUD' has a wrong offset!");
static_assert(offsetof(UFortMissionTrackerEntry, bHiddenByHeightConstraint) == 0x000279, "Member 'UFortMissionTrackerEntry::bHiddenByHeightConstraint' has a wrong offset!");
static_assert(offsetof(UFortMissionTrackerEntry, MissionNameText) == 0x000280, "Member 'UFortMissionTrackerEntry::MissionNameText' has a wrong offset!");
static_assert(offsetof(UFortMissionTrackerEntry, ObjectivesListBox) == 0x000288, "Member 'UFortMissionTrackerEntry::ObjectivesListBox' has a wrong offset!");
static_assert(offsetof(UFortMissionTrackerEntry, UpperSeparator) == 0x000290, "Member 'UFortMissionTrackerEntry::UpperSeparator' has a wrong offset!");
static_assert(offsetof(UFortMissionTrackerEntry, TrackedMission) == 0x000298, "Member 'UFortMissionTrackerEntry::TrackedMission' has a wrong offset!");
static_assert(offsetof(UFortMissionTrackerEntry, OnSizeEstimateChangedDelegate) == 0x0002A0, "Member 'UFortMissionTrackerEntry::OnSizeEstimateChangedDelegate' has a wrong offset!");

// Class FortniteUI.BacchusHUDElement
// 0x01D0 (0x0468 - 0x0298)
class UBacchusHUDElement : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsInLayoutMode;                                   // 0x02A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           VisualType;                                        // 0x02A4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   WidgetName;                                        // 0x02B0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                          bHideWhenNotUsingTouch;                            // 0x02C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUpdatesWithHUDState;                              // 0x02C9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAlwaysShow;                                       // 0x02CA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInBuildMode;                                     // 0x02CB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInCombatMode;                                    // 0x02CC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInEditMode;                                      // 0x02CD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInCreativeMode;                                  // 0x02CE(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInBattleLabMode;                                 // 0x02CF(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          IsFreeFalling;                                     // 0x02D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          IsGliding;                                         // 0x02D1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          CanOpenChute;                                      // 0x02D2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          InLockedBus;                                       // 0x02D3(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          InUnlockedBus;                                     // 0x02D4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnTargeting;                                       // 0x02D5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnUsingScopeTargeting;                             // 0x02D6(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCanTarget;                                       // 0x02D7(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCanUseScopeTargeting;                            // 0x02D8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCrouching;                                       // 0x02D9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCanUseSecondaryAbility;                          // 0x02DA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnDBNO;                                            // 0x02DB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCarryingDBNO;                                    // 0x02DC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnControllingRCPawn;                               // 0x02DD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInVehicle;                                       // 0x02DE(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnDrivingVehicle;                                  // 0x02DF(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnZiplining;                                       // 0x02E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHUDLayoutDataEntry                    DefaultEntry;                                      // 0x02E8(0x0180)(Transient, NativeAccessSpecifierPrivate)

public:
	void HandleInputMethodChanged(ECommonInputType CurrentInputType);
	void OnHUDStateUpdate(const struct FFortHUDState& NewState);
	void ShowHighlight(bool Show);

	struct FGameplayTag BP_GetMobileVisualType() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BacchusHUDElement">();
	}
	static class UBacchusHUDElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusHUDElement>();
	}
};
static_assert(alignof(UBacchusHUDElement) == 0x000008, "Wrong alignment on UBacchusHUDElement");
static_assert(sizeof(UBacchusHUDElement) == 0x000468, "Wrong size on UBacchusHUDElement");
static_assert(offsetof(UBacchusHUDElement, bIsInLayoutMode) == 0x0002A0, "Member 'UBacchusHUDElement::bIsInLayoutMode' has a wrong offset!");
static_assert(offsetof(UBacchusHUDElement, VisualType) == 0x0002A4, "Member 'UBacchusHUDElement::VisualType' has a wrong offset!");
static_assert(offsetof(UBacchusHUDElement, WidgetName) == 0x0002B0, "Member 'UBacchusHUDElement::WidgetName' has a wrong offset!");
static_assert(offsetof(UBacchusHUDElement, bHideWhenNotUsingTouch) == 0x0002C8, "Member 'UBacchusHUDElement::bHideWhenNotUsingTouch' has a wrong offset!");
static_assert(offsetof(UBacchusHUDElement, bUpdatesWithHUDState) == 0x0002C9, "Member 'UBacchusHUDElement::bUpdatesWithHUDState' has a wrong offset!");
static_assert(offsetof(UBacchusHUDElement, bAlwaysShow) == 0x0002CA, "Member 'UBacchusHUDElement::bAlwaysShow' has a wrong offset!");
static_assert(offsetof(UBacchusHUDElement, OnInBuildMode) == 0x0002CB, "Member 'UBacchusHUDElement::OnInBuildMode' has a wrong offset!");
