#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontEnd

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FrontEnd.FrontEnd_C
// 0x0068 (0x05C8 - 0x0560)
class UFrontEnd_C final : public UFortUIStateWidget_Frontend
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaFPSTicker_C*                     AthenaFPSTicker;                                   // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaTemperature_C*                   AthenaTemperature;                                 // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBuildWatermark_C*                      BuildWatermark;                                    // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_PTT;                                        // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonToggleChat;                                  // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortVoiceChannelSpeakerContainer_C*    FortVoiceChannelSpeakerContainer;                  // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PTT_Image;                                         // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_2;                                        // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxPTT;                                        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          StartedPlayingVideo;                               // 0x05B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B9[0x3];                                      // 0x05B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AthenaEventVideoID;                                // 0x05BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void LoadTrailer(class UActivatableMovieWidget_Frontend_C* ActivatableMovieWidget, int32 VideoIndex, bool* Return_Value);
	void PlayTrailer(int32 VideoIndex);
	void InitChatVisibilityButton();
	void UpdatePttVisibility(EPTTState PTTState);
	void SetOverlayTitleBarVisibility(bool Visible);
	void SetChatWidgetVisibility(bool Visible);
	class UWidget* PopContentWidgetInternal(const struct FContentPushState& State);
	void HandleEnterFrontend(EFortUIState UIState);
	void Finished_74C01B50486C9D234AEBBB83F5C50040();
	void Finished_10D32F9F43CC39E50616E5BD00C13DDE();
	void PushContentWidgetInternal(class UWidget* Widget, const struct FContentPushState& State);
	void OnFrontEndVisibilityUpdated(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void Construct();
	void Loading_Screen_Changed(bool IsVisible_0);
	void BndEvt__ButtonToggleChat_K2Node_ComponentBoundEvent_39_CommonSelectedStateChanged__DelegateSignature(class UCommonButton* Button, bool Selected);
	void On_Can_PTT();
	void OnEnterState(EFortUIState PreviousUIState);
	void On_Social_Import_Closed();
	void OnMovieFinished();
	void BndEvt__Button_PTT_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void On_Crossplay_Widget_Closed_1();
	void RevisitStartupFlow();
	void ExecuteUbergraph_FrontEnd(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FrontEnd_C">();
	}
	static class UFrontEnd_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFrontEnd_C>();
	}
};
static_assert(alignof(UFrontEnd_C) == 0x000008, "Wrong alignment on UFrontEnd_C");
static_assert(sizeof(UFrontEnd_C) == 0x0005C8, "Wrong size on UFrontEnd_C");
static_assert(offsetof(UFrontEnd_C, UberGraphFrame) == 0x000560, "Member 'UFrontEnd_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, AthenaFPSTicker) == 0x000568, "Member 'UFrontEnd_C::AthenaFPSTicker' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, AthenaTemperature) == 0x000570, "Member 'UFrontEnd_C::AthenaTemperature' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, BuildWatermark) == 0x000578, "Member 'UFrontEnd_C::BuildWatermark' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, Button_PTT) == 0x000580, "Member 'UFrontEnd_C::Button_PTT' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, ButtonToggleChat) == 0x000588, "Member 'UFrontEnd_C::ButtonToggleChat' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, FortVoiceChannelSpeakerContainer) == 0x000590, "Member 'UFrontEnd_C::FortVoiceChannelSpeakerContainer' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, PTT_Image) == 0x000598, "Member 'UFrontEnd_C::PTT_Image' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, SafeZone_1) == 0x0005A0, "Member 'UFrontEnd_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, SafeZone_2) == 0x0005A8, "Member 'UFrontEnd_C::SafeZone_2' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, SizeBoxPTT) == 0x0005B0, "Member 'UFrontEnd_C::SizeBoxPTT' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, StartedPlayingVideo) == 0x0005B8, "Member 'UFrontEnd_C::StartedPlayingVideo' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, AthenaEventVideoID) == 0x0005BC, "Member 'UFrontEnd_C::AthenaEventVideoID' has a wrong offset!");

}

