#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Device_Floor_EliminationZone

#include "Basic.hpp"

#include "GA_TrapGeneric_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Device_Floor_EliminationZone.GA_Device_Floor_EliminationZone_C
// 0x0080 (0x0AE0 - 0x0A60)
class UGA_Device_Floor_EliminationZone_C final : public UGA_TrapGeneric_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Device_Floor_EliminationZone_C;  // 0x0A60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTimerHandle                           CheckActivationHandle;                             // 0x0A68(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ADevice_Floor_EliminationZone_C*        OwningTrap;                                        // 0x0A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              UpdatedSpecHandle;                                 // 0x0A78(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GameplayEffectDamageClass;                         // 0x0A88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDOTBased;                                         // 0x0A90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A91[0x7];                                      // 0x0A91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GameplayEffectTrueDamageClass;                     // 0x0A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         PlayersInVehicle;                                  // 0x0AA0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	struct FGameplayTag                           ActivateTrapCue;                                   // 0x0AB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DOTCue;                                            // 0x0AB8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TC_DamageDotApplied;                               // 0x0AC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Device_Floor_EliminationZone(int32 EntryPoint);
	void ExecuteActivateTrapGameplayCue();
	void GA_LifeTimer();
	void K2_ActivateAbility();
	void Targeted_FDB0569E41B2D20233CC5FAB885737C4(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_FDB0569E41B2D20233CC5FAB885737C4(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void ParseTargetData(const struct FGameplayAbilityTargetDataHandle& TargetData);
	void UpdateSpecHandle();
	void ApplyToPawn(class AFortPawn* Pawn, bool* PawnAffected);
	void ApplyToVehicle(TScriptInterface<class IFortVehicleInterface> VehicleInterface, class AActor* VehicleActor);
	void IsPawnsTeamAffected(class AFortPawn* PlayerPawn, bool* bIsAffected);
	void ApplyToRift(class ABuildingRift* Rift);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Device_Floor_EliminationZone_C">();
	}
	static class UGA_Device_Floor_EliminationZone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Device_Floor_EliminationZone_C>();
	}
};
static_assert(alignof(UGA_Device_Floor_EliminationZone_C) == 0x000008, "Wrong alignment on UGA_Device_Floor_EliminationZone_C");
static_assert(sizeof(UGA_Device_Floor_EliminationZone_C) == 0x000AE0, "Wrong size on UGA_Device_Floor_EliminationZone_C");
static_assert(offsetof(UGA_Device_Floor_EliminationZone_C, UberGraphFrame_GA_Device_Floor_EliminationZone_C) == 0x000A60, "Member 'UGA_Device_Floor_EliminationZone_C::UberGraphFrame_GA_Device_Floor_EliminationZone_C' has a wrong offset!");
static_assert(offsetof(UGA_Device_Floor_EliminationZone_C, CheckActivationHandle) == 0x000A68, "Member 'UGA_Device_Floor_EliminationZone_C::CheckActivationHandle' has a wrong offset!");
static_assert(offsetof(UGA_Device_Floor_EliminationZone_C, OwningTrap) == 0x000A70, "Member 'UGA_Device_Floor_EliminationZone_C::OwningTrap' has a wrong offset!");
static_assert(offsetof(UGA_Device_Floor_EliminationZone_C, UpdatedSpecHandle) == 0x000A78, "Member 'UGA_Device_Floor_EliminationZone_C::UpdatedSpecHandle' has a wrong offset!");
static_assert(offsetof(UGA_Device_Floor_EliminationZone_C, GameplayEffectDamageClass) == 0x000A88, "Member 'UGA_Device_Floor_EliminationZone_C::GameplayEffectDamageClass' has a wrong offset!");
static_assert(offsetof(UGA_Device_Floor_EliminationZone_C, bDOTBased) == 0x000A90, "Member 'UGA_Device_Floor_EliminationZone_C::bDOTBased' has a wrong offset!");
static_assert(offsetof(UGA_Device_Floor_EliminationZone_C, GameplayEffectTrueDamageClass) == 0x000A98, "Member 'UGA_Device_Floor_EliminationZone_C::GameplayEffectTrueDamageClass' has a wrong offset!");
static_assert(offsetof(UGA_Device_Floor_EliminationZone_C, PlayersInVehicle) == 0x000AA0, "Member 'UGA_Device_Floor_EliminationZone_C::PlayersInVehicle' has a wrong offset!");
static_assert(offsetof(UGA_Device_Floor_EliminationZone_C, ActivateTrapCue) == 0x000AB0, "Member 'UGA_Device_Floor_EliminationZone_C::ActivateTrapCue' has a wrong offset!");
static_assert(offsetof(UGA_Device_Floor_EliminationZone_C, DOTCue) == 0x000AB8, "Member 'UGA_Device_Floor_EliminationZone_C::DOTCue' has a wrong offset!");
static_assert(offsetof(UGA_Device_Floor_EliminationZone_C, TC_DamageDotApplied) == 0x000AC0, "Member 'UGA_Device_Floor_EliminationZone_C::TC_DamageDotApplied' has a wrong offset!");

}

