#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Device_Floor_EliminationZoneEndOverlap

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Device_Floor_EliminationZoneEndOverlap.GA_Device_Floor_EliminationZoneEndOverlap_C.ExecuteUbergraph_GA_Device_Floor_EliminationZoneEndOverlap
// 0x000C (0x000C - 0x0000)
struct GA_Device_Floor_EliminationZoneEndOverlap_C_ExecuteUbergraph_GA_Device_Floor_EliminationZoneEndOverlap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveGameplayEffects_EffectsRemoved;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Device_Floor_EliminationZoneEndOverlap_C_ExecuteUbergraph_GA_Device_Floor_EliminationZoneEndOverlap) == 0x000004, "Wrong alignment on GA_Device_Floor_EliminationZoneEndOverlap_C_ExecuteUbergraph_GA_Device_Floor_EliminationZoneEndOverlap");
static_assert(sizeof(GA_Device_Floor_EliminationZoneEndOverlap_C_ExecuteUbergraph_GA_Device_Floor_EliminationZoneEndOverlap) == 0x00000C, "Wrong size on GA_Device_Floor_EliminationZoneEndOverlap_C_ExecuteUbergraph_GA_Device_Floor_EliminationZoneEndOverlap");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_ExecuteUbergraph_GA_Device_Floor_EliminationZoneEndOverlap, EntryPoint) == 0x000000, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_ExecuteUbergraph_GA_Device_Floor_EliminationZoneEndOverlap::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_ExecuteUbergraph_GA_Device_Floor_EliminationZoneEndOverlap, CallFunc_RemoveGameplayEffects_EffectsRemoved) == 0x000004, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_ExecuteUbergraph_GA_Device_Floor_EliminationZoneEndOverlap::CallFunc_RemoveGameplayEffects_EffectsRemoved' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_ExecuteUbergraph_GA_Device_Floor_EliminationZoneEndOverlap, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_ExecuteUbergraph_GA_Device_Floor_EliminationZoneEndOverlap::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function GA_Device_Floor_EliminationZoneEndOverlap.GA_Device_Floor_EliminationZoneEndOverlap_C.RemoveGameplayEffects
// 0x0088 (0x0088 - 0x0000)
struct GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EffectsRemoved;                                    // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                Passengers;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	int32                                         TotalEffectsRemoved;                               // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllPassengers_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue_1; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects) == 0x000008, "Wrong alignment on GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects");
static_assert(sizeof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects) == 0x000088, "Wrong size on GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, Actor) == 0x000000, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::Actor' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, EffectsRemoved) == 0x000008, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::EffectsRemoved' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, Passengers) == 0x000010, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::Passengers' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, TotalEffectsRemoved) == 0x000020, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::TotalEffectsRemoved' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000028, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, CallFunc_GetAllPassengers_ReturnValue) == 0x000040, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::CallFunc_GetAllPassengers_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000050, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, CallFunc_RemoveActiveEffectsWithTags_ReturnValue) == 0x000058, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::CallFunc_RemoveActiveEffectsWithTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, Temp_int_Array_Index_Variable) == 0x000064, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, CallFunc_Array_Get_Item) == 0x000068, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000070, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, CallFunc_RemoveActiveEffectsWithTags_ReturnValue_1) == 0x000078, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::CallFunc_RemoveActiveEffectsWithTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, CallFunc_IsValid_ReturnValue_1) == 0x00007C, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects, CallFunc_Add_IntInt_ReturnValue_1) == 0x000080, "Member 'GA_Device_Floor_EliminationZoneEndOverlap_C_RemoveGameplayEffects::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

}

