#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Galileo_Lobster_Passive

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Galileo_Lobster_Passive.GA_Galileo_Lobster_Passive_C
// 0x0058 (0x0A88 - 0x0A30)
class UGA_Galileo_Lobster_Passive_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  SwimmingTags;                                      // 0x0A40(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   HolsterId;                                         // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_InWater;                                        // 0x0A68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_LoopingAudio;                                   // 0x0A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            InWaterHandle;                                     // 0x0A78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            LoopingAudioHandle;                                // 0x0A80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Galileo_Lobster_Passive(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnPawnLanded_Event_0(const struct FHitResult& Hit);
	void OnDied_Event_0(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void Added_838B8ED24C4D728B5BB3BB8B8253BE08();
	void Added_E9A8A7364DBFC90032650CA00A7539D1();
	void Removed_AAEFAAA5419B598A3E4ADA8A42217856();
	void Removed_CE5C9557470B10E5B9612EAC35369FE7();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Galileo_Lobster_Passive_C">();
	}
	static class UGA_Galileo_Lobster_Passive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Galileo_Lobster_Passive_C>();
	}
};
static_assert(alignof(UGA_Galileo_Lobster_Passive_C) == 0x000008, "Wrong alignment on UGA_Galileo_Lobster_Passive_C");
static_assert(sizeof(UGA_Galileo_Lobster_Passive_C) == 0x000A88, "Wrong size on UGA_Galileo_Lobster_Passive_C");
static_assert(offsetof(UGA_Galileo_Lobster_Passive_C, UberGraphFrame) == 0x000A30, "Member 'UGA_Galileo_Lobster_Passive_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Galileo_Lobster_Passive_C, PlayerPawn) == 0x000A38, "Member 'UGA_Galileo_Lobster_Passive_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Galileo_Lobster_Passive_C, SwimmingTags) == 0x000A40, "Member 'UGA_Galileo_Lobster_Passive_C::SwimmingTags' has a wrong offset!");
static_assert(offsetof(UGA_Galileo_Lobster_Passive_C, HolsterId) == 0x000A60, "Member 'UGA_Galileo_Lobster_Passive_C::HolsterId' has a wrong offset!");
static_assert(offsetof(UGA_Galileo_Lobster_Passive_C, GE_InWater) == 0x000A68, "Member 'UGA_Galileo_Lobster_Passive_C::GE_InWater' has a wrong offset!");
static_assert(offsetof(UGA_Galileo_Lobster_Passive_C, GE_LoopingAudio) == 0x000A70, "Member 'UGA_Galileo_Lobster_Passive_C::GE_LoopingAudio' has a wrong offset!");
static_assert(offsetof(UGA_Galileo_Lobster_Passive_C, InWaterHandle) == 0x000A78, "Member 'UGA_Galileo_Lobster_Passive_C::InWaterHandle' has a wrong offset!");
static_assert(offsetof(UGA_Galileo_Lobster_Passive_C, LoopingAudioHandle) == 0x000A80, "Member 'UGA_Galileo_Lobster_Passive_C::LoopingAudioHandle' has a wrong offset!");

}

