#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Galileo_Lobster_Passive

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Galileo_Lobster_Passive.GA_Galileo_Lobster_Passive_C.ExecuteUbergraph_GA_Galileo_Lobster_Passive
// 0x01C8 (0x01C8 - 0x0000)
struct GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_1;         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue_1;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x012C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x01B4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x01C0(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive) == 0x000008, "Wrong alignment on GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive");
static_assert(sizeof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive) == 0x0001C8, "Wrong size on GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, EntryPoint) == 0x000000, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_CreateDelegate_OutputDelegate_4) == 0x000044, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_CreateDelegate_OutputDelegate_5) == 0x000054, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000068, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000070, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, CallFunc_IsValid_ReturnValue_1) == 0x000079, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000080, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000090, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, CallFunc_BooleanOR_ReturnValue) == 0x000091, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_CustomEvent_DamagedActor) == 0x000098, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_CustomEvent_Damage) == 0x0000A0, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_CustomEvent_InstigatedBy) == 0x0000A8, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_CustomEvent_DamageCauser) == 0x0000B0, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_CustomEvent_HitLocation) == 0x0000B8, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_CustomEvent_FHitComponent) == 0x0000C8, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_CustomEvent_BoneName) == 0x0000D0, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_CustomEvent_Momentum) == 0x0000D8, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, CallFunc_WaitGameplayTagAdd_ReturnValue_1) == 0x0000E8, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::CallFunc_WaitGameplayTagAdd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, CallFunc_WaitGameplayTagRemove_ReturnValue_1) == 0x0000F0, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::CallFunc_WaitGameplayTagRemove_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, CallFunc_IsValid_ReturnValue_2) == 0x0000F8, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, CallFunc_IsValid_ReturnValue_3) == 0x0000F9, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000100, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000108, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x000118, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x000128, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_CustomEvent_Hit) == 0x00012C, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0001B4, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, K2Node_Event_bWasCancelled) == 0x0001BC, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x0001C0, "Member 'GA_Galileo_Lobster_Passive_C_ExecuteUbergraph_GA_Galileo_Lobster_Passive::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");

// Function GA_Galileo_Lobster_Passive.GA_Galileo_Lobster_Passive_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Galileo_Lobster_Passive_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Galileo_Lobster_Passive_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Galileo_Lobster_Passive_C_K2_OnEndAbility");
static_assert(sizeof(GA_Galileo_Lobster_Passive_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Galileo_Lobster_Passive_C_K2_OnEndAbility");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Galileo_Lobster_Passive_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Galileo_Lobster_Passive.GA_Galileo_Lobster_Passive_C.OnPawnLanded_Event_0
// 0x0088 (0x0088 - 0x0000)
struct GA_Galileo_Lobster_Passive_C_OnPawnLanded_Event_0 final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_Galileo_Lobster_Passive_C_OnPawnLanded_Event_0) == 0x000004, "Wrong alignment on GA_Galileo_Lobster_Passive_C_OnPawnLanded_Event_0");
static_assert(sizeof(GA_Galileo_Lobster_Passive_C_OnPawnLanded_Event_0) == 0x000088, "Wrong size on GA_Galileo_Lobster_Passive_C_OnPawnLanded_Event_0");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_OnPawnLanded_Event_0, Hit) == 0x000000, "Member 'GA_Galileo_Lobster_Passive_C_OnPawnLanded_Event_0::Hit' has a wrong offset!");

// Function GA_Galileo_Lobster_Passive.GA_Galileo_Lobster_Passive_C.OnDied_Event_0
// 0x0050 (0x0050 - 0x0000)
struct GA_Galileo_Lobster_Passive_C_OnDied_Event_0 final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Galileo_Lobster_Passive_C_OnDied_Event_0) == 0x000008, "Wrong alignment on GA_Galileo_Lobster_Passive_C_OnDied_Event_0");
static_assert(sizeof(GA_Galileo_Lobster_Passive_C_OnDied_Event_0) == 0x000050, "Wrong size on GA_Galileo_Lobster_Passive_C_OnDied_Event_0");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_OnDied_Event_0, DamagedActor) == 0x000000, "Member 'GA_Galileo_Lobster_Passive_C_OnDied_Event_0::DamagedActor' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_OnDied_Event_0, Damage) == 0x000008, "Member 'GA_Galileo_Lobster_Passive_C_OnDied_Event_0::Damage' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_OnDied_Event_0, InstigatedBy) == 0x000010, "Member 'GA_Galileo_Lobster_Passive_C_OnDied_Event_0::InstigatedBy' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_OnDied_Event_0, DamageCauser) == 0x000018, "Member 'GA_Galileo_Lobster_Passive_C_OnDied_Event_0::DamageCauser' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_OnDied_Event_0, HitLocation) == 0x000020, "Member 'GA_Galileo_Lobster_Passive_C_OnDied_Event_0::HitLocation' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_OnDied_Event_0, FHitComponent) == 0x000030, "Member 'GA_Galileo_Lobster_Passive_C_OnDied_Event_0::FHitComponent' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_OnDied_Event_0, BoneName) == 0x000038, "Member 'GA_Galileo_Lobster_Passive_C_OnDied_Event_0::BoneName' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Passive_C_OnDied_Event_0, Momentum) == 0x000040, "Member 'GA_Galileo_Lobster_Passive_C_OnDied_Event_0::Momentum' has a wrong offset!");

}

