#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_BaseDespawn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_BaseDespawn.GAB_BaseDespawn_C
// 0x0018 (0x0A48 - 0x0A30)
class UGAB_BaseDespawn_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           TC_GameplayEffectInstantDeathDespawn;              // 0x0A38(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeKill;                                   // 0x0A40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         RiftRandom;                                        // 0x0A44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GAB_BaseDespawn(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_BaseDespawn_C">();
	}
	static class UGAB_BaseDespawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_BaseDespawn_C>();
	}
};
static_assert(alignof(UGAB_BaseDespawn_C) == 0x000008, "Wrong alignment on UGAB_BaseDespawn_C");
static_assert(sizeof(UGAB_BaseDespawn_C) == 0x000A48, "Wrong size on UGAB_BaseDespawn_C");
static_assert(offsetof(UGAB_BaseDespawn_C, UberGraphFrame) == 0x000A30, "Member 'UGAB_BaseDespawn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_BaseDespawn_C, TC_GameplayEffectInstantDeathDespawn) == 0x000A38, "Member 'UGAB_BaseDespawn_C::TC_GameplayEffectInstantDeathDespawn' has a wrong offset!");
static_assert(offsetof(UGAB_BaseDespawn_C, DelayBeforeKill) == 0x000A40, "Member 'UGAB_BaseDespawn_C::DelayBeforeKill' has a wrong offset!");
static_assert(offsetof(UGAB_BaseDespawn_C, RiftRandom) == 0x000A44, "Member 'UGAB_BaseDespawn_C::RiftRandom' has a wrong offset!");

}

