#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_GenericStunned

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GAB_GenericStunned.GAB_GenericStunned_C.ExecuteUbergraph_GAB_GenericStunned
// 0x0170 (0x0170 - 0x0000)
struct GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetStunTime_ReturnValue;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetActivatingAbilityComponent_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_1;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetActivatingAbilityComponent_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue_1; // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_2;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2; // 0x011C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_3; // 0x0154(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_3;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned) == 0x000008, "Wrong alignment on GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned");
static_assert(sizeof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned) == 0x000170, "Wrong size on GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, EntryPoint) == 0x000000, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, K2Node_Event_EventData) == 0x000008, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_GetActivatingPawn_ReturnValue) == 0x0000B8, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_GetStunTime_ReturnValue) == 0x0000C4, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_GetStunTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_GetActivatingAbilityComponent_ReturnValue) == 0x0000C8, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_GetActivatingAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000D0, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x0000D8, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_GetActivatingPawn_ReturnValue_1) == 0x0000E0, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_GetActivatingPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x0000E8, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, K2Node_SwitchEnum_CmpSuccess) == 0x0000F0, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_Not_PreBool_ReturnValue) == 0x0000F1, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000F2, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_GetActivatingAbilityComponent_ReturnValue_1) == 0x0000F8, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_GetActivatingAbilityComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_BooleanAND_ReturnValue) == 0x000100, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_RemoveActiveGameplayEffect_ReturnValue_1) == 0x000101, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_RemoveActiveGameplayEffect_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_GetActivatingPawn_ReturnValue_2) == 0x000108, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_GetActivatingPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000110, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2) == 0x00011C, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000124, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000130, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00013C, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_Add_VectorVector_ReturnValue) == 0x000148, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_3) == 0x000154, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_GetActivatingPawn_ReturnValue_3) == 0x000160, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_GetActivatingPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, K2Node_Event_bWasCancelled) == 0x000168, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, CallFunc_IsValid_ReturnValue_1) == 0x000169, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned, K2Node_SwitchEnum_CmpSuccess_1) == 0x00016A, "Member 'GAB_GenericStunned_C_ExecuteUbergraph_GAB_GenericStunned::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function GAB_GenericStunned.GAB_GenericStunned_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GAB_GenericStunned_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GAB_GenericStunned_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GAB_GenericStunned_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GAB_GenericStunned_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GAB_GenericStunned_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GAB_GenericStunned_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GAB_GenericStunned_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GAB_GenericStunned.GAB_GenericStunned_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GAB_GenericStunned_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_GenericStunned_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GAB_GenericStunned_C_K2_OnEndAbility");
static_assert(sizeof(GAB_GenericStunned_C_K2_OnEndAbility) == 0x000001, "Wrong size on GAB_GenericStunned_C_K2_OnEndAbility");
static_assert(offsetof(GAB_GenericStunned_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GAB_GenericStunned_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

