#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_AIBaseMelee_NoMontage

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GAB_AIBaseMelee_NoMontage.GAB_AIBaseMelee_NoMontage_C.ExecuteUbergraph_GAB_AIBaseMelee_NoMontage
// 0x0230 (0x0230 - 0x0000)
struct GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_5;                   // 0x0018(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_5;               // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_4;                   // 0x0048(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_4;               // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_3;                   // 0x0088(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_3;               // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x00D0(0x0028)()
	bool                                          CallFunc_TargetDataHasActor_ReturnValue;           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x0100(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0110(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0150(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0178(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0190(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x01D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_3;                            // 0x01D8(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue_1; // 0x0200(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_TargetDataHasActor_ReturnValue_1;         // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityTask_PlayAnimWaitTarget*    CallFunc_PlayAnimWithMontageInfoAndWaitForTrigger_ReturnValue; // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AnimationSharingEnabled_ReturnValue;      // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage) == 0x000008, "Wrong alignment on GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage");
static_assert(sizeof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage) == 0x000230, "Wrong size on GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, EntryPoint) == 0x000000, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CustomEvent_TargetData_5) == 0x000018, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CustomEvent_TargetData_5' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CustomEvent_ApplicationTag_5) == 0x000040, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CustomEvent_ApplicationTag_5' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CustomEvent_TargetData_4) == 0x000048, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CustomEvent_TargetData_4' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CustomEvent_ApplicationTag_4) == 0x000070, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CustomEvent_ApplicationTag_4' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CreateDelegate_OutputDelegate_1) == 0x000078, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CustomEvent_TargetData_3) == 0x000088, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CustomEvent_TargetData_3' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CustomEvent_ApplicationTag_3) == 0x0000B0, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CustomEvent_ApplicationTag_3' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B8, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, Temp_struct_Variable) == 0x0000C8, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, Temp_struct_Variable_1) == 0x0000D0, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, CallFunc_TargetDataHasActor_ReturnValue) == 0x0000F8, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::CallFunc_TargetDataHasActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x000100, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CustomEvent_TargetData_2) == 0x000110, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CustomEvent_ApplicationTag_2) == 0x000138, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CreateDelegate_OutputDelegate_3) == 0x000140, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CustomEvent_TargetData_1) == 0x000150, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CustomEvent_ApplicationTag_1) == 0x000178, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CreateDelegate_OutputDelegate_4) == 0x000180, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CustomEvent_TargetData) == 0x000190, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CustomEvent_ApplicationTag) == 0x0001B8, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001C0, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, Temp_struct_Variable_2) == 0x0001D0, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, Temp_struct_Variable_3) == 0x0001D8, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, CallFunc_ApplyGameplayEffectContainer_ReturnValue_1) == 0x000200, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::CallFunc_ApplyGameplayEffectContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, CallFunc_TargetDataHasActor_ReturnValue_1) == 0x000210, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::CallFunc_TargetDataHasActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, CallFunc_K2_CommitAbility_ReturnValue) == 0x000211, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000218, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, CallFunc_PlayAnimWithMontageInfoAndWaitForTrigger_ReturnValue) == 0x000220, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::CallFunc_PlayAnimWithMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, CallFunc_IsValid_ReturnValue) == 0x000228, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, CallFunc_IsValid_ReturnValue_1) == 0x000229, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage, CallFunc_AnimationSharingEnabled_ReturnValue) == 0x00022A, "Member 'GAB_AIBaseMelee_NoMontage_C_ExecuteUbergraph_GAB_AIBaseMelee_NoMontage::CallFunc_AnimationSharingEnabled_ReturnValue' has a wrong offset!");

// Function GAB_AIBaseMelee_NoMontage.GAB_AIBaseMelee_NoMontage_C.Cancelled_B887396E419FF2C0364C58B63D973822
// 0x0030 (0x0030 - 0x0000)
struct GAB_AIBaseMelee_NoMontage_C_Cancelled_B887396E419FF2C0364C58B63D973822 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AIBaseMelee_NoMontage_C_Cancelled_B887396E419FF2C0364C58B63D973822) == 0x000008, "Wrong alignment on GAB_AIBaseMelee_NoMontage_C_Cancelled_B887396E419FF2C0364C58B63D973822");
static_assert(sizeof(GAB_AIBaseMelee_NoMontage_C_Cancelled_B887396E419FF2C0364C58B63D973822) == 0x000030, "Wrong size on GAB_AIBaseMelee_NoMontage_C_Cancelled_B887396E419FF2C0364C58B63D973822");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_Cancelled_B887396E419FF2C0364C58B63D973822, TargetData) == 0x000000, "Member 'GAB_AIBaseMelee_NoMontage_C_Cancelled_B887396E419FF2C0364C58B63D973822::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_Cancelled_B887396E419FF2C0364C58B63D973822, ApplicationTag) == 0x000028, "Member 'GAB_AIBaseMelee_NoMontage_C_Cancelled_B887396E419FF2C0364C58B63D973822::ApplicationTag' has a wrong offset!");

// Function GAB_AIBaseMelee_NoMontage.GAB_AIBaseMelee_NoMontage_C.Cancelled_DB3662934464473995AE9DABED04B860
// 0x0030 (0x0030 - 0x0000)
struct GAB_AIBaseMelee_NoMontage_C_Cancelled_DB3662934464473995AE9DABED04B860 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AIBaseMelee_NoMontage_C_Cancelled_DB3662934464473995AE9DABED04B860) == 0x000008, "Wrong alignment on GAB_AIBaseMelee_NoMontage_C_Cancelled_DB3662934464473995AE9DABED04B860");
static_assert(sizeof(GAB_AIBaseMelee_NoMontage_C_Cancelled_DB3662934464473995AE9DABED04B860) == 0x000030, "Wrong size on GAB_AIBaseMelee_NoMontage_C_Cancelled_DB3662934464473995AE9DABED04B860");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_Cancelled_DB3662934464473995AE9DABED04B860, TargetData) == 0x000000, "Member 'GAB_AIBaseMelee_NoMontage_C_Cancelled_DB3662934464473995AE9DABED04B860::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_Cancelled_DB3662934464473995AE9DABED04B860, ApplicationTag) == 0x000028, "Member 'GAB_AIBaseMelee_NoMontage_C_Cancelled_DB3662934464473995AE9DABED04B860::ApplicationTag' has a wrong offset!");

// Function GAB_AIBaseMelee_NoMontage.GAB_AIBaseMelee_NoMontage_C.Completed_B887396E419FF2C0364C58B63D973822
// 0x0030 (0x0030 - 0x0000)
struct GAB_AIBaseMelee_NoMontage_C_Completed_B887396E419FF2C0364C58B63D973822 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AIBaseMelee_NoMontage_C_Completed_B887396E419FF2C0364C58B63D973822) == 0x000008, "Wrong alignment on GAB_AIBaseMelee_NoMontage_C_Completed_B887396E419FF2C0364C58B63D973822");
static_assert(sizeof(GAB_AIBaseMelee_NoMontage_C_Completed_B887396E419FF2C0364C58B63D973822) == 0x000030, "Wrong size on GAB_AIBaseMelee_NoMontage_C_Completed_B887396E419FF2C0364C58B63D973822");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_Completed_B887396E419FF2C0364C58B63D973822, TargetData) == 0x000000, "Member 'GAB_AIBaseMelee_NoMontage_C_Completed_B887396E419FF2C0364C58B63D973822::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_Completed_B887396E419FF2C0364C58B63D973822, ApplicationTag) == 0x000028, "Member 'GAB_AIBaseMelee_NoMontage_C_Completed_B887396E419FF2C0364C58B63D973822::ApplicationTag' has a wrong offset!");

// Function GAB_AIBaseMelee_NoMontage.GAB_AIBaseMelee_NoMontage_C.Completed_DB3662934464473995AE9DABED04B860
// 0x0030 (0x0030 - 0x0000)
struct GAB_AIBaseMelee_NoMontage_C_Completed_DB3662934464473995AE9DABED04B860 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AIBaseMelee_NoMontage_C_Completed_DB3662934464473995AE9DABED04B860) == 0x000008, "Wrong alignment on GAB_AIBaseMelee_NoMontage_C_Completed_DB3662934464473995AE9DABED04B860");
static_assert(sizeof(GAB_AIBaseMelee_NoMontage_C_Completed_DB3662934464473995AE9DABED04B860) == 0x000030, "Wrong size on GAB_AIBaseMelee_NoMontage_C_Completed_DB3662934464473995AE9DABED04B860");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_Completed_DB3662934464473995AE9DABED04B860, TargetData) == 0x000000, "Member 'GAB_AIBaseMelee_NoMontage_C_Completed_DB3662934464473995AE9DABED04B860::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_Completed_DB3662934464473995AE9DABED04B860, ApplicationTag) == 0x000028, "Member 'GAB_AIBaseMelee_NoMontage_C_Completed_DB3662934464473995AE9DABED04B860::ApplicationTag' has a wrong offset!");

// Function GAB_AIBaseMelee_NoMontage.GAB_AIBaseMelee_NoMontage_C.Triggered_B887396E419FF2C0364C58B63D973822
// 0x0030 (0x0030 - 0x0000)
struct GAB_AIBaseMelee_NoMontage_C_Triggered_B887396E419FF2C0364C58B63D973822 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AIBaseMelee_NoMontage_C_Triggered_B887396E419FF2C0364C58B63D973822) == 0x000008, "Wrong alignment on GAB_AIBaseMelee_NoMontage_C_Triggered_B887396E419FF2C0364C58B63D973822");
static_assert(sizeof(GAB_AIBaseMelee_NoMontage_C_Triggered_B887396E419FF2C0364C58B63D973822) == 0x000030, "Wrong size on GAB_AIBaseMelee_NoMontage_C_Triggered_B887396E419FF2C0364C58B63D973822");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_Triggered_B887396E419FF2C0364C58B63D973822, TargetData) == 0x000000, "Member 'GAB_AIBaseMelee_NoMontage_C_Triggered_B887396E419FF2C0364C58B63D973822::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_Triggered_B887396E419FF2C0364C58B63D973822, ApplicationTag) == 0x000028, "Member 'GAB_AIBaseMelee_NoMontage_C_Triggered_B887396E419FF2C0364C58B63D973822::ApplicationTag' has a wrong offset!");

// Function GAB_AIBaseMelee_NoMontage.GAB_AIBaseMelee_NoMontage_C.Triggered_DB3662934464473995AE9DABED04B860
// 0x0030 (0x0030 - 0x0000)
struct GAB_AIBaseMelee_NoMontage_C_Triggered_DB3662934464473995AE9DABED04B860 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AIBaseMelee_NoMontage_C_Triggered_DB3662934464473995AE9DABED04B860) == 0x000008, "Wrong alignment on GAB_AIBaseMelee_NoMontage_C_Triggered_DB3662934464473995AE9DABED04B860");
static_assert(sizeof(GAB_AIBaseMelee_NoMontage_C_Triggered_DB3662934464473995AE9DABED04B860) == 0x000030, "Wrong size on GAB_AIBaseMelee_NoMontage_C_Triggered_DB3662934464473995AE9DABED04B860");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_Triggered_DB3662934464473995AE9DABED04B860, TargetData) == 0x000000, "Member 'GAB_AIBaseMelee_NoMontage_C_Triggered_DB3662934464473995AE9DABED04B860::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseMelee_NoMontage_C_Triggered_DB3662934464473995AE9DABED04B860, ApplicationTag) == 0x000028, "Member 'GAB_AIBaseMelee_NoMontage_C_Triggered_DB3662934464473995AE9DABED04B860::ApplicationTag' has a wrong offset!");

}

