#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GalileoBun_Weapon_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass GalileoBun_Weapon_AnimBP.GalileoBun_Weapon_AnimBP_C
// 0x00A0 (0x0310 - 0x0270)
class UGalileoBun_Weapon_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_69012E9949F8A085D4ADF68B8DC66B48; // 0x0278(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7937EEA74160F0086EE3EFBCD3B2CB8B; // 0x02A8(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_AD6FB18F44B7FBC56BDE8D8784676C8E; // 0x02F0(0x0018)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_GalileoBun_Weapon_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GalileoBun_Weapon_AnimBP_C">();
	}
	static class UGalileoBun_Weapon_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGalileoBun_Weapon_AnimBP_C>();
	}
};
static_assert(alignof(UGalileoBun_Weapon_AnimBP_C) == 0x000010, "Wrong alignment on UGalileoBun_Weapon_AnimBP_C");
static_assert(sizeof(UGalileoBun_Weapon_AnimBP_C) == 0x000310, "Wrong size on UGalileoBun_Weapon_AnimBP_C");
static_assert(offsetof(UGalileoBun_Weapon_AnimBP_C, UberGraphFrame) == 0x000270, "Member 'UGalileoBun_Weapon_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGalileoBun_Weapon_AnimBP_C, AnimGraphNode_Root_69012E9949F8A085D4ADF68B8DC66B48) == 0x000278, "Member 'UGalileoBun_Weapon_AnimBP_C::AnimGraphNode_Root_69012E9949F8A085D4ADF68B8DC66B48' has a wrong offset!");
static_assert(offsetof(UGalileoBun_Weapon_AnimBP_C, AnimGraphNode_Slot_7937EEA74160F0086EE3EFBCD3B2CB8B) == 0x0002A8, "Member 'UGalileoBun_Weapon_AnimBP_C::AnimGraphNode_Slot_7937EEA74160F0086EE3EFBCD3B2CB8B' has a wrong offset!");
static_assert(offsetof(UGalileoBun_Weapon_AnimBP_C, AnimGraphNode_LocalRefPose_AD6FB18F44B7FBC56BDE8D8784676C8E) == 0x0002F0, "Member 'UGalileoBun_Weapon_AnimBP_C::AnimGraphNode_LocalRefPose_AD6FB18F44B7FBC56BDE8D8784676C8E' has a wrong offset!");

}

