#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GalileoPatrolLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GalileoPatrolLayerAnimBP.GalileoPatrolLayerAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct GalileoPatrolLayerAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GalileoPatrolLayerAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on GalileoPatrolLayerAnimBP_C_AnimGraph");
static_assert(sizeof(GalileoPatrolLayerAnimBP_C_AnimGraph) == 0x000010, "Wrong size on GalileoPatrolLayerAnimBP_C_AnimGraph");
static_assert(offsetof(GalileoPatrolLayerAnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'GalileoPatrolLayerAnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function GalileoPatrolLayerAnimBP.GalileoPatrolLayerAnimBP_C.ExecuteUbergraph_GalileoPatrolLayerAnimBP
// 0x0004 (0x0004 - 0x0000)
struct GalileoPatrolLayerAnimBP_C_ExecuteUbergraph_GalileoPatrolLayerAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GalileoPatrolLayerAnimBP_C_ExecuteUbergraph_GalileoPatrolLayerAnimBP) == 0x000004, "Wrong alignment on GalileoPatrolLayerAnimBP_C_ExecuteUbergraph_GalileoPatrolLayerAnimBP");
static_assert(sizeof(GalileoPatrolLayerAnimBP_C_ExecuteUbergraph_GalileoPatrolLayerAnimBP) == 0x000004, "Wrong size on GalileoPatrolLayerAnimBP_C_ExecuteUbergraph_GalileoPatrolLayerAnimBP");
static_assert(offsetof(GalileoPatrolLayerAnimBP_C_ExecuteUbergraph_GalileoPatrolLayerAnimBP, EntryPoint) == 0x000000, "Member 'GalileoPatrolLayerAnimBP_C_ExecuteUbergraph_GalileoPatrolLayerAnimBP::EntryPoint' has a wrong offset!");

// Function GalileoPatrolLayerAnimBP.GalileoPatrolLayerAnimBP_C.FullBodyOverride
// 0x0020 (0x0020 - 0x0000)
struct GalileoPatrolLayerAnimBP_C_FullBodyOverride final
{
public:
	struct FPoseLink                              PassThroughFullBodyPose;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FullBodyOverride_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GalileoPatrolLayerAnimBP_C_FullBodyOverride) == 0x000008, "Wrong alignment on GalileoPatrolLayerAnimBP_C_FullBodyOverride");
static_assert(sizeof(GalileoPatrolLayerAnimBP_C_FullBodyOverride) == 0x000020, "Wrong size on GalileoPatrolLayerAnimBP_C_FullBodyOverride");
static_assert(offsetof(GalileoPatrolLayerAnimBP_C_FullBodyOverride, PassThroughFullBodyPose) == 0x000000, "Member 'GalileoPatrolLayerAnimBP_C_FullBodyOverride::PassThroughFullBodyPose' has a wrong offset!");
static_assert(offsetof(GalileoPatrolLayerAnimBP_C_FullBodyOverride, FullBodyOverride_0) == 0x000010, "Member 'GalileoPatrolLayerAnimBP_C_FullBodyOverride::FullBodyOverride_0' has a wrong offset!");

}

