#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCL_SpookyMist_Wobble

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCL_SpookyMist_Wobble.GCL_SpookyMist_Wobble_C
// 0x0080 (0x0808 - 0x0788)
class AGCL_SpookyMist_Wobble_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0788(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        TargetPawn;                                        // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PlayerHeightOffset;                                // 0x0798(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetVelocity;                                    // 0x07A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayerVelocityMultiplier;                          // 0x07A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RadiusOfCornToWiggle;                              // 0x07AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WiggleCooldown;                                    // 0x07B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B4[0x4];                                      // 0x07B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ObjectTypes;                                       // 0x07B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         TravelTime;                                        // 0x07C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CC[0x4];                                      // 0x07CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DashStrength;                                      // 0x07D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ABuildingSMActor*>               ArrayOfActors;                                     // 0x07F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	struct FTimerHandle                           WiggleTimer;                                       // 0x0800(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCL_SpookyMist_Wobble(int32 EntryPoint);
	void WiggleActors();
	void ReceiveBeginPlay();
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCL_SpookyMist_Wobble_C">();
	}
	static class AGCL_SpookyMist_Wobble_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCL_SpookyMist_Wobble_C>();
	}
};
static_assert(alignof(AGCL_SpookyMist_Wobble_C) == 0x000008, "Wrong alignment on AGCL_SpookyMist_Wobble_C");
static_assert(sizeof(AGCL_SpookyMist_Wobble_C) == 0x000808, "Wrong size on AGCL_SpookyMist_Wobble_C");
static_assert(offsetof(AGCL_SpookyMist_Wobble_C, UberGraphFrame) == 0x000788, "Member 'AGCL_SpookyMist_Wobble_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCL_SpookyMist_Wobble_C, TargetPawn) == 0x000790, "Member 'AGCL_SpookyMist_Wobble_C::TargetPawn' has a wrong offset!");
static_assert(offsetof(AGCL_SpookyMist_Wobble_C, PlayerHeightOffset) == 0x000798, "Member 'AGCL_SpookyMist_Wobble_C::PlayerHeightOffset' has a wrong offset!");
static_assert(offsetof(AGCL_SpookyMist_Wobble_C, TargetVelocity) == 0x0007A4, "Member 'AGCL_SpookyMist_Wobble_C::TargetVelocity' has a wrong offset!");
static_assert(offsetof(AGCL_SpookyMist_Wobble_C, PlayerVelocityMultiplier) == 0x0007A8, "Member 'AGCL_SpookyMist_Wobble_C::PlayerVelocityMultiplier' has a wrong offset!");
static_assert(offsetof(AGCL_SpookyMist_Wobble_C, RadiusOfCornToWiggle) == 0x0007AC, "Member 'AGCL_SpookyMist_Wobble_C::RadiusOfCornToWiggle' has a wrong offset!");
static_assert(offsetof(AGCL_SpookyMist_Wobble_C, WiggleCooldown) == 0x0007B0, "Member 'AGCL_SpookyMist_Wobble_C::WiggleCooldown' has a wrong offset!");
static_assert(offsetof(AGCL_SpookyMist_Wobble_C, ObjectTypes) == 0x0007B8, "Member 'AGCL_SpookyMist_Wobble_C::ObjectTypes' has a wrong offset!");
static_assert(offsetof(AGCL_SpookyMist_Wobble_C, TravelTime) == 0x0007C8, "Member 'AGCL_SpookyMist_Wobble_C::TravelTime' has a wrong offset!");
static_assert(offsetof(AGCL_SpookyMist_Wobble_C, DashStrength) == 0x0007D0, "Member 'AGCL_SpookyMist_Wobble_C::DashStrength' has a wrong offset!");
static_assert(offsetof(AGCL_SpookyMist_Wobble_C, ArrayOfActors) == 0x0007F0, "Member 'AGCL_SpookyMist_Wobble_C::ArrayOfActors' has a wrong offset!");
static_assert(offsetof(AGCL_SpookyMist_Wobble_C, WiggleTimer) == 0x000800, "Member 'AGCL_SpookyMist_Wobble_C::WiggleTimer' has a wrong offset!");

}

