#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Galileo_Lobster_Deflect_Parent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GCN_Galileo_Lobster_Deflect_Parent.GCN_Galileo_Lobster_Deflect_Parent_C.OnBurst
// 0x02D0 (0x02D0 - 0x0000)
struct GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_1;                         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0130(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0158(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0178(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1; // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude_1; // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext_1; // 0x01E8(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName_1; // 0x0200(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag_1; // 0x0208(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1; // 0x0210(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1; // 0x0230(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location_1;    // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal_1;      // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator_1;  // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser_1; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject_1; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel_1; // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1; // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A[0x2];                                      // 0x029A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSoundFromBank_Sound_Exists;            // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CallFunc_GetSoundFromBank_Sound;                   // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C6[0x2];                                      // 0x02C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst) == 0x000008, "Wrong alignment on GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst");
static_assert(sizeof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst) == 0x0002D0, "Wrong size on GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, ParticleComponents) == 0x0000C0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, AudioComponents) == 0x0000D0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, BurstDecalInstance) == 0x0000E8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_Conv_FloatToString_ReturnValue) == 0x0000F8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_Array_Get_Item) == 0x000108, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_Array_Get_Item_1) == 0x000118, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_Greater_IntInt_ReturnValue) == 0x000120, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000124, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000128, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000130, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000148, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000150, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000158, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000178, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_Location) == 0x000198, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001A4, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001B0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001B8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001C0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001C8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001D0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001D4, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001D8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1) == 0x0001E0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_RawMagnitude_1) == 0x0001E4, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_RawMagnitude_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectContext_1) == 0x0001E8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectContext_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_MatchedTagName_1) == 0x000200, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_MatchedTagName_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_OriginalTag_1) == 0x000208, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_OriginalTag_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1) == 0x000210, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1) == 0x000230, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_Location_1) == 0x000250, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_Location_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_Normal_1) == 0x00025C, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_Normal_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_Instigator_1) == 0x000268, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_Instigator_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectCauser_1) == 0x000270, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectCauser_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_SourceObject_1) == 0x000278, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_SourceObject_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1) == 0x000280, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1) == 0x000288, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_AbilityLevel_1) == 0x00028C, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_AbilityLevel_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1) == 0x000290, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_Less_FloatFloat_ReturnValue) == 0x000298, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000299, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00029C, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BooleanAND_ReturnValue) == 0x0002A0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_GetOwner_ReturnValue) == 0x0002A8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_GetSoundFromBank_Sound_Exists) == 0x0002B0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_GetSoundFromBank_Sound_Exists' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_GetSoundFromBank_Sound) == 0x0002B8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_GetSoundFromBank_Sound' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_MapRangeClamped_ReturnValue) == 0x0002C0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BooleanAND_ReturnValue_1) == 0x0002C4, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, Temp_bool_Variable) == 0x0002C5, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, K2Node_Select_Default) == 0x0002C8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::K2Node_Select_Default' has a wrong offset!");

}

