#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputReflectorButton_BottomBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InputReflectorButton_BottomBar.InputReflectorButton_BottomBar_C
// 0x0100 (0x0C80 - 0x0B80)
class UInputReflectorButton_BottomBar_C final : public UCommonPopupButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              IconScale;                                         // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftSideImage;                                     // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             RightExtraContentSlot;                             // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x0BB0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateBrush                            IconBrush;                                         // 0x0BC8(0x0088)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UClass*                                 ControllerInputStyle;                              // 0x0C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 MouseKeyboardStyle;                                // 0x0C58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          ContentAlignment;                                  // 0x0C60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMouseKeyboardStyleSet;                            // 0x0C61(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C62[0x6];                                      // 0x0C62(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OverrideButtonText;                                // 0x0C68(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateInputActionIconSize();
	void ShowIcon(bool bShouldShow);
	void SetTextInternal(const class FText& InButtonText);
	void SetInitialMouseKeyboardStyle();
	void UpdateTextStyle();
	void SetContentAlignment(EHorizontalAlignment ContentAlignment_0);
	void UpdateContentAlignment();
	void SetMouseKeyboardStyle(class UClass* ControllerInputStyle_0);
	void UpdateStyle(bool UsingGamepad);
	void UpdateText();
	void SetControllerStyle(class UClass* ControllerInputStyle_0);
	void UpdateTextAndStyle(bool bUsingGamepad);
	void InitializeButton();
	void Set_Icon(const struct FSlateBrush& IconBrush_0);
	void Set_Text(const class FText& ButtonText_0);
	void OnCurrentTextStyleChanged();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void OnTriggeredInputActionChanged(const struct FDataTableRowHandle& NewTriggeredAction);
	void OnActionProgress(float HeldPercent);
	void OnActionComplete();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_InputReflectorButton_BottomBar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InputReflectorButton_BottomBar_C">();
	}
	static class UInputReflectorButton_BottomBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputReflectorButton_BottomBar_C>();
	}
};
static_assert(alignof(UInputReflectorButton_BottomBar_C) == 0x000008, "Wrong alignment on UInputReflectorButton_BottomBar_C");
static_assert(sizeof(UInputReflectorButton_BottomBar_C) == 0x000C80, "Wrong size on UInputReflectorButton_BottomBar_C");
static_assert(offsetof(UInputReflectorButton_BottomBar_C, UberGraphFrame) == 0x000B80, "Member 'UInputReflectorButton_BottomBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInputReflectorButton_BottomBar_C, CenterButtonTextWidget) == 0x000B88, "Member 'UInputReflectorButton_BottomBar_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UInputReflectorButton_BottomBar_C, ContentBorder) == 0x000B90, "Member 'UInputReflectorButton_BottomBar_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UInputReflectorButton_BottomBar_C, IconScale) == 0x000B98, "Member 'UInputReflectorButton_BottomBar_C::IconScale' has a wrong offset!");
static_assert(offsetof(UInputReflectorButton_BottomBar_C, LeftSideImage) == 0x000BA0, "Member 'UInputReflectorButton_BottomBar_C::LeftSideImage' has a wrong offset!");
static_assert(offsetof(UInputReflectorButton_BottomBar_C, RightExtraContentSlot) == 0x000BA8, "Member 'UInputReflectorButton_BottomBar_C::RightExtraContentSlot' has a wrong offset!");
static_assert(offsetof(UInputReflectorButton_BottomBar_C, ButtonText) == 0x000BB0, "Member 'UInputReflectorButton_BottomBar_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UInputReflectorButton_BottomBar_C, IconBrush) == 0x000BC8, "Member 'UInputReflectorButton_BottomBar_C::IconBrush' has a wrong offset!");
static_assert(offsetof(UInputReflectorButton_BottomBar_C, ControllerInputStyle) == 0x000C50, "Member 'UInputReflectorButton_BottomBar_C::ControllerInputStyle' has a wrong offset!");
static_assert(offsetof(UInputReflectorButton_BottomBar_C, MouseKeyboardStyle) == 0x000C58, "Member 'UInputReflectorButton_BottomBar_C::MouseKeyboardStyle' has a wrong offset!");
static_assert(offsetof(UInputReflectorButton_BottomBar_C, ContentAlignment) == 0x000C60, "Member 'UInputReflectorButton_BottomBar_C::ContentAlignment' has a wrong offset!");
static_assert(offsetof(UInputReflectorButton_BottomBar_C, bMouseKeyboardStyleSet) == 0x000C61, "Member 'UInputReflectorButton_BottomBar_C::bMouseKeyboardStyleSet' has a wrong offset!");
static_assert(offsetof(UInputReflectorButton_BottomBar_C, OverrideButtonText) == 0x000C68, "Member 'UInputReflectorButton_BottomBar_C::OverrideButtonText' has a wrong offset!");

}

