#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IntroRotatingText

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function IntroRotatingText.IntroRotatingText_C.Tick
// 0x003C (0x003C - 0x0000)
struct IntroRotatingText_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IntroRotatingText_C_Tick) == 0x000004, "Wrong alignment on IntroRotatingText_C_Tick");
static_assert(sizeof(IntroRotatingText_C_Tick) == 0x00003C, "Wrong size on IntroRotatingText_C_Tick");
static_assert(offsetof(IntroRotatingText_C_Tick, MyGeometry) == 0x000000, "Member 'IntroRotatingText_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(IntroRotatingText_C_Tick, InDeltaTime) == 0x000038, "Member 'IntroRotatingText_C_Tick::InDeltaTime' has a wrong offset!");

// Function IntroRotatingText.IntroRotatingText_C.ExecuteUbergraph_IntroRotatingText
// 0x0058 (0x0058 - 0x0000)
struct IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText) == 0x000004, "Wrong alignment on IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText");
static_assert(sizeof(IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText) == 0x000058, "Wrong size on IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText");
static_assert(offsetof(IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText, EntryPoint) == 0x000000, "Member 'IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText::EntryPoint' has a wrong offset!");
static_assert(offsetof(IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText, K2Node_Event_MyGeometry) == 0x000004, "Member 'IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText, CallFunc_Greater_IntInt_ReturnValue) == 0x000044, "Member 'IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText, Temp_int_Variable) == 0x00004C, "Member 'IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText, CallFunc_Percent_IntInt_ReturnValue) == 0x000054, "Member 'IntroRotatingText_C_ExecuteUbergraph_IntroRotatingText::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");

}

