#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemPresentationEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function ItemPresentationEntry.ItemPresentationEntry_C.ExecuteUbergraph_ItemPresentationEntry
// 0x0018 (0x0018 - 0x0000)
struct ItemPresentationEntry_C_ExecuteUbergraph_ItemPresentationEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Delay;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemPresentationEntry_C_ExecuteUbergraph_ItemPresentationEntry) == 0x000008, "Wrong alignment on ItemPresentationEntry_C_ExecuteUbergraph_ItemPresentationEntry");
static_assert(sizeof(ItemPresentationEntry_C_ExecuteUbergraph_ItemPresentationEntry) == 0x000018, "Wrong size on ItemPresentationEntry_C_ExecuteUbergraph_ItemPresentationEntry");
static_assert(offsetof(ItemPresentationEntry_C_ExecuteUbergraph_ItemPresentationEntry, EntryPoint) == 0x000000, "Member 'ItemPresentationEntry_C_ExecuteUbergraph_ItemPresentationEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemPresentationEntry_C_ExecuteUbergraph_ItemPresentationEntry, K2Node_CustomEvent_Delay) == 0x000004, "Member 'ItemPresentationEntry_C_ExecuteUbergraph_ItemPresentationEntry::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(ItemPresentationEntry_C_ExecuteUbergraph_ItemPresentationEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'ItemPresentationEntry_C_ExecuteUbergraph_ItemPresentationEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemPresentationEntry_C_ExecuteUbergraph_ItemPresentationEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'ItemPresentationEntry_C_ExecuteUbergraph_ItemPresentationEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function ItemPresentationEntry.ItemPresentationEntry_C.DelayIntroAnimation
// 0x0004 (0x0004 - 0x0000)
struct ItemPresentationEntry_C_DelayIntroAnimation final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemPresentationEntry_C_DelayIntroAnimation) == 0x000004, "Wrong alignment on ItemPresentationEntry_C_DelayIntroAnimation");
static_assert(sizeof(ItemPresentationEntry_C_DelayIntroAnimation) == 0x000004, "Wrong size on ItemPresentationEntry_C_DelayIntroAnimation");
static_assert(offsetof(ItemPresentationEntry_C_DelayIntroAnimation, Delay) == 0x000000, "Member 'ItemPresentationEntry_C_DelayIntroAnimation::Delay' has a wrong offset!");

// Function ItemPresentationEntry.ItemPresentationEntry_C.HandleHover
// 0x0018 (0x0018 - 0x0000)
struct ItemPresentationEntry_C_HandleHover final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonItemRewardIcon_C*          K2Node_DynamicCast_AsAthena_Season_Item_Reward_Icon; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemPresentationEntry_C_HandleHover) == 0x000008, "Wrong alignment on ItemPresentationEntry_C_HandleHover");
static_assert(sizeof(ItemPresentationEntry_C_HandleHover) == 0x000018, "Wrong size on ItemPresentationEntry_C_HandleHover");
static_assert(offsetof(ItemPresentationEntry_C_HandleHover, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'ItemPresentationEntry_C_HandleHover::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemPresentationEntry_C_HandleHover, K2Node_DynamicCast_AsAthena_Season_Item_Reward_Icon) == 0x000008, "Member 'ItemPresentationEntry_C_HandleHover::K2Node_DynamicCast_AsAthena_Season_Item_Reward_Icon' has a wrong offset!");
static_assert(offsetof(ItemPresentationEntry_C_HandleHover, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ItemPresentationEntry_C_HandleHover::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ItemPresentationEntry.ItemPresentationEntry_C.HandleUnhover
// 0x0018 (0x0018 - 0x0000)
struct ItemPresentationEntry_C_HandleUnhover final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonItemRewardIcon_C*          K2Node_DynamicCast_AsAthena_Season_Item_Reward_Icon; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemPresentationEntry_C_HandleUnhover) == 0x000008, "Wrong alignment on ItemPresentationEntry_C_HandleUnhover");
static_assert(sizeof(ItemPresentationEntry_C_HandleUnhover) == 0x000018, "Wrong size on ItemPresentationEntry_C_HandleUnhover");
static_assert(offsetof(ItemPresentationEntry_C_HandleUnhover, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'ItemPresentationEntry_C_HandleUnhover::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemPresentationEntry_C_HandleUnhover, K2Node_DynamicCast_AsAthena_Season_Item_Reward_Icon) == 0x000008, "Member 'ItemPresentationEntry_C_HandleUnhover::K2Node_DynamicCast_AsAthena_Season_Item_Reward_Icon' has a wrong offset!");
static_assert(offsetof(ItemPresentationEntry_C_HandleUnhover, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ItemPresentationEntry_C_HandleUnhover::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ItemPresentationEntry.ItemPresentationEntry_C.HandleSelectedAnim
// 0x0020 (0x0020 - 0x0000)
struct ItemPresentationEntry_C_HandleSelectedAnim final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonItemRewardIcon_C*          K2Node_DynamicCast_AsAthena_Season_Item_Reward_Icon; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemPresentationEntry_C_HandleSelectedAnim) == 0x000008, "Wrong alignment on ItemPresentationEntry_C_HandleSelectedAnim");
static_assert(sizeof(ItemPresentationEntry_C_HandleSelectedAnim) == 0x000020, "Wrong size on ItemPresentationEntry_C_HandleSelectedAnim");
static_assert(offsetof(ItemPresentationEntry_C_HandleSelectedAnim, CallFunc_GetEndTime_ReturnValue) == 0x000000, "Member 'ItemPresentationEntry_C_HandleSelectedAnim::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemPresentationEntry_C_HandleSelectedAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'ItemPresentationEntry_C_HandleSelectedAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemPresentationEntry_C_HandleSelectedAnim, K2Node_DynamicCast_AsAthena_Season_Item_Reward_Icon) == 0x000010, "Member 'ItemPresentationEntry_C_HandleSelectedAnim::K2Node_DynamicCast_AsAthena_Season_Item_Reward_Icon' has a wrong offset!");
static_assert(offsetof(ItemPresentationEntry_C_HandleSelectedAnim, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ItemPresentationEntry_C_HandleSelectedAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ItemPresentationEntry.ItemPresentationEntry_C.HandelDeselectedAnim
// 0x0010 (0x0010 - 0x0000)
struct ItemPresentationEntry_C_HandelDeselectedAnim final
{
public:
	class UAthenaSeasonItemRewardIcon_C*          K2Node_DynamicCast_AsAthena_Season_Item_Reward_Icon; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemPresentationEntry_C_HandelDeselectedAnim) == 0x000008, "Wrong alignment on ItemPresentationEntry_C_HandelDeselectedAnim");
static_assert(sizeof(ItemPresentationEntry_C_HandelDeselectedAnim) == 0x000010, "Wrong size on ItemPresentationEntry_C_HandelDeselectedAnim");
static_assert(offsetof(ItemPresentationEntry_C_HandelDeselectedAnim, K2Node_DynamicCast_AsAthena_Season_Item_Reward_Icon) == 0x000000, "Member 'ItemPresentationEntry_C_HandelDeselectedAnim::K2Node_DynamicCast_AsAthena_Season_Item_Reward_Icon' has a wrong offset!");
static_assert(offsetof(ItemPresentationEntry_C_HandelDeselectedAnim, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'ItemPresentationEntry_C_HandelDeselectedAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

