#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemShopStandaloneModalPopup

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemShopStandaloneModalPopup.ItemShopStandaloneModalPopup_C
// 0x0028 (0x04E8 - 0x04C0)
class UItemShopStandaloneModalPopup_C final : public UFortStandaloneModalPopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       comArrowsIn;                                       // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Darken_1;                                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PopUpBgarrows;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FEventReply TapToClose(const struct FGeometry& MyGeometry, struct FPointerEvent& Mouse_Event);
	void Construct();
	void BndEvt__Button_ItemShop_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_ItemShopStandaloneModalPopup(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemShopStandaloneModalPopup_C">();
	}
	static class UItemShopStandaloneModalPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemShopStandaloneModalPopup_C>();
	}
};
static_assert(alignof(UItemShopStandaloneModalPopup_C) == 0x000008, "Wrong alignment on UItemShopStandaloneModalPopup_C");
static_assert(sizeof(UItemShopStandaloneModalPopup_C) == 0x0004E8, "Wrong size on UItemShopStandaloneModalPopup_C");
static_assert(offsetof(UItemShopStandaloneModalPopup_C, UberGraphFrame) == 0x0004C0, "Member 'UItemShopStandaloneModalPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemShopStandaloneModalPopup_C, FadeOut) == 0x0004C8, "Member 'UItemShopStandaloneModalPopup_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UItemShopStandaloneModalPopup_C, comArrowsIn) == 0x0004D0, "Member 'UItemShopStandaloneModalPopup_C::comArrowsIn' has a wrong offset!");
static_assert(offsetof(UItemShopStandaloneModalPopup_C, Darken_1) == 0x0004D8, "Member 'UItemShopStandaloneModalPopup_C::Darken_1' has a wrong offset!");
static_assert(offsetof(UItemShopStandaloneModalPopup_C, PopUpBgarrows) == 0x0004E0, "Member 'UItemShopStandaloneModalPopup_C::PopUpBgarrows' has a wrong offset!");

}

