#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemNotification

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemNotification.ItemNotification_C
// 0x0040 (0x04C8 - 0x0488)
class UItemNotification_C final : public UFortItemNotification
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Content_Intro;                                     // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Content_Fade;                                      // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fade;                                              // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InitialState;                                      // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backplate;                                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Content;                                  // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemNotification(int32 EntryPoint);
	void OnSetButtonText(bool bCanCloseWidget);
	void Construct();
	void HandleFade();
	void HandleInitialState();
	void HandleIntro();
	void OnCloseScreen();
	void OnNextItemDisplay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemNotification_C">();
	}
	static class UItemNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemNotification_C>();
	}
};
static_assert(alignof(UItemNotification_C) == 0x000008, "Wrong alignment on UItemNotification_C");
static_assert(sizeof(UItemNotification_C) == 0x0004C8, "Wrong size on UItemNotification_C");
static_assert(offsetof(UItemNotification_C, UberGraphFrame) == 0x000488, "Member 'UItemNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemNotification_C, Content_Intro) == 0x000490, "Member 'UItemNotification_C::Content_Intro' has a wrong offset!");
static_assert(offsetof(UItemNotification_C, Content_Fade) == 0x000498, "Member 'UItemNotification_C::Content_Fade' has a wrong offset!");
static_assert(offsetof(UItemNotification_C, Fade) == 0x0004A0, "Member 'UItemNotification_C::Fade' has a wrong offset!");
static_assert(offsetof(UItemNotification_C, InitialState) == 0x0004A8, "Member 'UItemNotification_C::InitialState' has a wrong offset!");
static_assert(offsetof(UItemNotification_C, Intro) == 0x0004B0, "Member 'UItemNotification_C::Intro' has a wrong offset!");
static_assert(offsetof(UItemNotification_C, Backplate) == 0x0004B8, "Member 'UItemNotification_C::Backplate' has a wrong offset!");
static_assert(offsetof(UItemNotification_C, SafeZone_Content) == 0x0004C0, "Member 'UItemNotification_C::SafeZone_Content' has a wrong offset!");

}

