#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LargeTileStorefront

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LargeTileStorefront.LargeTileStorefront_C
// 0x0028 (0x03B0 - 0x0388)
class ULargeTileStorefront_C final : public UAthenaItemShopSection_Storefront
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_NoCV_1;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NoOffersBox;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_EntryBox_Offers;                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Offers;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnSectionEstablished(bool bEmptySection);
	void ExecuteUbergraph_LargeTileStorefront(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LargeTileStorefront_C">();
	}
	static class ULargeTileStorefront_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULargeTileStorefront_C>();
	}
};
static_assert(alignof(ULargeTileStorefront_C) == 0x000008, "Wrong alignment on ULargeTileStorefront_C");
static_assert(sizeof(ULargeTileStorefront_C) == 0x0003B0, "Wrong size on ULargeTileStorefront_C");
static_assert(offsetof(ULargeTileStorefront_C, UberGraphFrame) == 0x000388, "Member 'ULargeTileStorefront_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULargeTileStorefront_C, Border_NoCV_1) == 0x000390, "Member 'ULargeTileStorefront_C::Border_NoCV_1' has a wrong offset!");
static_assert(offsetof(ULargeTileStorefront_C, NoOffersBox) == 0x000398, "Member 'ULargeTileStorefront_C::NoOffersBox' has a wrong offset!");
static_assert(offsetof(ULargeTileStorefront_C, Overlay_EntryBox_Offers) == 0x0003A0, "Member 'ULargeTileStorefront_C::Overlay_EntryBox_Offers' has a wrong offset!");
static_assert(offsetof(ULargeTileStorefront_C, Switcher_Offers) == 0x0003A8, "Member 'ULargeTileStorefront_C::Switcher_Offers' has a wrong offset!");

}

