#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinigameSettingsMachine

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "MinigameScoringPreset_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MinigameSettingsMachine.MinigameSettingsMachine_C
// 0x0190 (0x0490 - 0x0300)
class AMinigameSettingsMachine_C final : public AFortMinigameSettingsBuilding
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UToyOptionsComponent_C*                 ToyOptionsComponent;                               // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         GameModeIndex;                                     // 0x0310(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         TimeLimit;                                         // 0x0314(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMinigamePlayerSpawnLocationSetting       SpawnLocationSetting;                              // 0x0318(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumTeams;                                          // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	EFortMinigamePostGameSpawnLocationSetting     PostGameSpawnLocationSetting;                      // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerLives;                                       // 0x0324(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AutoEndTeamThreshold;                              // 0x0328(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TeamToMoveToWhenOutOfSpawns;                       // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumKillsForEndCondition;                           // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AutoStartDelay;                                    // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumCollectItemsForEndCondition;                    // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMinigameScoringPreset>         ScoringPresets;                                    // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay)
	TArray<class UClass*>                         TrackedStats;                                      // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         NumAIKillsForEndCondition;                         // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ScoreForEndCondition;                              // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalRounds;                                       // 0x0368(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumObjectDestroysForWin;                           // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WinnerDisplayTime;                                 // 0x0370(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScoreDisplayTime;                                  // 0x0374(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TrackedScoreStat0;                                 // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TrackedScoreStat1;                                 // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TrackedScoreStat2;                                 // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TrackedScoreStat3;                                 // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TrackedScoreStat4;                                 // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 TrackedScoreStats;                                 // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FGameplayTagContainer>          AvailableUIExtensions;                             // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FGameplayTagContainer                  CommonUIExtensions;                                // 0x03B0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         UIExtensionSetting;                                // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlaylistUserOptionIntEnum*             TrackedScoreStat0_Definition;                      // 0x03D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UPlaylistUserOptionIntEnum*             TrackedScoreStat1_Definition;                      // 0x03E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UPlaylistUserOptionIntEnum*             TrackedScoreStat2_Definition;                      // 0x03E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UPlaylistUserOptionIntEnum*             TrackedScoreStat3_Definition;                      // 0x03F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UPlaylistUserOptionIntEnum*             TrackedScoreStat4_Definition;                      // 0x03F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UPlaylistUserOptionIntEnum*             UIExtensionSetting_Definition;                     // 0x0400(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	int32                                         TeamSetting;                                       // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlaylistUserOptionIntEnum*             TeamSetting_Definition;                            // 0x0410(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          bUseIngameScoreboard;                              // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EMinigameFullscreenMapWidgetType              MinigameFullscreenMapWidgetType;                   // 0x0419(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A[0x2];                                      // 0x041A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TimerDirection;                                    // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TeamRotationSetting;                               // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RoundScoreDisplayTime;                             // 0x0424(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RoundWinnerDisplayTime;                            // 0x0428(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStopwatchMode;                                    // 0x042C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bUseSolaris;                                       // 0x042D(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          bStableTeamCosmetics;                              // 0x042E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShowCumulativeScoreOnHUD;                         // 0x042F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EMinigameWinCondition                         WinCondition;                                      // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AllTeamsMustMatchEndConditions;                    // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EndGameOnMatchPointWin;                            // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultClassSlot;                                  // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMinigameClassResetType                   ClassResetType;                                    // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMinigamePlayerPersistence                    PlayerPersistence;                                 // 0x0441(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442[0x2];                                      // 0x0442(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OnlyAllowRespawningIfPlayerStartPadsFound;         // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShowCumulativeScoreboard;                          // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMinigameGameEndCallout                       GameEndCallout;                                    // 0x044C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VictoryAudioIndex;                                 // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DrawAudioIndex;                                    // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefeatAudioIndex;                                  // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CustomVictoryCallout;                              // 0x0460(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   CustomDefeatCallout;                               // 0x0478(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_MinigameSettingsMachine(int32 EntryPoint);
	void UseSolaris(bool bShouldUse);
	void ShowSolaris();
	void AbandonMinigameHelper();
	void StartMinigameHelper();
	void OnGameSettingsUpdated();
	void ReceiveBeginPlay();
	void OnComplete_C895978B4EDC5073967F23BED63E6DB5(class UUserWidget* UserWidget);
	void GetPickupSpawnLocation(struct FVector* SpawnLocation);
	void HasMinigameStarted(bool* bHasStarted);
	void UpdateGameMode();
	void UpdateTimeLimit();
	void GetCurrentMinigame(class AFortMinigame** Minigame);
	void UpdateSpawnLocationSetting();
	void UpdateTeamSetting();
	void UpdatePostGameSpawnLocationSetting();
	void UpdatePlayerLives();
	void UpdateAutoEndTeamThreshold();
	void UpdateTeamToMoveToWhenOutOfSpawns();
	void UpdateEndConditions();
	void UpdateAutoStart();
	void TryAddEndCondition_CollectItems(TArray<struct FFortMinigameStatQuery>& EndConditions, bool* bResult);
	void UpdateJoinInProgress();
	void UpdateMinigameMutators();
	void UpdateTotalRounds();
	void TryAddEndCondition_DestroyObjects(TArray<struct FFortMinigameStatQuery>& EndConditions, bool* bResult);
	void ToggleScriptedGameRules(bool bIsScriptedGame);
	void FillTrackedStats();
	void GetScoreboardStatsArray(TArray<class UClass*>* ScoreboardStats);
	void Game_Mode_Preset_Upgrade_Path();
	void GetUIExtensions(struct FGameplayTagContainer* Return_Value);
	void UpdateClassSettings();
	void UpdatePlayerPersistence();
	void UpdateGameSettings();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;
	class FText BlueprintGetFailedInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;
	int32 GetTeamSetting() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MinigameSettingsMachine_C">();
	}
	static class AMinigameSettingsMachine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMinigameSettingsMachine_C>();
	}
};
static_assert(alignof(AMinigameSettingsMachine_C) == 0x000008, "Wrong alignment on AMinigameSettingsMachine_C");
static_assert(sizeof(AMinigameSettingsMachine_C) == 0x000490, "Wrong size on AMinigameSettingsMachine_C");
static_assert(offsetof(AMinigameSettingsMachine_C, UberGraphFrame) == 0x000300, "Member 'AMinigameSettingsMachine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, ToyOptionsComponent) == 0x000308, "Member 'AMinigameSettingsMachine_C::ToyOptionsComponent' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, GameModeIndex) == 0x000310, "Member 'AMinigameSettingsMachine_C::GameModeIndex' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TimeLimit) == 0x000314, "Member 'AMinigameSettingsMachine_C::TimeLimit' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, SpawnLocationSetting) == 0x000318, "Member 'AMinigameSettingsMachine_C::SpawnLocationSetting' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, NumTeams) == 0x00031C, "Member 'AMinigameSettingsMachine_C::NumTeams' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, PostGameSpawnLocationSetting) == 0x000320, "Member 'AMinigameSettingsMachine_C::PostGameSpawnLocationSetting' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, PlayerLives) == 0x000324, "Member 'AMinigameSettingsMachine_C::PlayerLives' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, AutoEndTeamThreshold) == 0x000328, "Member 'AMinigameSettingsMachine_C::AutoEndTeamThreshold' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TeamToMoveToWhenOutOfSpawns) == 0x00032C, "Member 'AMinigameSettingsMachine_C::TeamToMoveToWhenOutOfSpawns' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, NumKillsForEndCondition) == 0x000330, "Member 'AMinigameSettingsMachine_C::NumKillsForEndCondition' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, AutoStartDelay) == 0x000334, "Member 'AMinigameSettingsMachine_C::AutoStartDelay' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, NumCollectItemsForEndCondition) == 0x000338, "Member 'AMinigameSettingsMachine_C::NumCollectItemsForEndCondition' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, ScoringPresets) == 0x000340, "Member 'AMinigameSettingsMachine_C::ScoringPresets' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TrackedStats) == 0x000350, "Member 'AMinigameSettingsMachine_C::TrackedStats' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, NumAIKillsForEndCondition) == 0x000360, "Member 'AMinigameSettingsMachine_C::NumAIKillsForEndCondition' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, ScoreForEndCondition) == 0x000364, "Member 'AMinigameSettingsMachine_C::ScoreForEndCondition' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TotalRounds) == 0x000368, "Member 'AMinigameSettingsMachine_C::TotalRounds' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, NumObjectDestroysForWin) == 0x00036C, "Member 'AMinigameSettingsMachine_C::NumObjectDestroysForWin' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, WinnerDisplayTime) == 0x000370, "Member 'AMinigameSettingsMachine_C::WinnerDisplayTime' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, ScoreDisplayTime) == 0x000374, "Member 'AMinigameSettingsMachine_C::ScoreDisplayTime' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TrackedScoreStat0) == 0x000378, "Member 'AMinigameSettingsMachine_C::TrackedScoreStat0' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TrackedScoreStat1) == 0x00037C, "Member 'AMinigameSettingsMachine_C::TrackedScoreStat1' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TrackedScoreStat2) == 0x000380, "Member 'AMinigameSettingsMachine_C::TrackedScoreStat2' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TrackedScoreStat3) == 0x000384, "Member 'AMinigameSettingsMachine_C::TrackedScoreStat3' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TrackedScoreStat4) == 0x000388, "Member 'AMinigameSettingsMachine_C::TrackedScoreStat4' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TrackedScoreStats) == 0x000390, "Member 'AMinigameSettingsMachine_C::TrackedScoreStats' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, AvailableUIExtensions) == 0x0003A0, "Member 'AMinigameSettingsMachine_C::AvailableUIExtensions' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, CommonUIExtensions) == 0x0003B0, "Member 'AMinigameSettingsMachine_C::CommonUIExtensions' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, UIExtensionSetting) == 0x0003D0, "Member 'AMinigameSettingsMachine_C::UIExtensionSetting' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TrackedScoreStat0_Definition) == 0x0003D8, "Member 'AMinigameSettingsMachine_C::TrackedScoreStat0_Definition' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TrackedScoreStat1_Definition) == 0x0003E0, "Member 'AMinigameSettingsMachine_C::TrackedScoreStat1_Definition' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TrackedScoreStat2_Definition) == 0x0003E8, "Member 'AMinigameSettingsMachine_C::TrackedScoreStat2_Definition' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TrackedScoreStat3_Definition) == 0x0003F0, "Member 'AMinigameSettingsMachine_C::TrackedScoreStat3_Definition' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TrackedScoreStat4_Definition) == 0x0003F8, "Member 'AMinigameSettingsMachine_C::TrackedScoreStat4_Definition' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, UIExtensionSetting_Definition) == 0x000400, "Member 'AMinigameSettingsMachine_C::UIExtensionSetting_Definition' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TeamSetting) == 0x000408, "Member 'AMinigameSettingsMachine_C::TeamSetting' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TeamSetting_Definition) == 0x000410, "Member 'AMinigameSettingsMachine_C::TeamSetting_Definition' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, bUseIngameScoreboard) == 0x000418, "Member 'AMinigameSettingsMachine_C::bUseIngameScoreboard' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, MinigameFullscreenMapWidgetType) == 0x000419, "Member 'AMinigameSettingsMachine_C::MinigameFullscreenMapWidgetType' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TimerDirection) == 0x00041C, "Member 'AMinigameSettingsMachine_C::TimerDirection' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, TeamRotationSetting) == 0x000420, "Member 'AMinigameSettingsMachine_C::TeamRotationSetting' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, RoundScoreDisplayTime) == 0x000424, "Member 'AMinigameSettingsMachine_C::RoundScoreDisplayTime' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, RoundWinnerDisplayTime) == 0x000428, "Member 'AMinigameSettingsMachine_C::RoundWinnerDisplayTime' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, bStopwatchMode) == 0x00042C, "Member 'AMinigameSettingsMachine_C::bStopwatchMode' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, bUseSolaris) == 0x00042D, "Member 'AMinigameSettingsMachine_C::bUseSolaris' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, bStableTeamCosmetics) == 0x00042E, "Member 'AMinigameSettingsMachine_C::bStableTeamCosmetics' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, bShowCumulativeScoreOnHUD) == 0x00042F, "Member 'AMinigameSettingsMachine_C::bShowCumulativeScoreOnHUD' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, WinCondition) == 0x000430, "Member 'AMinigameSettingsMachine_C::WinCondition' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, AllTeamsMustMatchEndConditions) == 0x000434, "Member 'AMinigameSettingsMachine_C::AllTeamsMustMatchEndConditions' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, EndGameOnMatchPointWin) == 0x000438, "Member 'AMinigameSettingsMachine_C::EndGameOnMatchPointWin' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, DefaultClassSlot) == 0x00043C, "Member 'AMinigameSettingsMachine_C::DefaultClassSlot' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, ClassResetType) == 0x000440, "Member 'AMinigameSettingsMachine_C::ClassResetType' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, PlayerPersistence) == 0x000441, "Member 'AMinigameSettingsMachine_C::PlayerPersistence' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, OnlyAllowRespawningIfPlayerStartPadsFound) == 0x000444, "Member 'AMinigameSettingsMachine_C::OnlyAllowRespawningIfPlayerStartPadsFound' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, ShowCumulativeScoreboard) == 0x000448, "Member 'AMinigameSettingsMachine_C::ShowCumulativeScoreboard' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, GameEndCallout) == 0x00044C, "Member 'AMinigameSettingsMachine_C::GameEndCallout' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, VictoryAudioIndex) == 0x000450, "Member 'AMinigameSettingsMachine_C::VictoryAudioIndex' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, DrawAudioIndex) == 0x000454, "Member 'AMinigameSettingsMachine_C::DrawAudioIndex' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, DefeatAudioIndex) == 0x000458, "Member 'AMinigameSettingsMachine_C::DefeatAudioIndex' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, CustomVictoryCallout) == 0x000460, "Member 'AMinigameSettingsMachine_C::CustomVictoryCallout' has a wrong offset!");
static_assert(offsetof(AMinigameSettingsMachine_C, CustomDefeatCallout) == 0x000478, "Member 'AMinigameSettingsMachine_C::CustomDefeatCallout' has a wrong offset!");

}

