#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyPanel

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerSurveyPanel.PlayerSurveyPanel_C
// 0x0028 (0x0480 - 0x0458)
class UPlayerSurveyPanel_C final : public UFortPlayerSurveyPanelBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0458(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UScaleBox*                              PanelScale;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerSurveyPanelContents_C*           PlayerSurveyPanelContents;                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerSurveyPanel(int32 EntryPoint);
	void BndEvt__PlayerSurveyPanelContents_K2Node_ComponentBoundEvent_0_OnSurveyEnded__DelegateSignature();
	void BP_OnActivated();
	void Construct();
	void HandleSurveyChanged();
	void IntroDone();
	void OutroDone();
	void StartIntro();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerSurveyPanel_C">();
	}
	static class UPlayerSurveyPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerSurveyPanel_C>();
	}
};
static_assert(alignof(UPlayerSurveyPanel_C) == 0x000008, "Wrong alignment on UPlayerSurveyPanel_C");
static_assert(sizeof(UPlayerSurveyPanel_C) == 0x000480, "Wrong size on UPlayerSurveyPanel_C");
static_assert(offsetof(UPlayerSurveyPanel_C, UberGraphFrame) == 0x000458, "Member 'UPlayerSurveyPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanel_C, Outro) == 0x000460, "Member 'UPlayerSurveyPanel_C::Outro' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanel_C, Intro) == 0x000468, "Member 'UPlayerSurveyPanel_C::Intro' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanel_C, PanelScale) == 0x000470, "Member 'UPlayerSurveyPanel_C::PanelScale' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanel_C, PlayerSurveyPanelContents) == 0x000478, "Member 'UPlayerSurveyPanel_C::PlayerSurveyPanelContents' has a wrong offset!");

}

