#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_Athena_Bucket_Coal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Prj_Athena_Bucket_Coal.Prj_Athena_Bucket_Coal_C.ExecuteUbergraph_Prj_Athena_Bucket_Coal
// 0x01A0 (0x01A0 - 0x0000)
struct Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0048(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AB_BGA_Athena_EnvCampFire_C*            K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire;   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x00E0(0x00B0)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal) == 0x000008, "Wrong alignment on Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal");
static_assert(sizeof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal) == 0x0001A0, "Wrong size on Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, EntryPoint) == 0x000000, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, K2Node_Event_MyComp) == 0x000008, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, K2Node_Event_Other) == 0x000010, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, K2Node_Event_OtherComp) == 0x000018, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, K2Node_Event_bSelfMoved) == 0x000020, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, K2Node_Event_HitLocation) == 0x000024, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, K2Node_Event_HitNormal) == 0x000030, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, K2Node_Event_NormalImpulse) == 0x00003C, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, K2Node_Event_Hit) == 0x000048, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire) == 0x0000D0, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, K2Node_MakeStruct_GameplayEventData) == 0x0000E0, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000190, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, CallFunc_IsServer_ReturnValue) == 0x000191, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, Temp_bool_IsClosed_Variable) == 0x000192, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, Temp_bool_Has_Been_Initd_Variable) == 0x000193, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000194, "Member 'Prj_Athena_Bucket_Coal_C_ExecuteUbergraph_Prj_Athena_Bucket_Coal::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function Prj_Athena_Bucket_Coal.Prj_Athena_Bucket_Coal_C.ReceiveHit
// 0x00C8 (0x00C8 - 0x0000)
struct Prj_Athena_Bucket_Coal_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prj_Athena_Bucket_Coal_C_ReceiveHit) == 0x000008, "Wrong alignment on Prj_Athena_Bucket_Coal_C_ReceiveHit");
static_assert(sizeof(Prj_Athena_Bucket_Coal_C_ReceiveHit) == 0x0000C8, "Wrong size on Prj_Athena_Bucket_Coal_C_ReceiveHit");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ReceiveHit, MyComp) == 0x000000, "Member 'Prj_Athena_Bucket_Coal_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ReceiveHit, Other) == 0x000008, "Member 'Prj_Athena_Bucket_Coal_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ReceiveHit, OtherComp) == 0x000010, "Member 'Prj_Athena_Bucket_Coal_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'Prj_Athena_Bucket_Coal_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'Prj_Athena_Bucket_Coal_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ReceiveHit, HitNormal) == 0x000028, "Member 'Prj_Athena_Bucket_Coal_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'Prj_Athena_Bucket_Coal_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Bucket_Coal_C_ReceiveHit, Hit) == 0x000040, "Member 'Prj_Athena_Bucket_Coal_C_ReceiveHit::Hit' has a wrong offset!");

}

