#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_Athena_Bucket_Old

#include "Basic.hpp"

#include "B_Prj_ThrownConsumable_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prj_Athena_Bucket_Old.Prj_Athena_Bucket_Old_C
// 0x0030 (0x08F8 - 0x08C8)
class APrj_Athena_Bucket_Old_C : public AB_Prj_ThrownConsumable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prj_Athena_Bucket_Old_C;            // 0x08C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortWorldItemDefinition*               ItemToSpawn;                                       // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TurnOffFX;                                         // 0x08D8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_8D9[0x7];                                      // 0x08D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             HitMarkerSound;                                    // 0x08E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ThrowIndicator_SoundRef;                           // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldSpawnItem;                                   // 0x08F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Prj_Athena_Bucket_Old(int32 EntryPoint);
	void WaterEntered();
	void PlayHitSound();
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnRep_TurnOffFX();
	void ReceiveBeginPlay();
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prj_Athena_Bucket_Old_C">();
	}
	static class APrj_Athena_Bucket_Old_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_Athena_Bucket_Old_C>();
	}
};
static_assert(alignof(APrj_Athena_Bucket_Old_C) == 0x000008, "Wrong alignment on APrj_Athena_Bucket_Old_C");
static_assert(sizeof(APrj_Athena_Bucket_Old_C) == 0x0008F8, "Wrong size on APrj_Athena_Bucket_Old_C");
static_assert(offsetof(APrj_Athena_Bucket_Old_C, UberGraphFrame_Prj_Athena_Bucket_Old_C) == 0x0008C8, "Member 'APrj_Athena_Bucket_Old_C::UberGraphFrame_Prj_Athena_Bucket_Old_C' has a wrong offset!");
static_assert(offsetof(APrj_Athena_Bucket_Old_C, ItemToSpawn) == 0x0008D0, "Member 'APrj_Athena_Bucket_Old_C::ItemToSpawn' has a wrong offset!");
static_assert(offsetof(APrj_Athena_Bucket_Old_C, TurnOffFX) == 0x0008D8, "Member 'APrj_Athena_Bucket_Old_C::TurnOffFX' has a wrong offset!");
static_assert(offsetof(APrj_Athena_Bucket_Old_C, HitMarkerSound) == 0x0008E0, "Member 'APrj_Athena_Bucket_Old_C::HitMarkerSound' has a wrong offset!");
static_assert(offsetof(APrj_Athena_Bucket_Old_C, ThrowIndicator_SoundRef) == 0x0008E8, "Member 'APrj_Athena_Bucket_Old_C::ThrowIndicator_SoundRef' has a wrong offset!");
static_assert(offsetof(APrj_Athena_Bucket_Old_C, ShouldSpawnItem) == 0x0008F0, "Member 'APrj_Athena_Bucket_Old_C::ShouldSpawnItem' has a wrong offset!");

}

