#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_Athena_FrenchYedoc

#include "Basic.hpp"

#include "B_Prj_ThrownConsumable_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prj_Athena_FrenchYedoc.Prj_Athena_FrenchYedoc_C
// 0x0030 (0x08F8 - 0x08C8)
class APrj_Athena_FrenchYedoc_C : public AB_Prj_ThrownConsumable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prj_Athena_FrenchYedoc_C;           // 0x08C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 ActorToSpawn;                                      // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeSpawningFX;                             // 0x08D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DC[0x4];                                      // 0x08DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               BotSpawnParticleSystem;                            // 0x08E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Impact_Spawn_Sound;                                // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Water_Impact_Sound;                                // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prj_Athena_FrenchYedoc(int32 EntryPoint);
	void Play_Grenade_Impact_Sound();
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prj_Athena_FrenchYedoc_C">();
	}
	static class APrj_Athena_FrenchYedoc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_Athena_FrenchYedoc_C>();
	}
};
static_assert(alignof(APrj_Athena_FrenchYedoc_C) == 0x000008, "Wrong alignment on APrj_Athena_FrenchYedoc_C");
static_assert(sizeof(APrj_Athena_FrenchYedoc_C) == 0x0008F8, "Wrong size on APrj_Athena_FrenchYedoc_C");
static_assert(offsetof(APrj_Athena_FrenchYedoc_C, UberGraphFrame_Prj_Athena_FrenchYedoc_C) == 0x0008C8, "Member 'APrj_Athena_FrenchYedoc_C::UberGraphFrame_Prj_Athena_FrenchYedoc_C' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FrenchYedoc_C, ActorToSpawn) == 0x0008D0, "Member 'APrj_Athena_FrenchYedoc_C::ActorToSpawn' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FrenchYedoc_C, DelayBeforeSpawningFX) == 0x0008D8, "Member 'APrj_Athena_FrenchYedoc_C::DelayBeforeSpawningFX' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FrenchYedoc_C, BotSpawnParticleSystem) == 0x0008E0, "Member 'APrj_Athena_FrenchYedoc_C::BotSpawnParticleSystem' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FrenchYedoc_C, Impact_Spawn_Sound) == 0x0008E8, "Member 'APrj_Athena_FrenchYedoc_C::Impact_Spawn_Sound' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FrenchYedoc_C, Water_Impact_Sound) == 0x0008F0, "Member 'APrj_Athena_FrenchYedoc_C::Water_Impact_Sound' has a wrong offset!");

}

