#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PurchaseHistoryEntry

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PurchaseHistoryEntry.PurchaseHistoryEntry_C
// 0x0088 (0x0C18 - 0x0B90)
class UPurchaseHistoryEntry_C final : public UFortPurchaseHistoryEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          CommonBorder_ItemBackground;                       // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_XITEMS;                            // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortCosmeticItemCard_C*                DummyPreviewItemCard;                              // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortCosmeticItemCard_C*                DummyPreviewItemCard_1;                            // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortCosmeticItemCard_C*                HiddenAthenaItemCardSpacer;                        // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ItemCardHB;                                        // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_XItems;                                    // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SpecialTextSwitcher;                               // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_RefundStatus;                             // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FreeRefund;                                   // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NotEnoughTokens;                              // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Purchased;                                    // 0x0C00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Refunded;                                     // 0x0C08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DEVisDisabled;                                     // 0x0C10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C11[0x3];                                      // 0x0C11(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScrollOffset;                                      // 0x0C14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DisableAppearance(bool IsDisabled);
	void PreConstruct(bool IsDesignTime);
	void OnSetHistory(bool bHasBeenRefunded, bool bIsTokenlessRefund, bool bPlayerHasTokens);
	void UpdateItemList(const TArray<class UFortCosmeticItemCard*>& ItemCards);
	void ExecuteUbergraph_PurchaseHistoryEntry(int32 EntryPoint);
	void SetPurchaseText(const class FText& PurchaseText, bool bHasBeenRefunded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PurchaseHistoryEntry_C">();
	}
	static class UPurchaseHistoryEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPurchaseHistoryEntry_C>();
	}
};
static_assert(alignof(UPurchaseHistoryEntry_C) == 0x000008, "Wrong alignment on UPurchaseHistoryEntry_C");
static_assert(sizeof(UPurchaseHistoryEntry_C) == 0x000C18, "Wrong size on UPurchaseHistoryEntry_C");
static_assert(offsetof(UPurchaseHistoryEntry_C, UberGraphFrame) == 0x000B90, "Member 'UPurchaseHistoryEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, CommonBorder_ItemBackground) == 0x000B98, "Member 'UPurchaseHistoryEntry_C::CommonBorder_ItemBackground' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, CommonTextBlock_0) == 0x000BA0, "Member 'UPurchaseHistoryEntry_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, CommonTextBlock_XITEMS) == 0x000BA8, "Member 'UPurchaseHistoryEntry_C::CommonTextBlock_XITEMS' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, DummyPreviewItemCard) == 0x000BB0, "Member 'UPurchaseHistoryEntry_C::DummyPreviewItemCard' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, DummyPreviewItemCard_1) == 0x000BB8, "Member 'UPurchaseHistoryEntry_C::DummyPreviewItemCard_1' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, HiddenAthenaItemCardSpacer) == 0x000BC0, "Member 'UPurchaseHistoryEntry_C::HiddenAthenaItemCardSpacer' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, Image_Arrow) == 0x000BC8, "Member 'UPurchaseHistoryEntry_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, ItemCardHB) == 0x000BD0, "Member 'UPurchaseHistoryEntry_C::ItemCardHB' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, Overlay_XItems) == 0x000BD8, "Member 'UPurchaseHistoryEntry_C::Overlay_XItems' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, SpecialTextSwitcher) == 0x000BE0, "Member 'UPurchaseHistoryEntry_C::SpecialTextSwitcher' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, Switcher_RefundStatus) == 0x000BE8, "Member 'UPurchaseHistoryEntry_C::Switcher_RefundStatus' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, Text_FreeRefund) == 0x000BF0, "Member 'UPurchaseHistoryEntry_C::Text_FreeRefund' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, Text_NotEnoughTokens) == 0x000BF8, "Member 'UPurchaseHistoryEntry_C::Text_NotEnoughTokens' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, Text_Purchased) == 0x000C00, "Member 'UPurchaseHistoryEntry_C::Text_Purchased' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, Text_Refunded) == 0x000C08, "Member 'UPurchaseHistoryEntry_C::Text_Refunded' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, DEVisDisabled) == 0x000C10, "Member 'UPurchaseHistoryEntry_C::DEVisDisabled' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, ScrollOffset) == 0x000C14, "Member 'UPurchaseHistoryEntry_C::ScrollOffset' has a wrong offset!");

}

