#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PurchaseHistoryScreen

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PurchaseHistoryScreen.PurchaseHistoryScreen_C
// 0x00E0 (0x05B8 - 0x04D8)
class UPurchaseHistoryScreen_C final : public UFortPurchaseHistoryScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          Border_Summary;                                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USkewButton_C*                          Button_ClosePostApproval;                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_ItemSelect;                                 // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_Reason;                                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_SubmitRequest;                              // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber_0;                                // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CloseIcon;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        FinalSubmitSwitcher;                               // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlock*                     FortRichTextBlock_1;                               // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ItemsToReturn;                                     // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  MainSwitcher;                                      // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         MobileCloseButton;                                 // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayCloseButton;                                // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_ItemList;                                 // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ResultDesc;                                   // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ResultMtxMsg;                                 // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ResultTitle;                                  // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlock*                     Text_ReturnConfirm;                                // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTicketCounter_C*                       TicketCounter;                                     // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_ChosenItem;                                   // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_ChosenReason;                                 // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           WarningBox;                                        // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    BackAction;                                        // 0x0590(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<class UUserWidget*>                    TicketArray;                                       // 0x05A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          Should_Use_Back_Action;                            // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UpdateItemList(const TArray<class UCommonTextBlock*>& ItemsToReturn_0);
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnOpenSubmitRequest(bool bIsSelectionTokenlessRefundable);
	void ExecuteUbergraph_PurchaseHistoryScreen(int32 EntryPoint);
	void ToggleBackAction(bool bShouldShow);
	void HandleBack(bool* PassThrough);
	void OnItemRefresh(const struct FMtxPurchaseHistory& PurchaseHistory);
	void Construct();
	void OnPopulateView(EPurchaseReturnStep CurrentStep);
	void BP_OnActivated();
	void OnNoPurchasesAvailable();
	void BndEvt__Button_ItemSelect_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_Reason_K2Node_ComponentBoundEvent_18_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_ClosePostApproval_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnBeginRefundSubmission();
	void OnEndRefundSubmission(bool bSuccess, int32 MtxRefunded, class UFortItemDefinition* ReturnedItem, int32 TicketIndex, bool WasFreeRefund);
	void InitializeTickets(int32 NumTicketsAvailableToUse);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PurchaseHistoryScreen_C">();
	}
	static class UPurchaseHistoryScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPurchaseHistoryScreen_C>();
	}
};
static_assert(alignof(UPurchaseHistoryScreen_C) == 0x000008, "Wrong alignment on UPurchaseHistoryScreen_C");
static_assert(sizeof(UPurchaseHistoryScreen_C) == 0x0005B8, "Wrong size on UPurchaseHistoryScreen_C");
static_assert(offsetof(UPurchaseHistoryScreen_C, UberGraphFrame) == 0x0004D8, "Member 'UPurchaseHistoryScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, Border_Summary) == 0x0004E0, "Member 'UPurchaseHistoryScreen_C::Border_Summary' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, Button_ClosePostApproval) == 0x0004E8, "Member 'UPurchaseHistoryScreen_C::Button_ClosePostApproval' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, Button_ItemSelect) == 0x0004F0, "Member 'UPurchaseHistoryScreen_C::Button_ItemSelect' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, Button_Reason) == 0x0004F8, "Member 'UPurchaseHistoryScreen_C::Button_Reason' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, Button_SubmitRequest) == 0x000500, "Member 'UPurchaseHistoryScreen_C::Button_SubmitRequest' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, CircularThrobber_0) == 0x000508, "Member 'UPurchaseHistoryScreen_C::CircularThrobber_0' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, CloseIcon) == 0x000510, "Member 'UPurchaseHistoryScreen_C::CloseIcon' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, FinalSubmitSwitcher) == 0x000518, "Member 'UPurchaseHistoryScreen_C::FinalSubmitSwitcher' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, FortRichTextBlock_1) == 0x000520, "Member 'UPurchaseHistoryScreen_C::FortRichTextBlock_1' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, ItemsToReturn) == 0x000528, "Member 'UPurchaseHistoryScreen_C::ItemsToReturn' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, MainSwitcher) == 0x000530, "Member 'UPurchaseHistoryScreen_C::MainSwitcher' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, MobileCloseButton) == 0x000538, "Member 'UPurchaseHistoryScreen_C::MobileCloseButton' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, OverlayCloseButton) == 0x000540, "Member 'UPurchaseHistoryScreen_C::OverlayCloseButton' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, Switcher_ItemList) == 0x000548, "Member 'UPurchaseHistoryScreen_C::Switcher_ItemList' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, Text_ResultDesc) == 0x000550, "Member 'UPurchaseHistoryScreen_C::Text_ResultDesc' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, Text_ResultMtxMsg) == 0x000558, "Member 'UPurchaseHistoryScreen_C::Text_ResultMtxMsg' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, Text_ResultTitle) == 0x000560, "Member 'UPurchaseHistoryScreen_C::Text_ResultTitle' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, Text_ReturnConfirm) == 0x000568, "Member 'UPurchaseHistoryScreen_C::Text_ReturnConfirm' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, TicketCounter) == 0x000570, "Member 'UPurchaseHistoryScreen_C::TicketCounter' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, VBox_ChosenItem) == 0x000578, "Member 'UPurchaseHistoryScreen_C::VBox_ChosenItem' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, VBox_ChosenReason) == 0x000580, "Member 'UPurchaseHistoryScreen_C::VBox_ChosenReason' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, WarningBox) == 0x000588, "Member 'UPurchaseHistoryScreen_C::WarningBox' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, BackAction) == 0x000590, "Member 'UPurchaseHistoryScreen_C::BackAction' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, TicketArray) == 0x0005A0, "Member 'UPurchaseHistoryScreen_C::TicketArray' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryScreen_C, Should_Use_Back_Action) == 0x0005B0, "Member 'UPurchaseHistoryScreen_C::Should_Use_Back_Action' has a wrong offset!");

}

