#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ResizableTileStorefront

#include "Basic.hpp"


namespace SDK::Params
{

// Function ResizableTileStorefront.ResizableTileStorefront_C.OnSectionEstablished
// 0x0001 (0x0001 - 0x0000)
struct ResizableTileStorefront_C_OnSectionEstablished final
{
public:
	bool                                          bEmptySection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ResizableTileStorefront_C_OnSectionEstablished) == 0x000001, "Wrong alignment on ResizableTileStorefront_C_OnSectionEstablished");
static_assert(sizeof(ResizableTileStorefront_C_OnSectionEstablished) == 0x000001, "Wrong size on ResizableTileStorefront_C_OnSectionEstablished");
static_assert(offsetof(ResizableTileStorefront_C_OnSectionEstablished, bEmptySection) == 0x000000, "Member 'ResizableTileStorefront_C_OnSectionEstablished::bEmptySection' has a wrong offset!");

// Function ResizableTileStorefront.ResizableTileStorefront_C.ExecuteUbergraph_ResizableTileStorefront
// 0x0010 (0x0010 - 0x0000)
struct ResizableTileStorefront_C_ExecuteUbergraph_ResizableTileStorefront final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEmptySection;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ResizableTileStorefront_C_ExecuteUbergraph_ResizableTileStorefront) == 0x000008, "Wrong alignment on ResizableTileStorefront_C_ExecuteUbergraph_ResizableTileStorefront");
static_assert(sizeof(ResizableTileStorefront_C_ExecuteUbergraph_ResizableTileStorefront) == 0x000010, "Wrong size on ResizableTileStorefront_C_ExecuteUbergraph_ResizableTileStorefront");
static_assert(offsetof(ResizableTileStorefront_C_ExecuteUbergraph_ResizableTileStorefront, EntryPoint) == 0x000000, "Member 'ResizableTileStorefront_C_ExecuteUbergraph_ResizableTileStorefront::EntryPoint' has a wrong offset!");
static_assert(offsetof(ResizableTileStorefront_C_ExecuteUbergraph_ResizableTileStorefront, K2Node_Event_bEmptySection) == 0x000004, "Member 'ResizableTileStorefront_C_ExecuteUbergraph_ResizableTileStorefront::K2Node_Event_bEmptySection' has a wrong offset!");
static_assert(offsetof(ResizableTileStorefront_C_ExecuteUbergraph_ResizableTileStorefront, Temp_bool_Variable) == 0x000005, "Member 'ResizableTileStorefront_C_ExecuteUbergraph_ResizableTileStorefront::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ResizableTileStorefront_C_ExecuteUbergraph_ResizableTileStorefront, K2Node_Select_Default) == 0x000008, "Member 'ResizableTileStorefront_C_ExecuteUbergraph_ResizableTileStorefront::K2Node_Select_Default' has a wrong offset!");

}

