#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RootLayout_Athena

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RootLayout_Athena.RootLayout_Athena_C
// 0x0050 (0x0398 - 0x0348)
class URootLayout_Athena_C final : public UFortRootViewportLayout_Athena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UConfirmationWindow_C*                  ConfirmationWindow;                                // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProgressModalWidget_C*                 ControllerDisconnectedModal;                       // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bClosingErrorDialog;                               // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   QuitTitle;                                         // 0x0368(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   QuitMessage;                                       // 0x0380(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool IsConsole();
	void DialogResult_0099D78247C40A9775C753A2024EA419(EFortDialogResult Result, class FName ResultName);
	void Construct();
	void OnGameWindowCloseButtonClicked();
	void OnModalQueueEmptied_1();
	void ExecuteUbergraph_RootLayout_Athena(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RootLayout_Athena_C">();
	}
	static class URootLayout_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootLayout_Athena_C>();
	}
};
static_assert(alignof(URootLayout_Athena_C) == 0x000008, "Wrong alignment on URootLayout_Athena_C");
static_assert(sizeof(URootLayout_Athena_C) == 0x000398, "Wrong size on URootLayout_Athena_C");
static_assert(offsetof(URootLayout_Athena_C, UberGraphFrame) == 0x000348, "Member 'URootLayout_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URootLayout_Athena_C, ConfirmationWindow) == 0x000350, "Member 'URootLayout_Athena_C::ConfirmationWindow' has a wrong offset!");
static_assert(offsetof(URootLayout_Athena_C, ControllerDisconnectedModal) == 0x000358, "Member 'URootLayout_Athena_C::ControllerDisconnectedModal' has a wrong offset!");
static_assert(offsetof(URootLayout_Athena_C, bClosingErrorDialog) == 0x000360, "Member 'URootLayout_Athena_C::bClosingErrorDialog' has a wrong offset!");
static_assert(offsetof(URootLayout_Athena_C, QuitTitle) == 0x000368, "Member 'URootLayout_Athena_C::QuitTitle' has a wrong offset!");
static_assert(offsetof(URootLayout_Athena_C, QuitMessage) == 0x000380, "Member 'URootLayout_Athena_C::QuitMessage' has a wrong offset!");

}

