#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsListEntry_SubCollection

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SettingsListEntry_SubCollection.SettingsListEntry_SubCollection_C.OnSettingAssigned
// 0x0018 (0x0018 - 0x0000)
struct SettingsListEntry_SubCollection_C_OnSettingAssigned final
{
public:
	class FText                                   ActionText;                                        // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SettingsListEntry_SubCollection_C_OnSettingAssigned) == 0x000008, "Wrong alignment on SettingsListEntry_SubCollection_C_OnSettingAssigned");
static_assert(sizeof(SettingsListEntry_SubCollection_C_OnSettingAssigned) == 0x000018, "Wrong size on SettingsListEntry_SubCollection_C_OnSettingAssigned");
static_assert(offsetof(SettingsListEntry_SubCollection_C_OnSettingAssigned, ActionText) == 0x000000, "Member 'SettingsListEntry_SubCollection_C_OnSettingAssigned::ActionText' has a wrong offset!");

// Function SettingsListEntry_SubCollection.SettingsListEntry_SubCollection_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct SettingsListEntry_SubCollection_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SettingsListEntry_SubCollection_C_OnMouseLeave) == 0x000008, "Wrong alignment on SettingsListEntry_SubCollection_C_OnMouseLeave");
static_assert(sizeof(SettingsListEntry_SubCollection_C_OnMouseLeave) == 0x000070, "Wrong size on SettingsListEntry_SubCollection_C_OnMouseLeave");
static_assert(offsetof(SettingsListEntry_SubCollection_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'SettingsListEntry_SubCollection_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function SettingsListEntry_SubCollection.SettingsListEntry_SubCollection_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct SettingsListEntry_SubCollection_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SettingsListEntry_SubCollection_C_OnMouseEnter) == 0x000008, "Wrong alignment on SettingsListEntry_SubCollection_C_OnMouseEnter");
static_assert(sizeof(SettingsListEntry_SubCollection_C_OnMouseEnter) == 0x0000A8, "Wrong size on SettingsListEntry_SubCollection_C_OnMouseEnter");
static_assert(offsetof(SettingsListEntry_SubCollection_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'SettingsListEntry_SubCollection_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'SettingsListEntry_SubCollection_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function SettingsListEntry_SubCollection.SettingsListEntry_SubCollection_C.GetPrimaryGamepadFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct SettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong alignment on SettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget");
static_assert(sizeof(SettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong size on SettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget");
static_assert(offsetof(SettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget, ReturnValue) == 0x000000, "Member 'SettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget::ReturnValue' has a wrong offset!");

// Function SettingsListEntry_SubCollection.SettingsListEntry_SubCollection_C.ExecuteUbergraph_SettingsListEntry_SubCollection
// 0x0158 (0x0158 - 0x0000)
struct SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0008(0x0070)(ConstParm)
	class FText                                   K2Node_Event_ActionText;                           // 0x0078(0x0018)(ConstParm)
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x009C(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00D8(0x0070)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection) == 0x000008, "Wrong alignment on SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection");
static_assert(sizeof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection) == 0x000158, "Wrong size on SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, EntryPoint) == 0x000000, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, K2Node_Event_MouseEvent) == 0x000008, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, K2Node_Event_ActionText) == 0x000078, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::K2Node_Event_ActionText' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000090, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, K2Node_Event_MyGeometry) == 0x00009C, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, K2Node_Event_MouseEvent_1) == 0x0000D8, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000148, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, CallFunc_PlayAnimationForward_ReturnValue) == 0x000150, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

