#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SmallTileStorefront

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SmallTileStorefront.SmallTileStorefront_C
// 0x0028 (0x03B0 - 0x0388)
class USmallTileStorefront_C final : public UAthenaItemShopSection_Storefront
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_NoCV_1;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NoOffersBox;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_EntryBox_Offers;                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Offers;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnSectionEstablished(bool bEmptySection);
	void ExecuteUbergraph_SmallTileStorefront(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SmallTileStorefront_C">();
	}
	static class USmallTileStorefront_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmallTileStorefront_C>();
	}
};
static_assert(alignof(USmallTileStorefront_C) == 0x000008, "Wrong alignment on USmallTileStorefront_C");
static_assert(sizeof(USmallTileStorefront_C) == 0x0003B0, "Wrong size on USmallTileStorefront_C");
static_assert(offsetof(USmallTileStorefront_C, UberGraphFrame) == 0x000388, "Member 'USmallTileStorefront_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USmallTileStorefront_C, Border_NoCV_1) == 0x000390, "Member 'USmallTileStorefront_C::Border_NoCV_1' has a wrong offset!");
static_assert(offsetof(USmallTileStorefront_C, NoOffersBox) == 0x000398, "Member 'USmallTileStorefront_C::NoOffersBox' has a wrong offset!");
static_assert(offsetof(USmallTileStorefront_C, SizeBox_EntryBox_Offers) == 0x0003A0, "Member 'USmallTileStorefront_C::SizeBox_EntryBox_Offers' has a wrong offset!");
static_assert(offsetof(USmallTileStorefront_C, Switcher_Offers) == 0x0003A8, "Member 'USmallTileStorefront_C::Switcher_Offers' has a wrong offset!");

}

