#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanelView_UserLists

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialPanelView_UserLists.SocialPanelView_UserLists_C
// 0x00C0 (0x04E8 - 0x0428)
class USocialPanelView_UserLists_C final : public UFortSocialPanelView_UserLists
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WeGameButtonHovered;                               // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SwitcherTransition;                                // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NoFriendsArrowBounce;                              // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MenuAnchorItemOpen;                                // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open_0;                                            // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 bckgrnd;                                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_97;                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       FortMobileImage_127;                               // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MicDisabled;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_MicIcon;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_MicIcon_1;                                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_MicIcon_2;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MicIcon_3;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_TitleIcon;                                   // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_LeavePlatformPartyTitle;                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_VoiceChatDisabled;                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_VoiceChatDisabledHeader;                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_VoiceChatDisabledWarningMessage;          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_0;                                   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USocialPanel_FriendLinkButton_C*        SocialPanel_FriendLinkButton;                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LowPowerMode;                                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVoiceChannelSettings_C*                VoiceChannelSettings;                              // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SocialPanelView_UserLists(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__Switcher_UserLists_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	void Construct();
	void OnSetVoiceChannelButtonText(const class FText& ButtonText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialPanelView_UserLists_C">();
	}
	static class USocialPanelView_UserLists_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPanelView_UserLists_C>();
	}
};
static_assert(alignof(USocialPanelView_UserLists_C) == 0x000008, "Wrong alignment on USocialPanelView_UserLists_C");
static_assert(sizeof(USocialPanelView_UserLists_C) == 0x0004E8, "Wrong size on USocialPanelView_UserLists_C");
static_assert(offsetof(USocialPanelView_UserLists_C, UberGraphFrame) == 0x000428, "Member 'USocialPanelView_UserLists_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, WeGameButtonHovered) == 0x000430, "Member 'USocialPanelView_UserLists_C::WeGameButtonHovered' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, SwitcherTransition) == 0x000438, "Member 'USocialPanelView_UserLists_C::SwitcherTransition' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, NoFriendsArrowBounce) == 0x000440, "Member 'USocialPanelView_UserLists_C::NoFriendsArrowBounce' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, MenuAnchorItemOpen) == 0x000448, "Member 'USocialPanelView_UserLists_C::MenuAnchorItemOpen' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Open_0) == 0x000450, "Member 'USocialPanelView_UserLists_C::Open_0' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Open) == 0x000458, "Member 'USocialPanelView_UserLists_C::Open' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, bckgrnd) == 0x000460, "Member 'USocialPanelView_UserLists_C::bckgrnd' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, CommonRichTextBlock_97) == 0x000468, "Member 'USocialPanelView_UserLists_C::CommonRichTextBlock_97' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, FortMobileImage_127) == 0x000470, "Member 'USocialPanelView_UserLists_C::FortMobileImage_127' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Image_MicDisabled) == 0x000478, "Member 'USocialPanelView_UserLists_C::Image_MicDisabled' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Image_MicIcon) == 0x000480, "Member 'USocialPanelView_UserLists_C::Image_MicIcon' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Image_MicIcon_1) == 0x000488, "Member 'USocialPanelView_UserLists_C::Image_MicIcon_1' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Image_MicIcon_2) == 0x000490, "Member 'USocialPanelView_UserLists_C::Image_MicIcon_2' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Image_MicIcon_3) == 0x000498, "Member 'USocialPanelView_UserLists_C::Image_MicIcon_3' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Image_TitleIcon) == 0x0004A0, "Member 'USocialPanelView_UserLists_C::Image_TitleIcon' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, RichText_LeavePlatformPartyTitle) == 0x0004A8, "Member 'USocialPanelView_UserLists_C::RichText_LeavePlatformPartyTitle' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, RichText_VoiceChatDisabled) == 0x0004B0, "Member 'USocialPanelView_UserLists_C::RichText_VoiceChatDisabled' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, RichText_VoiceChatDisabledHeader) == 0x0004B8, "Member 'USocialPanelView_UserLists_C::RichText_VoiceChatDisabledHeader' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, RichText_VoiceChatDisabledWarningMessage) == 0x0004C0, "Member 'USocialPanelView_UserLists_C::RichText_VoiceChatDisabledWarningMessage' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, RichTextBlock_0) == 0x0004C8, "Member 'USocialPanelView_UserLists_C::RichTextBlock_0' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, SocialPanel_FriendLinkButton) == 0x0004D0, "Member 'USocialPanelView_UserLists_C::SocialPanel_FriendLinkButton' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Text_LowPowerMode) == 0x0004D8, "Member 'USocialPanelView_UserLists_C::Text_LowPowerMode' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, VoiceChannelSettings) == 0x0004E0, "Member 'USocialPanelView_UserLists_C::VoiceChannelSettings' has a wrong offset!");

}

