#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StandaloneSection

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StandaloneSection.StandaloneSection_C
// 0x0028 (0x03C0 - 0x0398)
class UStandaloneSection_C final : public UAthenaItemShopSection_Standalone
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_NoCV_1;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NoOffersBox;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_EntryBox_Offers;                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Offers;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnSectionEstablished(bool bEmptySection);
	void ExecuteUbergraph_StandaloneSection(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StandaloneSection_C">();
	}
	static class UStandaloneSection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStandaloneSection_C>();
	}
};
static_assert(alignof(UStandaloneSection_C) == 0x000008, "Wrong alignment on UStandaloneSection_C");
static_assert(sizeof(UStandaloneSection_C) == 0x0003C0, "Wrong size on UStandaloneSection_C");
static_assert(offsetof(UStandaloneSection_C, UberGraphFrame) == 0x000398, "Member 'UStandaloneSection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStandaloneSection_C, Border_NoCV_1) == 0x0003A0, "Member 'UStandaloneSection_C::Border_NoCV_1' has a wrong offset!");
static_assert(offsetof(UStandaloneSection_C, NoOffersBox) == 0x0003A8, "Member 'UStandaloneSection_C::NoOffersBox' has a wrong offset!");
static_assert(offsetof(UStandaloneSection_C, Overlay_EntryBox_Offers) == 0x0003B0, "Member 'UStandaloneSection_C::Overlay_EntryBox_Offers' has a wrong offset!");
static_assert(offsetof(UStandaloneSection_C, Switcher_Offers) == 0x0003B8, "Member 'UStandaloneSection_C::Switcher_Offers' has a wrong offset!");

}

