#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreSelectionPopup

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StoreSelectionPopup.StoreSelectionPopup_C
// 0x0020 (0x0460 - 0x0440)
class UStoreSelectionPopup_C final : public UFortMtxStoreSelectionPopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 SpeedLines;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StorePrompt_Header;                                // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_StoreSelectionPopup(int32 EntryPoint);
	void BP_OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StoreSelectionPopup_C">();
	}
	static class UStoreSelectionPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreSelectionPopup_C>();
	}
};
static_assert(alignof(UStoreSelectionPopup_C) == 0x000008, "Wrong alignment on UStoreSelectionPopup_C");
static_assert(sizeof(UStoreSelectionPopup_C) == 0x000460, "Wrong size on UStoreSelectionPopup_C");
static_assert(offsetof(UStoreSelectionPopup_C, UberGraphFrame) == 0x000440, "Member 'UStoreSelectionPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStoreSelectionPopup_C, Intro) == 0x000448, "Member 'UStoreSelectionPopup_C::Intro' has a wrong offset!");
static_assert(offsetof(UStoreSelectionPopup_C, SpeedLines) == 0x000450, "Member 'UStoreSelectionPopup_C::SpeedLines' has a wrong offset!");
static_assert(offsetof(UStoreSelectionPopup_C, StorePrompt_Header) == 0x000458, "Member 'UStoreSelectionPopup_C::StorePrompt_Header' has a wrong offset!");

}

