#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubgameSelect

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SubgameSelect.SubgameSelect_C
// 0x0028 (0x0480 - 0x0458)
class USubgameSelect_C final : public UFortUIStateWidget_SubgameSelect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0458(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBottomBarWidget_C*                     BottomBar;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBuildWatermark_C*                      BuildWatermark;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetStack*                     MainContentStack;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              TopBar;                                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdateHeaderAndFooter(bool HideHeader, bool HideFooter);
	class UWidget* PopContentWidgetInternal(const struct FContentPushState& State);
	void Initialize();
	void Construct();
	void OnEnterState(EFortUIState PreviousUIState);
	void PushContentWidgetInternal(class UWidget* Widget, const struct FContentPushState& State);
	void ExecuteUbergraph_SubgameSelect(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SubgameSelect_C">();
	}
	static class USubgameSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubgameSelect_C>();
	}
};
static_assert(alignof(USubgameSelect_C) == 0x000008, "Wrong alignment on USubgameSelect_C");
static_assert(sizeof(USubgameSelect_C) == 0x000480, "Wrong size on USubgameSelect_C");
static_assert(offsetof(USubgameSelect_C, UberGraphFrame) == 0x000458, "Member 'USubgameSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USubgameSelect_C, BottomBar) == 0x000460, "Member 'USubgameSelect_C::BottomBar' has a wrong offset!");
static_assert(offsetof(USubgameSelect_C, BuildWatermark) == 0x000468, "Member 'USubgameSelect_C::BuildWatermark' has a wrong offset!");
static_assert(offsetof(USubgameSelect_C, MainContentStack) == 0x000470, "Member 'USubgameSelect_C::MainContentStack' has a wrong offset!");
static_assert(offsetof(USubgameSelect_C, TopBar) == 0x000478, "Member 'USubgameSelect_C::TopBar' has a wrong offset!");

}

