#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabGameOptions

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TabGameOptions.TabGameOptions_C
// 0x0028 (0x0358 - 0x0330)
class UTabGameOptions_C final : public UFortGameOptions
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_0;                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalTabList_C*                   GameTabs;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_54;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TooltipDisplay;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_1004_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	void ExecuteUbergraph_TabGameOptions(int32 EntryPoint);
	void UpdateOptionsTab();
	void Tab_Settings_Changed();
	void OnTabActivated_Event_0();
	void Destruct();
	void Construct();
	void CenterOnTab();
	void BndEvt__GameTabs_K2Node_ComponentBoundEvent_21_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TabGameOptions_C">();
	}
	static class UTabGameOptions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTabGameOptions_C>();
	}
};
static_assert(alignof(UTabGameOptions_C) == 0x000008, "Wrong alignment on UTabGameOptions_C");
static_assert(sizeof(UTabGameOptions_C) == 0x000358, "Wrong size on UTabGameOptions_C");
static_assert(offsetof(UTabGameOptions_C, UberGraphFrame) == 0x000330, "Member 'UTabGameOptions_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTabGameOptions_C, CommonWidgetSwitcher_0) == 0x000338, "Member 'UTabGameOptions_C::CommonWidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UTabGameOptions_C, GameTabs) == 0x000340, "Member 'UTabGameOptions_C::GameTabs' has a wrong offset!");
static_assert(offsetof(UTabGameOptions_C, SafeZone_54) == 0x000348, "Member 'UTabGameOptions_C::SafeZone_54' has a wrong offset!");
static_assert(offsetof(UTabGameOptions_C, TooltipDisplay) == 0x000350, "Member 'UTabGameOptions_C::TooltipDisplay' has a wrong offset!");

}

