#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabInputOptions

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TabInputOptions.TabInputOptions_C
// 0x0058 (0x03A8 - 0x0350)
class UTabInputOptions_C final : public UFortInputOptions
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          OverlayBorder;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Currently_Selected_Input;                          // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Currently_Primary;                              // 0x0364(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool Accept_Input, class FText Overlay_Text)> Enable_Overlay;                                    // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Disable_Overlay;                                   // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Using_Gamepad;                                     // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool Gamepad_Enabled)> Gamepad_Changed;                                   // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UOptionsMenuInputDisplayOnly_C*         DisplayObject;                                     // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UnbindClicked(int32 Number_In_List, class UOptionsMenuInput_C* Widget);
	void ClearAndConstructKeybindList();
	void Input_Clicked(int32 Number_In_List, bool Is_Primary_Button);
	void UpdateOptionsTab();
	void Construct();
	void HandleChangeBinding(const struct FKey& NewKey);
	void ExecuteUbergraph_TabInputOptions(int32 EntryPoint);
	void SetupDisplayOption(int32 InputIndex, class UOptionsMenuInputDisplayOnly_C** ReturnObject);
	void Set_Input_Enabled(bool Enabled);
	void Overlay_Key_Pressed(const struct FKey& NewKey);
	void DialogResult_018CEC524FAF598D4D7A358441037217(EFortDialogResult Result, class FName ResultName);
	void CenterOnTab();
	void BndEvt__InputCommonListView_K2Node_ComponentBoundEvent_14_OnListViewItemWidgetCreated__DelegateSignature(class UUserWidget* Widget);
	void HandleUsingGamepadChanged(ECommonInputType NewInputType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TabInputOptions_C">();
	}
	static class UTabInputOptions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTabInputOptions_C>();
	}
};
static_assert(alignof(UTabInputOptions_C) == 0x000008, "Wrong alignment on UTabInputOptions_C");
static_assert(sizeof(UTabInputOptions_C) == 0x0003A8, "Wrong size on UTabInputOptions_C");
static_assert(offsetof(UTabInputOptions_C, UberGraphFrame) == 0x000350, "Member 'UTabInputOptions_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTabInputOptions_C, OverlayBorder) == 0x000358, "Member 'UTabInputOptions_C::OverlayBorder' has a wrong offset!");
static_assert(offsetof(UTabInputOptions_C, Currently_Selected_Input) == 0x000360, "Member 'UTabInputOptions_C::Currently_Selected_Input' has a wrong offset!");
static_assert(offsetof(UTabInputOptions_C, Is_Currently_Primary) == 0x000364, "Member 'UTabInputOptions_C::Is_Currently_Primary' has a wrong offset!");
static_assert(offsetof(UTabInputOptions_C, Enable_Overlay) == 0x000368, "Member 'UTabInputOptions_C::Enable_Overlay' has a wrong offset!");
static_assert(offsetof(UTabInputOptions_C, Disable_Overlay) == 0x000378, "Member 'UTabInputOptions_C::Disable_Overlay' has a wrong offset!");
static_assert(offsetof(UTabInputOptions_C, Using_Gamepad) == 0x000388, "Member 'UTabInputOptions_C::Using_Gamepad' has a wrong offset!");
static_assert(offsetof(UTabInputOptions_C, Gamepad_Changed) == 0x000390, "Member 'UTabInputOptions_C::Gamepad_Changed' has a wrong offset!");
static_assert(offsetof(UTabInputOptions_C, DisplayObject) == 0x0003A0, "Member 'UTabInputOptions_C::DisplayObject' has a wrong offset!");

}

