#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuest_ShakeIOSPrompt

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WinterQuest_ShakeIOSPrompt.WinterQuest_ShakeIOSPrompt_C
// 0x0030 (0x0BF0 - 0x0BC0)
class UWinterQuest_ShakeIOSPrompt_C final : public UFortWinterQuestButton
{
public:
	class UWidgetAnimation*                       UsingResource_Example;                             // 0x0BC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UsingResource;                                     // 0x0BC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroAnim;                                         // 0x0BD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 iOSShakeButtonBacking;                             // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PointerArrow_Left;                                 // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         HoldProgressOffset;                                // 0x0BE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WinterQuest_ShakeIOSPrompt_C">();
	}
	static class UWinterQuest_ShakeIOSPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinterQuest_ShakeIOSPrompt_C>();
	}
};
static_assert(alignof(UWinterQuest_ShakeIOSPrompt_C) == 0x000008, "Wrong alignment on UWinterQuest_ShakeIOSPrompt_C");
static_assert(sizeof(UWinterQuest_ShakeIOSPrompt_C) == 0x000BF0, "Wrong size on UWinterQuest_ShakeIOSPrompt_C");
static_assert(offsetof(UWinterQuest_ShakeIOSPrompt_C, UsingResource_Example) == 0x000BC0, "Member 'UWinterQuest_ShakeIOSPrompt_C::UsingResource_Example' has a wrong offset!");
static_assert(offsetof(UWinterQuest_ShakeIOSPrompt_C, UsingResource) == 0x000BC8, "Member 'UWinterQuest_ShakeIOSPrompt_C::UsingResource' has a wrong offset!");
static_assert(offsetof(UWinterQuest_ShakeIOSPrompt_C, IntroAnim) == 0x000BD0, "Member 'UWinterQuest_ShakeIOSPrompt_C::IntroAnim' has a wrong offset!");
static_assert(offsetof(UWinterQuest_ShakeIOSPrompt_C, iOSShakeButtonBacking) == 0x000BD8, "Member 'UWinterQuest_ShakeIOSPrompt_C::iOSShakeButtonBacking' has a wrong offset!");
static_assert(offsetof(UWinterQuest_ShakeIOSPrompt_C, PointerArrow_Left) == 0x000BE0, "Member 'UWinterQuest_ShakeIOSPrompt_C::PointerArrow_Left' has a wrong offset!");
static_assert(offsetof(UWinterQuest_ShakeIOSPrompt_C, HoldProgressOffset) == 0x000BE8, "Member 'UWinterQuest_ShakeIOSPrompt_C::HoldProgressOffset' has a wrong offset!");

}

