#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuest_ShakePrompt

#include "Basic.hpp"


namespace SDK::Params
{

// Function WinterQuest_ShakePrompt.WinterQuest_ShakePrompt_C.UpdateShakePercentage
// 0x0010 (0x0010 - 0x0000)
struct WinterQuest_ShakePrompt_C_UpdateShakePercentage final
{
public:
	float                                         InPercentage;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuest_ShakePrompt_C_UpdateShakePercentage) == 0x000008, "Wrong alignment on WinterQuest_ShakePrompt_C_UpdateShakePercentage");
static_assert(sizeof(WinterQuest_ShakePrompt_C_UpdateShakePercentage) == 0x000010, "Wrong size on WinterQuest_ShakePrompt_C_UpdateShakePercentage");
static_assert(offsetof(WinterQuest_ShakePrompt_C_UpdateShakePercentage, InPercentage) == 0x000000, "Member 'WinterQuest_ShakePrompt_C_UpdateShakePercentage::InPercentage' has a wrong offset!");
static_assert(offsetof(WinterQuest_ShakePrompt_C_UpdateShakePercentage, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WinterQuest_ShakePrompt_C_UpdateShakePercentage::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WinterQuest_ShakePrompt.WinterQuest_ShakePrompt_C.PlayShakeAnim
// 0x0008 (0x0008 - 0x0000)
struct WinterQuest_ShakePrompt_C_PlayShakeAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuest_ShakePrompt_C_PlayShakeAnim) == 0x000008, "Wrong alignment on WinterQuest_ShakePrompt_C_PlayShakeAnim");
static_assert(sizeof(WinterQuest_ShakePrompt_C_PlayShakeAnim) == 0x000008, "Wrong size on WinterQuest_ShakePrompt_C_PlayShakeAnim");
static_assert(offsetof(WinterQuest_ShakePrompt_C_PlayShakeAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WinterQuest_ShakePrompt_C_PlayShakeAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WinterQuest_ShakePrompt.WinterQuest_ShakePrompt_C.ShakeButtonIntro
// 0x0010 (0x0010 - 0x0000)
struct WinterQuest_ShakePrompt_C_ShakeButtonIntro final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuest_ShakePrompt_C_ShakeButtonIntro) == 0x000008, "Wrong alignment on WinterQuest_ShakePrompt_C_ShakeButtonIntro");
static_assert(sizeof(WinterQuest_ShakePrompt_C_ShakeButtonIntro) == 0x000010, "Wrong size on WinterQuest_ShakePrompt_C_ShakeButtonIntro");
static_assert(offsetof(WinterQuest_ShakePrompt_C_ShakeButtonIntro, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WinterQuest_ShakePrompt_C_ShakeButtonIntro::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuest_ShakePrompt_C_ShakeButtonIntro, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WinterQuest_ShakePrompt_C_ShakeButtonIntro::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

