#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuestNavigationActorIndicator

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function WinterQuestNavigationActorIndicator.WinterQuestNavigationActorIndicator_C.SetArrowAngleRotation
// 0x0028 (0x0028 - 0x0000)
struct WinterQuestNavigationActorIndicator_C_SetArrowAngleRotation final
{
public:
	float                                         Angle;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x000C(0x001C)(NoDestructor)
};
static_assert(alignof(WinterQuestNavigationActorIndicator_C_SetArrowAngleRotation) == 0x000004, "Wrong alignment on WinterQuestNavigationActorIndicator_C_SetArrowAngleRotation");
static_assert(sizeof(WinterQuestNavigationActorIndicator_C_SetArrowAngleRotation) == 0x000028, "Wrong size on WinterQuestNavigationActorIndicator_C_SetArrowAngleRotation");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_SetArrowAngleRotation, Angle) == 0x000000, "Member 'WinterQuestNavigationActorIndicator_C_SetArrowAngleRotation::Angle' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_SetArrowAngleRotation, CallFunc_Add_FloatFloat_ReturnValue) == 0x000004, "Member 'WinterQuestNavigationActorIndicator_C_SetArrowAngleRotation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_SetArrowAngleRotation, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'WinterQuestNavigationActorIndicator_C_SetArrowAngleRotation::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_SetArrowAngleRotation, K2Node_MakeStruct_WidgetTransform) == 0x00000C, "Member 'WinterQuestNavigationActorIndicator_C_SetArrowAngleRotation::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");

// Function WinterQuestNavigationActorIndicator.WinterQuestNavigationActorIndicator_C.HandleRevealStyle
// 0x00B8 (0x00B8 - 0x0000)
struct WinterQuestNavigationActorIndicator_C_HandleRevealStyle final
{
public:
	struct FGameplayTag                           Direction;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_4;                            // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_5;                            // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue_1;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle) == 0x000008, "Wrong alignment on WinterQuestNavigationActorIndicator_C_HandleRevealStyle");
static_assert(sizeof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle) == 0x0000B8, "Wrong size on WinterQuestNavigationActorIndicator_C_HandleRevealStyle");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, Direction) == 0x000000, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::Direction' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, Temp_int_Variable) == 0x000008, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x00000C, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, Temp_struct_Variable) == 0x000010, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, Temp_struct_Variable_1) == 0x000018, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, Temp_struct_Variable_2) == 0x000020, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, Temp_int_Variable_1) == 0x000028, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, Temp_struct_Variable_3) == 0x00002C, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, Temp_struct_Variable_4) == 0x000034, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, Temp_struct_Variable_5) == 0x00003C, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, CallFunc_RandomFloatInRange_ReturnValue) == 0x000044, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000048, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00004C, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000050, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, CallFunc_PlayAnimation_ReturnValue_2) == 0x000068, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, CallFunc_PlayAnimation_ReturnValue_3) == 0x000070, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, CallFunc_RandomInteger_ReturnValue) == 0x000078, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, CallFunc_RandomInteger_ReturnValue_1) == 0x00007C, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::CallFunc_RandomInteger_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, K2Node_Select_Default) == 0x000080, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, K2Node_Select_Default_1) == 0x000088, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000090, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x000094, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, CallFunc_PlayAnimation_ReturnValue_4) == 0x000098, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, CallFunc_PlayAnimation_ReturnValue_5) == 0x0000A0, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, CallFunc_PlayAnimation_ReturnValue_6) == 0x0000A8, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleRevealStyle, CallFunc_PlayAnimation_ReturnValue_7) == 0x0000B0, "Member 'WinterQuestNavigationActorIndicator_C_HandleRevealStyle::CallFunc_PlayAnimation_ReturnValue_7' has a wrong offset!");

// Function WinterQuestNavigationActorIndicator.WinterQuestNavigationActorIndicator_C.SetButtonPromptVisiblity
// 0x0010 (0x0010 - 0x0000)
struct WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity final
{
public:
	float                                         Angle;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_1;         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity) == 0x000004, "Wrong alignment on WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity");
static_assert(sizeof(WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity) == 0x000010, "Wrong size on WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity, Angle) == 0x000000, "Member 'WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity::Angle' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity, Temp_bool_Variable) == 0x000004, "Member 'WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000005, "Member 'WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity, CallFunc_InRange_FloatFloat_ReturnValue_1) == 0x000006, "Member 'WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity::CallFunc_InRange_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity, Temp_byte_Variable) == 0x000007, "Member 'WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity, CallFunc_BooleanOR_ReturnValue) == 0x000008, "Member 'WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity, Temp_byte_Variable_1) == 0x000009, "Member 'WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity, Temp_bool_Variable_1) == 0x00000A, "Member 'WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity, K2Node_Select_Default) == 0x00000B, "Member 'WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity, Temp_byte_Variable_2) == 0x00000C, "Member 'WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity, Temp_byte_Variable_3) == 0x00000D, "Member 'WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity, K2Node_Select_Default_1) == 0x00000E, "Member 'WinterQuestNavigationActorIndicator_C_SetButtonPromptVisiblity::K2Node_Select_Default_1' has a wrong offset!");

// Function WinterQuestNavigationActorIndicator.WinterQuestNavigationActorIndicator_C.HandleArrowToShow
// 0x0004 (0x0004 - 0x0000)
struct WinterQuestNavigationActorIndicator_C_HandleArrowToShow final
{
public:
	float                                         Angle;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuestNavigationActorIndicator_C_HandleArrowToShow) == 0x000004, "Wrong alignment on WinterQuestNavigationActorIndicator_C_HandleArrowToShow");
static_assert(sizeof(WinterQuestNavigationActorIndicator_C_HandleArrowToShow) == 0x000004, "Wrong size on WinterQuestNavigationActorIndicator_C_HandleArrowToShow");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleArrowToShow, Angle) == 0x000000, "Member 'WinterQuestNavigationActorIndicator_C_HandleArrowToShow::Angle' has a wrong offset!");

// Function WinterQuestNavigationActorIndicator.WinterQuestNavigationActorIndicator_C.HandleBottomRightArrowLayout
// 0x0014 (0x0014 - 0x0000)
struct WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout) == 0x000004, "Wrong alignment on WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout");
static_assert(sizeof(WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout) == 0x000014, "Wrong size on WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout, Value) == 0x000000, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout::Value' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout, Temp_bool_Variable) == 0x000004, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000005, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout, Temp_byte_Variable) == 0x000006, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout, Temp_byte_Variable_1) == 0x000007, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000008, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout, K2Node_Select_Default) == 0x000010, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomRightArrowLayout::K2Node_Select_Default' has a wrong offset!");

// Function WinterQuestNavigationActorIndicator.WinterQuestNavigationActorIndicator_C.HandleBottomLeftArrowLayout
// 0x0014 (0x0014 - 0x0000)
struct WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout) == 0x000004, "Wrong alignment on WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout");
static_assert(sizeof(WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout) == 0x000014, "Wrong size on WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout, Value) == 0x000000, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout::Value' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout, Temp_bool_Variable) == 0x000004, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000005, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout, Temp_byte_Variable) == 0x000006, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout, Temp_byte_Variable_1) == 0x000007, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000008, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout, K2Node_Select_Default) == 0x000010, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomLeftArrowLayout::K2Node_Select_Default' has a wrong offset!");

// Function WinterQuestNavigationActorIndicator.WinterQuestNavigationActorIndicator_C.HandleTopRightArrowLayout
// 0x0014 (0x0014 - 0x0000)
struct WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout) == 0x000004, "Wrong alignment on WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout");
static_assert(sizeof(WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout) == 0x000014, "Wrong size on WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout, Value) == 0x000000, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout::Value' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout, Temp_bool_Variable) == 0x000004, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000005, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout, Temp_byte_Variable) == 0x000006, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout, Temp_byte_Variable_1) == 0x000007, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000008, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout, K2Node_Select_Default) == 0x000010, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopRightArrowLayout::K2Node_Select_Default' has a wrong offset!");

// Function WinterQuestNavigationActorIndicator.WinterQuestNavigationActorIndicator_C.HandleTopLeftArrowLayout
// 0x0014 (0x0014 - 0x0000)
struct WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout) == 0x000004, "Wrong alignment on WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout");
static_assert(sizeof(WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout) == 0x000014, "Wrong size on WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout, Value) == 0x000000, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout::Value' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout, Temp_bool_Variable) == 0x000004, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000005, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout, Temp_byte_Variable) == 0x000006, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout, Temp_byte_Variable_1) == 0x000007, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000008, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout, K2Node_Select_Default) == 0x000010, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopLeftArrowLayout::K2Node_Select_Default' has a wrong offset!");

// Function WinterQuestNavigationActorIndicator.WinterQuestNavigationActorIndicator_C.HandleBottomCenterArrowLayout
// 0x0014 (0x0014 - 0x0000)
struct WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout) == 0x000004, "Wrong alignment on WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout");
static_assert(sizeof(WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout) == 0x000014, "Wrong size on WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout, Value) == 0x000000, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout::Value' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout, Temp_bool_Variable) == 0x000004, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000005, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout, Temp_byte_Variable) == 0x000006, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout, Temp_byte_Variable_1) == 0x000007, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000008, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout, K2Node_Select_Default) == 0x000010, "Member 'WinterQuestNavigationActorIndicator_C_HandleBottomCenterArrowLayout::K2Node_Select_Default' has a wrong offset!");

// Function WinterQuestNavigationActorIndicator.WinterQuestNavigationActorIndicator_C.HandleTopCenterArrowLayout
// 0x0014 (0x0014 - 0x0000)
struct WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout) == 0x000004, "Wrong alignment on WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout");
static_assert(sizeof(WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout) == 0x000014, "Wrong size on WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout, Value) == 0x000000, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout::Value' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout, Temp_bool_Variable) == 0x000004, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000005, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout, Temp_byte_Variable) == 0x000006, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout, Temp_byte_Variable_1) == 0x000007, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000008, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout, K2Node_Select_Default) == 0x000010, "Member 'WinterQuestNavigationActorIndicator_C_HandleTopCenterArrowLayout::K2Node_Select_Default' has a wrong offset!");

// Function WinterQuestNavigationActorIndicator.WinterQuestNavigationActorIndicator_C.HandleLeftArrowLayout
// 0x0078 (0x0078 - 0x0000)
struct WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_1;         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_2;         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_3;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_2;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_3;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_4;                           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout) == 0x000004, "Wrong alignment on WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout");
static_assert(sizeof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout) == 0x000078, "Wrong size on WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, Value) == 0x000000, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::Value' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, Temp_bool_Variable) == 0x000004, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000005, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, CallFunc_InRange_FloatFloat_ReturnValue_1) == 0x000006, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::CallFunc_InRange_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, CallFunc_InRange_FloatFloat_ReturnValue_2) == 0x000007, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::CallFunc_InRange_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, CallFunc_InRange_FloatFloat_ReturnValue_3) == 0x000008, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::CallFunc_InRange_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, Temp_float_Variable) == 0x00000C, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, CallFunc_BooleanOR_ReturnValue) == 0x000010, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, Temp_bool_Variable_1) == 0x000011, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, Temp_struct_Variable) == 0x000014, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, Temp_bool_Variable_2) == 0x00001C, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, Temp_struct_Variable_1) == 0x000020, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, Temp_bool_Variable_3) == 0x000028, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, Temp_byte_Variable) == 0x000029, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, Temp_byte_Variable_1) == 0x00002A, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, CallFunc_RandomFloatInRange_ReturnValue) == 0x00002C, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, K2Node_Select_Default) == 0x000030, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, K2Node_Select_Default_1) == 0x000034, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, Temp_float_Variable_1) == 0x000038, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00003C, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000040, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, CallFunc_MakeVector2D_ReturnValue) == 0x000044, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x00004C, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, K2Node_Select_Default_2) == 0x000050, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, CallFunc_MakeVector2D_ReturnValue_1) == 0x000058, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, K2Node_Select_Default_3) == 0x000060, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, Temp_bool_Variable_4) == 0x000068, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, K2Node_Select_Default_4) == 0x00006C, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000070, "Member 'WinterQuestNavigationActorIndicator_C_HandleLeftArrowLayout::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");

// Function WinterQuestNavigationActorIndicator.WinterQuestNavigationActorIndicator_C.HandleRightArrowLayout
// 0x0074 (0x0074 - 0x0000)
struct WinterQuestNavigationActorIndicator_C_HandleRightArrowLayout final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_1;         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_2;         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
