#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuestPreviewScreen

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WinterQuestPreviewScreen.WinterQuestPreviewScreen_C
// 0x0020 (0x04E0 - 0x04C0)
class UWinterQuestPreviewScreen_C final : public UFortWinterQuestPreviewScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Presents;                                   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         Image_PresentIcon;                                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NumberOfPresents;                             // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdateOfferTwoText(const class FText& OfferText);
	void UpdateOfferOneText(const class FText& OfferText);
	void ExecuteUbergraph_WinterQuestPreviewScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WinterQuestPreviewScreen_C">();
	}
	static class UWinterQuestPreviewScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinterQuestPreviewScreen_C>();
	}
};
static_assert(alignof(UWinterQuestPreviewScreen_C) == 0x000008, "Wrong alignment on UWinterQuestPreviewScreen_C");
static_assert(sizeof(UWinterQuestPreviewScreen_C) == 0x0004E0, "Wrong size on UWinterQuestPreviewScreen_C");
static_assert(offsetof(UWinterQuestPreviewScreen_C, UberGraphFrame) == 0x0004C0, "Member 'UWinterQuestPreviewScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWinterQuestPreviewScreen_C, Border_Presents) == 0x0004C8, "Member 'UWinterQuestPreviewScreen_C::Border_Presents' has a wrong offset!");
static_assert(offsetof(UWinterQuestPreviewScreen_C, Image_PresentIcon) == 0x0004D0, "Member 'UWinterQuestPreviewScreen_C::Image_PresentIcon' has a wrong offset!");
static_assert(offsetof(UWinterQuestPreviewScreen_C, Text_NumberOfPresents) == 0x0004D8, "Member 'UWinterQuestPreviewScreen_C::Text_NumberOfPresents' has a wrong offset!");

}

