#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuestScreen

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WinterQuestScreen.WinterQuestScreen_C
// 0x00C8 (0x0640 - 0x0578)
class UWinterQuestScreen_C final : public UFortWinterQuestScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WelcomeIntro;                                      // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MoreInforButtonIntro;                              // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LeaveCabinIntro;                                   // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BackButtonFadeOffAnim;                             // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BackButtonFadeOnAnim;                              // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LeaveCabinButtonIntro;                             // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeTransitionOut;                                 // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ResetOpacity;                                      // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeForFireplace;                                  // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_FadeFX;                                      // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Snowflake_01;                                      // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Snowflake_02;                                      // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Snowflake_03;                                      // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Snowflake_04;                                      // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Snowflake_05;                                      // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Snowflake_06;                                      // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WelcomeOverlay;                                    // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       WelcomeText;                                       // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IntroJustFinished;                                 // 0x0618(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFort_Entry_Music_Controller_BP_C*      Music_Entry;                                       // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasBeenToLobby;                                   // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        Ambient_Audio;                                     // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnteredCabin;                                     // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void DeactivateAllWidgets();
	void SetScreenStateVisibilty(bool bHideBackButton, bool bHideSpoilersButton);
	void OnScreenStateChanged(EWinterQuestViewState NewState);
	void Construct();
	void BP_OnActivated();
	void OnUserExitCabin();
	void BP_OnDeactivated();
	void Reset_Enter_Sound();
	void OnSetAllUIVisibilityState(bool bIsHidden);
	void OnPresentOpened();
	void ExecuteUbergraph_WinterQuestScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WinterQuestScreen_C">();
	}
	static class UWinterQuestScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinterQuestScreen_C>();
	}
};
static_assert(alignof(UWinterQuestScreen_C) == 0x000008, "Wrong alignment on UWinterQuestScreen_C");
static_assert(sizeof(UWinterQuestScreen_C) == 0x000640, "Wrong size on UWinterQuestScreen_C");
static_assert(offsetof(UWinterQuestScreen_C, UberGraphFrame) == 0x000578, "Member 'UWinterQuestScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, WelcomeIntro) == 0x000580, "Member 'UWinterQuestScreen_C::WelcomeIntro' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, MoreInforButtonIntro) == 0x000588, "Member 'UWinterQuestScreen_C::MoreInforButtonIntro' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, LeaveCabinIntro) == 0x000590, "Member 'UWinterQuestScreen_C::LeaveCabinIntro' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, BackButtonFadeOffAnim) == 0x000598, "Member 'UWinterQuestScreen_C::BackButtonFadeOffAnim' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, BackButtonFadeOnAnim) == 0x0005A0, "Member 'UWinterQuestScreen_C::BackButtonFadeOnAnim' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, LeaveCabinButtonIntro) == 0x0005A8, "Member 'UWinterQuestScreen_C::LeaveCabinButtonIntro' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, FadeTransitionOut) == 0x0005B0, "Member 'UWinterQuestScreen_C::FadeTransitionOut' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, ResetOpacity) == 0x0005B8, "Member 'UWinterQuestScreen_C::ResetOpacity' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, FadeForFireplace) == 0x0005C0, "Member 'UWinterQuestScreen_C::FadeForFireplace' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, Image_FadeFX) == 0x0005C8, "Member 'UWinterQuestScreen_C::Image_FadeFX' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, SafeZone_0) == 0x0005D0, "Member 'UWinterQuestScreen_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, Snowflake_01) == 0x0005D8, "Member 'UWinterQuestScreen_C::Snowflake_01' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, Snowflake_02) == 0x0005E0, "Member 'UWinterQuestScreen_C::Snowflake_02' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, Snowflake_03) == 0x0005E8, "Member 'UWinterQuestScreen_C::Snowflake_03' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, Snowflake_04) == 0x0005F0, "Member 'UWinterQuestScreen_C::Snowflake_04' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, Snowflake_05) == 0x0005F8, "Member 'UWinterQuestScreen_C::Snowflake_05' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, Snowflake_06) == 0x000600, "Member 'UWinterQuestScreen_C::Snowflake_06' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, WelcomeOverlay) == 0x000608, "Member 'UWinterQuestScreen_C::WelcomeOverlay' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, WelcomeText) == 0x000610, "Member 'UWinterQuestScreen_C::WelcomeText' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, IntroJustFinished) == 0x000618, "Member 'UWinterQuestScreen_C::IntroJustFinished' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, Music_Entry) == 0x000620, "Member 'UWinterQuestScreen_C::Music_Entry' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, bHasBeenToLobby) == 0x000628, "Member 'UWinterQuestScreen_C::bHasBeenToLobby' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, Ambient_Audio) == 0x000630, "Member 'UWinterQuestScreen_C::Ambient_Audio' has a wrong offset!");
static_assert(offsetof(UWinterQuestScreen_C, bEnteredCabin) == 0x000638, "Member 'UWinterQuestScreen_C::bEnteredCabin' has a wrong offset!");

}

