#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuestIntroScreen

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WinterQuestIntroScreen.WinterQuestIntroScreen_C
// 0x0040 (0x0498 - 0x0458)
class UWinterQuestIntroScreen_C final : public UFortWinterQuestIntroScreen
{
public:
	class UImage*                                 CenterRibbon;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LargeLeftRibbon;                                   // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LargeRightRibbon;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ribbon;                                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SmallBottomLeftRibbon;                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SmallBottomRightRibbon;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SmallTopLeftRibbon;                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SmallTopRightRibbon;                               // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WinterQuestIntroScreen_C">();
	}
	static class UWinterQuestIntroScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinterQuestIntroScreen_C>();
	}
};
static_assert(alignof(UWinterQuestIntroScreen_C) == 0x000008, "Wrong alignment on UWinterQuestIntroScreen_C");
static_assert(sizeof(UWinterQuestIntroScreen_C) == 0x000498, "Wrong size on UWinterQuestIntroScreen_C");
static_assert(offsetof(UWinterQuestIntroScreen_C, CenterRibbon) == 0x000458, "Member 'UWinterQuestIntroScreen_C::CenterRibbon' has a wrong offset!");
static_assert(offsetof(UWinterQuestIntroScreen_C, LargeLeftRibbon) == 0x000460, "Member 'UWinterQuestIntroScreen_C::LargeLeftRibbon' has a wrong offset!");
static_assert(offsetof(UWinterQuestIntroScreen_C, LargeRightRibbon) == 0x000468, "Member 'UWinterQuestIntroScreen_C::LargeRightRibbon' has a wrong offset!");
static_assert(offsetof(UWinterQuestIntroScreen_C, Ribbon) == 0x000470, "Member 'UWinterQuestIntroScreen_C::Ribbon' has a wrong offset!");
static_assert(offsetof(UWinterQuestIntroScreen_C, SmallBottomLeftRibbon) == 0x000478, "Member 'UWinterQuestIntroScreen_C::SmallBottomLeftRibbon' has a wrong offset!");
static_assert(offsetof(UWinterQuestIntroScreen_C, SmallBottomRightRibbon) == 0x000480, "Member 'UWinterQuestIntroScreen_C::SmallBottomRightRibbon' has a wrong offset!");
static_assert(offsetof(UWinterQuestIntroScreen_C, SmallTopLeftRibbon) == 0x000488, "Member 'UWinterQuestIntroScreen_C::SmallTopLeftRibbon' has a wrong offset!");
static_assert(offsetof(UWinterQuestIntroScreen_C, SmallTopRightRibbon) == 0x000490, "Member 'UWinterQuestIntroScreen_C::SmallTopRightRibbon' has a wrong offset!");

}

