#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuestNavigationActorIndicator

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WinterQuestNavigationActorIndicator.WinterQuestNavigationActorIndicator_C
// 0x0110 (0x0370 - 0x0260)
class UWinterQuestNavigationActorIndicator_C final : public UFortEventLevelNavigationActorIndicator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TopLeftArrowAnim;                                  // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BottomLeftArrowAnim;                               // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BottomRightArrowAnim;                              // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RightArrowAnim;                                    // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BottomArrowAnim;                                   // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TopArrowAnim;                                      // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LeftArrowAnim;                                     // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TopRightArrowAnim;                                 // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               AllContent;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomCenterArrow_VisibilityWrapper;               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomCenterRadialArrow;                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomLeftArrow_VisibilityWrapper;                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomLeftRadialArrow;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BottomRightArrow_VisibilityWrapper;                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomRightRadialArrow;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_Left;                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_Right;                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ContentContainer;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                LeftArrow_VisibilityWrapper;                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                LeftButton_VisibilityWrapper;                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftRadialArrow;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                RightArrow_VisibilityWrapper;                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                RightButton_VisibilityWrapper;                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightRadialArrow;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TopCenterArrow_VisibilityWrapper;                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopCenterRadialArrow;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TopLeftArrow_VisibilityWrapper;                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopLeftRadialArrow;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TopRightArrow_VisibilityWrapper;                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopRightRadialArrow;                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           ActionTexts;                                       // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void SetArrowAngleRotation(float Angle);
	void HandleRevealStyle(const struct FGameplayTag& Direction);
	void SetButtonPromptVisiblity(float Angle);
	void HandleArrowToShow(float Angle);
	void HandleBottomRightArrowLayout(float Value);
	void HandleBottomLeftArrowLayout(float Value);
	void HandleTopRightArrowLayout(float Value);
	void HandleTopLeftArrowLayout(float Value);
	void HandleBottomCenterArrowLayout(float Value);
	void HandleTopCenterArrowLayout(float Value);
	void HandleLeftArrowLayout(float Value);
	void HandleRightArrowLayout(float Value);
	void CalcPosition(float Distance, float Angle, struct FVector2D* Position);
	void OnInitData(const struct FNavWidgetSettings& Settings);
	void ExecuteUbergraph_WinterQuestNavigationActorIndicator(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WinterQuestNavigationActorIndicator_C">();
	}
	static class UWinterQuestNavigationActorIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinterQuestNavigationActorIndicator_C>();
	}
};
static_assert(alignof(UWinterQuestNavigationActorIndicator_C) == 0x000008, "Wrong alignment on UWinterQuestNavigationActorIndicator_C");
static_assert(sizeof(UWinterQuestNavigationActorIndicator_C) == 0x000370, "Wrong size on UWinterQuestNavigationActorIndicator_C");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, UberGraphFrame) == 0x000260, "Member 'UWinterQuestNavigationActorIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, TopLeftArrowAnim) == 0x000268, "Member 'UWinterQuestNavigationActorIndicator_C::TopLeftArrowAnim' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, BottomLeftArrowAnim) == 0x000270, "Member 'UWinterQuestNavigationActorIndicator_C::BottomLeftArrowAnim' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, BottomRightArrowAnim) == 0x000278, "Member 'UWinterQuestNavigationActorIndicator_C::BottomRightArrowAnim' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, RightArrowAnim) == 0x000280, "Member 'UWinterQuestNavigationActorIndicator_C::RightArrowAnim' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, BottomArrowAnim) == 0x000288, "Member 'UWinterQuestNavigationActorIndicator_C::BottomArrowAnim' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, TopArrowAnim) == 0x000290, "Member 'UWinterQuestNavigationActorIndicator_C::TopArrowAnim' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, LeftArrowAnim) == 0x000298, "Member 'UWinterQuestNavigationActorIndicator_C::LeftArrowAnim' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, TopRightArrowAnim) == 0x0002A0, "Member 'UWinterQuestNavigationActorIndicator_C::TopRightArrowAnim' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, AllContent) == 0x0002A8, "Member 'UWinterQuestNavigationActorIndicator_C::AllContent' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, BottomCenterArrow_VisibilityWrapper) == 0x0002B0, "Member 'UWinterQuestNavigationActorIndicator_C::BottomCenterArrow_VisibilityWrapper' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, BottomCenterRadialArrow) == 0x0002B8, "Member 'UWinterQuestNavigationActorIndicator_C::BottomCenterRadialArrow' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, BottomLeftArrow_VisibilityWrapper) == 0x0002C0, "Member 'UWinterQuestNavigationActorIndicator_C::BottomLeftArrow_VisibilityWrapper' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, BottomLeftRadialArrow) == 0x0002C8, "Member 'UWinterQuestNavigationActorIndicator_C::BottomLeftRadialArrow' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, BottomRightArrow_VisibilityWrapper) == 0x0002D0, "Member 'UWinterQuestNavigationActorIndicator_C::BottomRightArrow_VisibilityWrapper' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, BottomRightRadialArrow) == 0x0002D8, "Member 'UWinterQuestNavigationActorIndicator_C::BottomRightRadialArrow' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, CommonActionWidget_Left) == 0x0002E0, "Member 'UWinterQuestNavigationActorIndicator_C::CommonActionWidget_Left' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, CommonActionWidget_Right) == 0x0002E8, "Member 'UWinterQuestNavigationActorIndicator_C::CommonActionWidget_Right' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, ContentContainer) == 0x0002F0, "Member 'UWinterQuestNavigationActorIndicator_C::ContentContainer' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, HorizontalBox_0) == 0x0002F8, "Member 'UWinterQuestNavigationActorIndicator_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, LeftArrow_VisibilityWrapper) == 0x000300, "Member 'UWinterQuestNavigationActorIndicator_C::LeftArrow_VisibilityWrapper' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, LeftButton_VisibilityWrapper) == 0x000308, "Member 'UWinterQuestNavigationActorIndicator_C::LeftButton_VisibilityWrapper' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, LeftRadialArrow) == 0x000310, "Member 'UWinterQuestNavigationActorIndicator_C::LeftRadialArrow' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, RightArrow_VisibilityWrapper) == 0x000318, "Member 'UWinterQuestNavigationActorIndicator_C::RightArrow_VisibilityWrapper' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, RightButton_VisibilityWrapper) == 0x000320, "Member 'UWinterQuestNavigationActorIndicator_C::RightButton_VisibilityWrapper' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, RightRadialArrow) == 0x000328, "Member 'UWinterQuestNavigationActorIndicator_C::RightRadialArrow' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, TopCenterArrow_VisibilityWrapper) == 0x000330, "Member 'UWinterQuestNavigationActorIndicator_C::TopCenterArrow_VisibilityWrapper' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, TopCenterRadialArrow) == 0x000338, "Member 'UWinterQuestNavigationActorIndicator_C::TopCenterRadialArrow' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, TopLeftArrow_VisibilityWrapper) == 0x000340, "Member 'UWinterQuestNavigationActorIndicator_C::TopLeftArrow_VisibilityWrapper' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, TopLeftRadialArrow) == 0x000348, "Member 'UWinterQuestNavigationActorIndicator_C::TopLeftRadialArrow' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, TopRightArrow_VisibilityWrapper) == 0x000350, "Member 'UWinterQuestNavigationActorIndicator_C::TopRightArrow_VisibilityWrapper' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, TopRightRadialArrow) == 0x000358, "Member 'UWinterQuestNavigationActorIndicator_C::TopRightRadialArrow' has a wrong offset!");
static_assert(offsetof(UWinterQuestNavigationActorIndicator_C, ActionTexts) == 0x000360, "Member 'UWinterQuestNavigationActorIndicator_C::ActionTexts' has a wrong offset!");

}

