#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuest_MoreInfo_DetailsScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function WinterQuest_MoreInfo_DetailsScreen.WinterQuest_MoreInfo_DetailsScreen_C.BndEvt__SoloButton_WinterFest_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WinterQuest_MoreInfo_DetailsScreen_C_BndEvt__SoloButton_WinterFest_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuest_MoreInfo_DetailsScreen_C_BndEvt__SoloButton_WinterFest_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WinterQuest_MoreInfo_DetailsScreen_C_BndEvt__SoloButton_WinterFest_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(WinterQuest_MoreInfo_DetailsScreen_C_BndEvt__SoloButton_WinterFest_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on WinterQuest_MoreInfo_DetailsScreen_C_BndEvt__SoloButton_WinterFest_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(WinterQuest_MoreInfo_DetailsScreen_C_BndEvt__SoloButton_WinterFest_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'WinterQuest_MoreInfo_DetailsScreen_C_BndEvt__SoloButton_WinterFest_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function WinterQuest_MoreInfo_DetailsScreen.WinterQuest_MoreInfo_DetailsScreen_C.ExecuteUbergraph_WinterQuest_MoreInfo_DetailsScreen
// 0x0018 (0x0018 - 0x0000)
struct WinterQuest_MoreInfo_DetailsScreen_C_ExecuteUbergraph_WinterQuest_MoreInfo_DetailsScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuest_MoreInfo_DetailsScreen_C_ExecuteUbergraph_WinterQuest_MoreInfo_DetailsScreen) == 0x000008, "Wrong alignment on WinterQuest_MoreInfo_DetailsScreen_C_ExecuteUbergraph_WinterQuest_MoreInfo_DetailsScreen");
static_assert(sizeof(WinterQuest_MoreInfo_DetailsScreen_C_ExecuteUbergraph_WinterQuest_MoreInfo_DetailsScreen) == 0x000018, "Wrong size on WinterQuest_MoreInfo_DetailsScreen_C_ExecuteUbergraph_WinterQuest_MoreInfo_DetailsScreen");
static_assert(offsetof(WinterQuest_MoreInfo_DetailsScreen_C_ExecuteUbergraph_WinterQuest_MoreInfo_DetailsScreen, EntryPoint) == 0x000000, "Member 'WinterQuest_MoreInfo_DetailsScreen_C_ExecuteUbergraph_WinterQuest_MoreInfo_DetailsScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WinterQuest_MoreInfo_DetailsScreen_C_ExecuteUbergraph_WinterQuest_MoreInfo_DetailsScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WinterQuest_MoreInfo_DetailsScreen_C_ExecuteUbergraph_WinterQuest_MoreInfo_DetailsScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuest_MoreInfo_DetailsScreen_C_ExecuteUbergraph_WinterQuest_MoreInfo_DetailsScreen, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'WinterQuest_MoreInfo_DetailsScreen_C_ExecuteUbergraph_WinterQuest_MoreInfo_DetailsScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

}

