#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuestDetailsScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function WinterQuestDetailsScreen.WinterQuestDetailsScreen_C.OnSetRewardsVaultRotator
// 0x0008 (0x0008 - 0x0000)
struct WinterQuestDetailsScreen_C_OnSetRewardsVaultRotator final
{
public:
	class AItemPreviewVaultRotator*               ItemPreviewVaultRotator;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuestDetailsScreen_C_OnSetRewardsVaultRotator) == 0x000008, "Wrong alignment on WinterQuestDetailsScreen_C_OnSetRewardsVaultRotator");
static_assert(sizeof(WinterQuestDetailsScreen_C_OnSetRewardsVaultRotator) == 0x000008, "Wrong size on WinterQuestDetailsScreen_C_OnSetRewardsVaultRotator");
static_assert(offsetof(WinterQuestDetailsScreen_C_OnSetRewardsVaultRotator, ItemPreviewVaultRotator) == 0x000000, "Member 'WinterQuestDetailsScreen_C_OnSetRewardsVaultRotator::ItemPreviewVaultRotator' has a wrong offset!");

// Function WinterQuestDetailsScreen.WinterQuestDetailsScreen_C.OnResetVaultRotator
// 0x0008 (0x0008 - 0x0000)
struct WinterQuestDetailsScreen_C_OnResetVaultRotator final
{
public:
	class AItemPreviewVaultRotator*               ItemPreviewVaultRotator;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuestDetailsScreen_C_OnResetVaultRotator) == 0x000008, "Wrong alignment on WinterQuestDetailsScreen_C_OnResetVaultRotator");
static_assert(sizeof(WinterQuestDetailsScreen_C_OnResetVaultRotator) == 0x000008, "Wrong size on WinterQuestDetailsScreen_C_OnResetVaultRotator");
static_assert(offsetof(WinterQuestDetailsScreen_C_OnResetVaultRotator, ItemPreviewVaultRotator) == 0x000000, "Member 'WinterQuestDetailsScreen_C_OnResetVaultRotator::ItemPreviewVaultRotator' has a wrong offset!");

// Function WinterQuestDetailsScreen.WinterQuestDetailsScreen_C.ExecuteUbergraph_WinterQuestDetailsScreen
// 0x00B0 (0x00B0 - 0x0000)
struct WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGSC_DynamicLevelStreaming_C*>   CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0018(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGSC_DynamicLevelStreaming_C*           CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFrontendCamera_VaultRotator_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	class AItemPreviewVaultRotator*               K2Node_Event_ItemPreviewVaultRotator_1;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVaultRotator_C*                        K2Node_DynamicCast_AsVault_Rotator;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AItemPreviewVaultRotator*               K2Node_Event_ItemPreviewVaultRotator;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVaultRotator_C*                        K2Node_DynamicCast_AsVault_Rotator_1;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFrontendCamera_VaultRotator_C*         CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen) == 0x000008, "Wrong alignment on WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen");
static_assert(sizeof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen) == 0x0000B0, "Wrong size on WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, EntryPoint) == 0x000000, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000018, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, CallFunc_Not_PreBool_ReturnValue) == 0x00002C, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, CallFunc_Array_Get_Item) == 0x000040, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, CallFunc_GetAllActorsOfClass_OutActors) == 0x000048, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, K2Node_Event_ItemPreviewVaultRotator_1) == 0x000058, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::K2Node_Event_ItemPreviewVaultRotator_1' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, K2Node_DynamicCast_AsVault_Rotator) == 0x000068, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::K2Node_DynamicCast_AsVault_Rotator' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, K2Node_Event_ItemPreviewVaultRotator) == 0x000078, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::K2Node_Event_ItemPreviewVaultRotator' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, K2Node_DynamicCast_AsVault_Rotator_1) == 0x000080, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::K2Node_DynamicCast_AsVault_Rotator_1' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, Temp_int_Loop_Counter_Variable_1) == 0x00008C, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, CallFunc_Less_IntInt_ReturnValue_1) == 0x000090, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, CallFunc_Add_IntInt_ReturnValue_1) == 0x000094, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, CallFunc_BooleanAND_ReturnValue) == 0x000098, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, Temp_int_Array_Index_Variable_1) == 0x00009C, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen, CallFunc_ActorHasTag_ReturnValue) == 0x0000A8, "Member 'WinterQuestDetailsScreen_C_ExecuteUbergraph_WinterQuestDetailsScreen::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");

}

