#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuestStockingScreen

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WinterQuestStockingScreen.WinterQuestStockingScreen_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WinterQuestStockingScreen_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              NewMethod;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WinterQuestStockingScreen_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on WinterQuestStockingScreen_C_OnInputMethodChanged");
static_assert(sizeof(WinterQuestStockingScreen_C_OnInputMethodChanged) == 0x000001, "Wrong size on WinterQuestStockingScreen_C_OnInputMethodChanged");
static_assert(offsetof(WinterQuestStockingScreen_C_OnInputMethodChanged, NewMethod) == 0x000000, "Member 'WinterQuestStockingScreen_C_OnInputMethodChanged::NewMethod' has a wrong offset!");

// Function WinterQuestStockingScreen.WinterQuestStockingScreen_C.ExecuteUbergraph_WinterQuestStockingScreen
// 0x0130 (0x0130 - 0x0000)
struct WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetHasStockingQuestActive_bHasStockingQuestActive; // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable_2;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetAllFortPlayerControllers_ReturnValue;  // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0078(0x0010)(NoDestructor)
	class UFortAsyncAction_SendQuestStatEvent*    CallFunc_SendClientStatEvent_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWinterQuest_OpenPrompt_C*              K2Node_DynamicCast_AsWinter_Quest_Open_Prompt;     // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWinterQuest_OpenPrompt_C*              K2Node_DynamicCast_AsWinter_Quest_Open_Prompt_1;   // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Cozy_Stockings_C*>           CallFunc_GetAllActorsOfClass_OutActors;            // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	class UWinterQuest_OpenPrompt_C*              K2Node_DynamicCast_AsWinter_Quest_Open_Prompt_2;   // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Cozy_Stockings_C*                   CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_Event_NewMethod;                            // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x010F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHasStockingQuestActive_bHasStockingQuestActive_1; // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x011C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen) == 0x000008, "Wrong alignment on WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen");
static_assert(sizeof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen) == 0x000130, "Wrong size on WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, EntryPoint) == 0x000000, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_IsValid_ReturnValue_2) == 0x000018, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_IsValid_ReturnValue_3) == 0x00002C, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, Temp_bool_Variable) == 0x00002D, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_GetHasStockingQuestActive_bHasStockingQuestActive) == 0x00002E, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_GetHasStockingQuestActive_bHasStockingQuestActive' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, Temp_byte_Variable) == 0x00002F, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, Temp_byte_Variable_1) == 0x000030, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, Temp_byte_Variable_2) == 0x000031, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, Temp_byte_Variable_3) == 0x000032, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, K2Node_Select_Default) == 0x000033, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, Temp_byte_Variable_4) == 0x000034, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, Temp_byte_Variable_5) == 0x000035, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, Temp_byte_Variable_6) == 0x000036, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, Temp_bool_Variable_1) == 0x000037, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, Temp_byte_Variable_7) == 0x000038, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, Temp_byte_Variable_8) == 0x000039, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, Temp_int_Array_Index_Variable_1) == 0x000048, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_GetAllFortPlayerControllers_ReturnValue) == 0x000050, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_GetAllFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_Array_Get_Item) == 0x000060, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_GetQuestManager_ReturnValue) == 0x000070, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, K2Node_MakeStruct_DataTableRowHandle) == 0x000078, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_SendClientStatEvent_ReturnValue) == 0x000088, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_SendClientStatEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, K2Node_DynamicCast_AsWinter_Quest_Open_Prompt) == 0x000090, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::K2Node_DynamicCast_AsWinter_Quest_Open_Prompt' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_IsValid_ReturnValue_4) == 0x000099, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x00009C, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, K2Node_DynamicCast_AsWinter_Quest_Open_Prompt_1) == 0x0000B0, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::K2Node_DynamicCast_AsWinter_Quest_Open_Prompt_1' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000BC, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_SpawnSound2D_ReturnValue) == 0x0000D0, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000D8, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, K2Node_DynamicCast_AsWinter_Quest_Open_Prompt_2) == 0x0000E8, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::K2Node_DynamicCast_AsWinter_Quest_Open_Prompt_2' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, K2Node_DynamicCast_bSuccess_2) == 0x0000F0, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_Array_Length_ReturnValue_1) == 0x000100, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_Less_IntInt_ReturnValue) == 0x000104, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, Temp_int_Loop_Counter_Variable_1) == 0x000108, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, K2Node_Event_NewMethod) == 0x00010C, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::K2Node_Event_NewMethod' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00010D, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, K2Node_Select_Default_1) == 0x00010E, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_Less_IntInt_ReturnValue_1) == 0x00010F, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, K2Node_Select_Default_2) == 0x000110, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_Add_IntInt_ReturnValue_1) == 0x000114, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, CallFunc_GetHasStockingQuestActive_bHasStockingQuestActive_1) == 0x000118, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::CallFunc_GetHasStockingQuestActive_bHasStockingQuestActive_1' has a wrong offset!");
static_assert(offsetof(WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen, K2Node_CreateDelegate_OutputDelegate_4) == 0x00011C, "Member 'WinterQuestStockingScreen_C_ExecuteUbergraph_WinterQuestStockingScreen::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

}

