#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Winterfest_CustomTab

#include "Basic.hpp"


namespace SDK::Params
{

// Function Winterfest_CustomTab.Winterfest_CustomTab_C.PlayHoverAnimForward
// 0x0008 (0x0008 - 0x0000)
struct Winterfest_CustomTab_C_PlayHoverAnimForward final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Winterfest_CustomTab_C_PlayHoverAnimForward) == 0x000008, "Wrong alignment on Winterfest_CustomTab_C_PlayHoverAnimForward");
static_assert(sizeof(Winterfest_CustomTab_C_PlayHoverAnimForward) == 0x000008, "Wrong size on Winterfest_CustomTab_C_PlayHoverAnimForward");
static_assert(offsetof(Winterfest_CustomTab_C_PlayHoverAnimForward, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'Winterfest_CustomTab_C_PlayHoverAnimForward::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function Winterfest_CustomTab.Winterfest_CustomTab_C.PlayHoverAnimBackward
// 0x0008 (0x0008 - 0x0000)
struct Winterfest_CustomTab_C_PlayHoverAnimBackward final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Winterfest_CustomTab_C_PlayHoverAnimBackward) == 0x000008, "Wrong alignment on Winterfest_CustomTab_C_PlayHoverAnimBackward");
static_assert(sizeof(Winterfest_CustomTab_C_PlayHoverAnimBackward) == 0x000008, "Wrong size on Winterfest_CustomTab_C_PlayHoverAnimBackward");
static_assert(offsetof(Winterfest_CustomTab_C_PlayHoverAnimBackward, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'Winterfest_CustomTab_C_PlayHoverAnimBackward::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function Winterfest_CustomTab.Winterfest_CustomTab_C.ExecuteUbergraph_Winterfest_CustomTab
// 0x0010 (0x0010 - 0x0000)
struct Winterfest_CustomTab_C_ExecuteUbergraph_Winterfest_CustomTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Winterfest_CustomTab_C_ExecuteUbergraph_Winterfest_CustomTab) == 0x000008, "Wrong alignment on Winterfest_CustomTab_C_ExecuteUbergraph_Winterfest_CustomTab");
static_assert(sizeof(Winterfest_CustomTab_C_ExecuteUbergraph_Winterfest_CustomTab) == 0x000010, "Wrong size on Winterfest_CustomTab_C_ExecuteUbergraph_Winterfest_CustomTab");
static_assert(offsetof(Winterfest_CustomTab_C_ExecuteUbergraph_Winterfest_CustomTab, EntryPoint) == 0x000000, "Member 'Winterfest_CustomTab_C_ExecuteUbergraph_Winterfest_CustomTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(Winterfest_CustomTab_C_ExecuteUbergraph_Winterfest_CustomTab, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'Winterfest_CustomTab_C_ExecuteUbergraph_Winterfest_CustomTab::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

