#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuest_DayCounter

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WinterQuest_DayCounter.WinterQuest_DayCounter_C
// 0x0020 (0x0280 - 0x0260)
class UWinterQuest_DayCounter_C final : public UFortWinterQuestDayCounter
{
public:
	class UWidgetAnimation*                       DayCounterIntro;                                   // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 LeftSnowflake;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightSnowflake;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Spike;                                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void HandleDayCounterIntro();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WinterQuest_DayCounter_C">();
	}
	static class UWinterQuest_DayCounter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinterQuest_DayCounter_C>();
	}
};
static_assert(alignof(UWinterQuest_DayCounter_C) == 0x000008, "Wrong alignment on UWinterQuest_DayCounter_C");
static_assert(sizeof(UWinterQuest_DayCounter_C) == 0x000280, "Wrong size on UWinterQuest_DayCounter_C");
static_assert(offsetof(UWinterQuest_DayCounter_C, DayCounterIntro) == 0x000260, "Member 'UWinterQuest_DayCounter_C::DayCounterIntro' has a wrong offset!");
static_assert(offsetof(UWinterQuest_DayCounter_C, LeftSnowflake) == 0x000268, "Member 'UWinterQuest_DayCounter_C::LeftSnowflake' has a wrong offset!");
static_assert(offsetof(UWinterQuest_DayCounter_C, RightSnowflake) == 0x000270, "Member 'UWinterQuest_DayCounter_C::RightSnowflake' has a wrong offset!");
static_assert(offsetof(UWinterQuest_DayCounter_C, Spike) == 0x000278, "Member 'UWinterQuest_DayCounter_C::Spike' has a wrong offset!");

}

