#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuest_OpenPrompt

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WinterQuest_OpenPrompt.WinterQuest_OpenPrompt_C
// 0x0030 (0x0BF0 - 0x0BC0)
class UWinterQuest_OpenPrompt_C final : public UFortWinterQuestButton
{
public:
	class UWidgetAnimation*                       Holding_ExampleFIll;                               // 0x0BC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Holding;                                           // 0x0BC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroAnim;                                         // 0x0BD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 PointerArrow_Right;                                // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RadialHoldButtonBacking_Right;                     // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         HoldProgress_Offset;                               // 0x0BE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OpenPromptIntroAnim();
	void StopPlayingHoldAnimation();
	void StartPlayingHoldAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WinterQuest_OpenPrompt_C">();
	}
	static class UWinterQuest_OpenPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinterQuest_OpenPrompt_C>();
	}
};
static_assert(alignof(UWinterQuest_OpenPrompt_C) == 0x000008, "Wrong alignment on UWinterQuest_OpenPrompt_C");
static_assert(sizeof(UWinterQuest_OpenPrompt_C) == 0x000BF0, "Wrong size on UWinterQuest_OpenPrompt_C");
static_assert(offsetof(UWinterQuest_OpenPrompt_C, Holding_ExampleFIll) == 0x000BC0, "Member 'UWinterQuest_OpenPrompt_C::Holding_ExampleFIll' has a wrong offset!");
static_assert(offsetof(UWinterQuest_OpenPrompt_C, Holding) == 0x000BC8, "Member 'UWinterQuest_OpenPrompt_C::Holding' has a wrong offset!");
static_assert(offsetof(UWinterQuest_OpenPrompt_C, IntroAnim) == 0x000BD0, "Member 'UWinterQuest_OpenPrompt_C::IntroAnim' has a wrong offset!");
static_assert(offsetof(UWinterQuest_OpenPrompt_C, PointerArrow_Right) == 0x000BD8, "Member 'UWinterQuest_OpenPrompt_C::PointerArrow_Right' has a wrong offset!");
static_assert(offsetof(UWinterQuest_OpenPrompt_C, RadialHoldButtonBacking_Right) == 0x000BE0, "Member 'UWinterQuest_OpenPrompt_C::RadialHoldButtonBacking_Right' has a wrong offset!");
static_assert(offsetof(UWinterQuest_OpenPrompt_C, HoldProgress_Offset) == 0x000BE8, "Member 'UWinterQuest_OpenPrompt_C::HoldProgress_Offset' has a wrong offset!");

}

