#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Winterfest_OutsideCabinLogo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Winterfest_OutsideCabinLogo.Winterfest_OutsideCabinLogo_C
// 0x0028 (0x0258 - 0x0230)
class UWinterfest_OutsideCabinLogo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_0;                             // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_51;                                          // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           PerspectiveSkew;                                   // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void LogoOutro();
	void LogoIntro();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_Winterfest_OutsideCabinLogo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Winterfest_OutsideCabinLogo_C">();
	}
	static class UWinterfest_OutsideCabinLogo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinterfest_OutsideCabinLogo_C>();
	}
};
static_assert(alignof(UWinterfest_OutsideCabinLogo_C) == 0x000008, "Wrong alignment on UWinterfest_OutsideCabinLogo_C");
static_assert(sizeof(UWinterfest_OutsideCabinLogo_C) == 0x000258, "Wrong size on UWinterfest_OutsideCabinLogo_C");
static_assert(offsetof(UWinterfest_OutsideCabinLogo_C, UberGraphFrame) == 0x000230, "Member 'UWinterfest_OutsideCabinLogo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWinterfest_OutsideCabinLogo_C, Intro) == 0x000238, "Member 'UWinterfest_OutsideCabinLogo_C::Intro' has a wrong offset!");
static_assert(offsetof(UWinterfest_OutsideCabinLogo_C, CommonRichTextBlock_0) == 0x000240, "Member 'UWinterfest_OutsideCabinLogo_C::CommonRichTextBlock_0' has a wrong offset!");
static_assert(offsetof(UWinterfest_OutsideCabinLogo_C, Image_51) == 0x000248, "Member 'UWinterfest_OutsideCabinLogo_C::Image_51' has a wrong offset!");
static_assert(offsetof(UWinterfest_OutsideCabinLogo_C, PerspectiveSkew) == 0x000250, "Member 'UWinterfest_OutsideCabinLogo_C::PerspectiveSkew' has a wrong offset!");

}

