#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuest_MoreInfo_DetailsScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WinterQuest_MoreInfo_DetailsScreen.WinterQuest_MoreInfo_DetailsScreen_C
// 0x0038 (0x0308 - 0x02D0)
class UWinterQuest_MoreInfo_DetailsScreen_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_22;                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_150;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_209;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoloButton_WinterFest_C*               SoloButton_WinterFest;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWinterfest_CabinLogo_C*                Winterfest_CabinLogo;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BndEvt__SoloButton_WinterFest_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_WinterQuest_MoreInfo_DetailsScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WinterQuest_MoreInfo_DetailsScreen_C">();
	}
	static class UWinterQuest_MoreInfo_DetailsScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinterQuest_MoreInfo_DetailsScreen_C>();
	}
};
static_assert(alignof(UWinterQuest_MoreInfo_DetailsScreen_C) == 0x000008, "Wrong alignment on UWinterQuest_MoreInfo_DetailsScreen_C");
static_assert(sizeof(UWinterQuest_MoreInfo_DetailsScreen_C) == 0x000308, "Wrong size on UWinterQuest_MoreInfo_DetailsScreen_C");
static_assert(offsetof(UWinterQuest_MoreInfo_DetailsScreen_C, UberGraphFrame) == 0x0002D0, "Member 'UWinterQuest_MoreInfo_DetailsScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWinterQuest_MoreInfo_DetailsScreen_C, Intro) == 0x0002D8, "Member 'UWinterQuest_MoreInfo_DetailsScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UWinterQuest_MoreInfo_DetailsScreen_C, CommonRichTextBlock_22) == 0x0002E0, "Member 'UWinterQuest_MoreInfo_DetailsScreen_C::CommonRichTextBlock_22' has a wrong offset!");
static_assert(offsetof(UWinterQuest_MoreInfo_DetailsScreen_C, Image_150) == 0x0002E8, "Member 'UWinterQuest_MoreInfo_DetailsScreen_C::Image_150' has a wrong offset!");
static_assert(offsetof(UWinterQuest_MoreInfo_DetailsScreen_C, Image_209) == 0x0002F0, "Member 'UWinterQuest_MoreInfo_DetailsScreen_C::Image_209' has a wrong offset!");
static_assert(offsetof(UWinterQuest_MoreInfo_DetailsScreen_C, SoloButton_WinterFest) == 0x0002F8, "Member 'UWinterQuest_MoreInfo_DetailsScreen_C::SoloButton_WinterFest' has a wrong offset!");
static_assert(offsetof(UWinterQuest_MoreInfo_DetailsScreen_C, Winterfest_CabinLogo) == 0x000300, "Member 'UWinterQuest_MoreInfo_DetailsScreen_C::Winterfest_CabinLogo' has a wrong offset!");

}

