#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuestEnterButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WinterQuestEnterButton.WinterQuestEnterButton_C
// 0x0018 (0x0B88 - 0x0B70)
class UWinterQuestEnterButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0B78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPrompt;                                        // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnUnhovered();
	void BP_OnHovered();
	void ExecuteUbergraph_WinterQuestEnterButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WinterQuestEnterButton_C">();
	}
	static class UWinterQuestEnterButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinterQuestEnterButton_C>();
	}
};
static_assert(alignof(UWinterQuestEnterButton_C) == 0x000008, "Wrong alignment on UWinterQuestEnterButton_C");
static_assert(sizeof(UWinterQuestEnterButton_C) == 0x000B88, "Wrong size on UWinterQuestEnterButton_C");
static_assert(offsetof(UWinterQuestEnterButton_C, UberGraphFrame) == 0x000B70, "Member 'UWinterQuestEnterButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWinterQuestEnterButton_C, OnHover) == 0x000B78, "Member 'UWinterQuestEnterButton_C::OnHover' has a wrong offset!");
static_assert(offsetof(UWinterQuestEnterButton_C, TextPrompt) == 0x000B80, "Member 'UWinterQuestEnterButton_C::TextPrompt' has a wrong offset!");

}

