#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuestDetailsScreen

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WinterQuestDetailsScreen.WinterQuestDetailsScreen_C
// 0x0028 (0x0580 - 0x0558)
class UWinterQuestDetailsScreen_C final : public UFortWinterQuestDetailsScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               AdditionalStyles;                                  // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              ItemDetails_SZ;                                    // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ItemDetailsContainer;                              // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SetItems_SZ;                                       // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnSetRewardsVaultRotator(class AItemPreviewVaultRotator* ItemPreviewVaultRotator);
	void OnResetVaultRotator(class AItemPreviewVaultRotator* ItemPreviewVaultRotator);
	void ExecuteUbergraph_WinterQuestDetailsScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WinterQuestDetailsScreen_C">();
	}
	static class UWinterQuestDetailsScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinterQuestDetailsScreen_C>();
	}
};
static_assert(alignof(UWinterQuestDetailsScreen_C) == 0x000008, "Wrong alignment on UWinterQuestDetailsScreen_C");
static_assert(sizeof(UWinterQuestDetailsScreen_C) == 0x000580, "Wrong size on UWinterQuestDetailsScreen_C");
static_assert(offsetof(UWinterQuestDetailsScreen_C, UberGraphFrame) == 0x000558, "Member 'UWinterQuestDetailsScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWinterQuestDetailsScreen_C, AdditionalStyles) == 0x000560, "Member 'UWinterQuestDetailsScreen_C::AdditionalStyles' has a wrong offset!");
static_assert(offsetof(UWinterQuestDetailsScreen_C, ItemDetails_SZ) == 0x000568, "Member 'UWinterQuestDetailsScreen_C::ItemDetails_SZ' has a wrong offset!");
static_assert(offsetof(UWinterQuestDetailsScreen_C, ItemDetailsContainer) == 0x000570, "Member 'UWinterQuestDetailsScreen_C::ItemDetailsContainer' has a wrong offset!");
static_assert(offsetof(UWinterQuestDetailsScreen_C, SetItems_SZ) == 0x000578, "Member 'UWinterQuestDetailsScreen_C::SetItems_SZ' has a wrong offset!");

}

