#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuestPresentScreen

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WinterQuestPresentScreen.WinterQuestPresentScreen_C
// 0x0018 (0x05D8 - 0x05C0)
class UWinterQuestPresentScreen_C final : public UFortWinterQuestPresentScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActivatableWidgetSwitcher*       PlatformTypeSwitcher;                              // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Root_Overlay;                                      // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnUpdatePlatformType(ECommonPlatformType PlatformType);
	void OnInputMethodChanged(ECommonInputType NewMethod);
	void OnUpdateShakePercentage(float InPercentage);
	void BP_OnActivated();
	void OnUpdateShakeRecharge(float InPercentage);
	void ExecuteUbergraph_WinterQuestPresentScreen(int32 EntryPoint);
	void OnStopOpeningPresent();
	void OnStartOpeningPresent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WinterQuestPresentScreen_C">();
	}
	static class UWinterQuestPresentScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinterQuestPresentScreen_C>();
	}
};
static_assert(alignof(UWinterQuestPresentScreen_C) == 0x000008, "Wrong alignment on UWinterQuestPresentScreen_C");
static_assert(sizeof(UWinterQuestPresentScreen_C) == 0x0005D8, "Wrong size on UWinterQuestPresentScreen_C");
static_assert(offsetof(UWinterQuestPresentScreen_C, UberGraphFrame) == 0x0005C0, "Member 'UWinterQuestPresentScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWinterQuestPresentScreen_C, PlatformTypeSwitcher) == 0x0005C8, "Member 'UWinterQuestPresentScreen_C::PlatformTypeSwitcher' has a wrong offset!");
static_assert(offsetof(UWinterQuestPresentScreen_C, Root_Overlay) == 0x0005D0, "Member 'UWinterQuestPresentScreen_C::Root_Overlay' has a wrong offset!");

}

