#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuestTitleScreen

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WinterQuestTitleScreen.WinterQuestTitleScreen_C
// 0x0040 (0x04A8 - 0x0468)
class UWinterQuestTitleScreen_C final : public UFortWinterQuestTitleScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeFX;                                            // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_FadeFX;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWinterfest_OutsideCabinLogo_C*         Winterfest_OutsideCabinLogo;                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AFort_Entry_Music_Controller_BP_C*      Music_Entry;                                       // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_winterfest_widget;                              // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        Wind_Audio_Component;                              // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Ambient_Audio;                                     // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnResetScreen();
	void OnBeginCabinTransition();
	void EndTransition();
	void Construct();
	void BP_OnDeactivated();
	void BP_OnActivated();
	void ExecuteUbergraph_WinterQuestTitleScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WinterQuestTitleScreen_C">();
	}
	static class UWinterQuestTitleScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinterQuestTitleScreen_C>();
	}
};
static_assert(alignof(UWinterQuestTitleScreen_C) == 0x000008, "Wrong alignment on UWinterQuestTitleScreen_C");
static_assert(sizeof(UWinterQuestTitleScreen_C) == 0x0004A8, "Wrong size on UWinterQuestTitleScreen_C");
static_assert(offsetof(UWinterQuestTitleScreen_C, UberGraphFrame) == 0x000468, "Member 'UWinterQuestTitleScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWinterQuestTitleScreen_C, FadeFX) == 0x000470, "Member 'UWinterQuestTitleScreen_C::FadeFX' has a wrong offset!");
static_assert(offsetof(UWinterQuestTitleScreen_C, Image_FadeFX) == 0x000478, "Member 'UWinterQuestTitleScreen_C::Image_FadeFX' has a wrong offset!");
static_assert(offsetof(UWinterQuestTitleScreen_C, Winterfest_OutsideCabinLogo) == 0x000480, "Member 'UWinterQuestTitleScreen_C::Winterfest_OutsideCabinLogo' has a wrong offset!");
static_assert(offsetof(UWinterQuestTitleScreen_C, Music_Entry) == 0x000488, "Member 'UWinterQuestTitleScreen_C::Music_Entry' has a wrong offset!");
static_assert(offsetof(UWinterQuestTitleScreen_C, Is_winterfest_widget) == 0x000490, "Member 'UWinterQuestTitleScreen_C::Is_winterfest_widget' has a wrong offset!");
static_assert(offsetof(UWinterQuestTitleScreen_C, Wind_Audio_Component) == 0x000498, "Member 'UWinterQuestTitleScreen_C::Wind_Audio_Component' has a wrong offset!");
static_assert(offsetof(UWinterQuestTitleScreen_C, Ambient_Audio) == 0x0004A0, "Member 'UWinterQuestTitleScreen_C::Ambient_Audio' has a wrong offset!");

}

